Repository: koompi/kde-khmer-translation
Catalog: Applications in stable KF5-based/messages/akonadi-mime/libakonadi-kmime5.po
Languages: km

source: Empty Trash
km: សម្អាតធុងសំរាម

source: Are you sure you want to empty the trash folders of all accounts?
km: តើអ្នកពិតជាចង់លុបចោលធុងសំរាមនៃគណនីទាំងអស់មែនទេ?

source: Are you sure you want to mark all messages in this folder and all its subfolders?
km: តើអ្នកប្រាកដជាចង់សម្គាល់សារទាំងអស់ក្នុងថតនេះនិងថតរងរបស់វាឬ?

source: Mark All Recursively
km: គូសចំណាំទាំងអស់

# @title:column, message (e.g. email) subject
source: Subject
km: មុខវិជ្ជា

# @title:column, sender of message (e.g. email)
source: Sender
km: អ្នកផ្ញើ

# @title:column, receiver of message (e.g. email)
source: Receiver
km: អ្នកទទួល

# @title:column, message (e.g. email) timestamp
source: Date
km: កាលបរិច្ឆេទ

# @title:column, message (e.g. email) size
source: Size
km: ទំហំ

# @label Alternative text when email subject is missing
source: (No subject)
km: (គ្មាន​ប្រធាន)

# @label Alternative text when email sender is missing
source: (No sender)
km: (គ្មានអ្នកផ្ញើ)

# @label Alternative text when email recipient is missing
source: (No receiver)
km: (គ្មានអ្នកទទួល)

# @label Alternative text when email date/time is missing
source: (No date)
km: (គ្មានកាលបរិច្ឆេទ)

source: Retrieving items...
km: កំពុងទៅយករបស់ ...

source: Searching for duplicates...
km: កំពុងស្វែងរកស្ទួន ...

source: Removing duplicates...
km: កំពុងយកស្ទួនចេញ ...

# local mail folder
source: inbox
km: ប្រអប់ទទួល

# local mail folder
source: outbox
km: ប្រអប់ចេញ

# local mail folder
source: sent-mail
km: ផ្ញើតាមអ៊ីមែល

# local mail folder
source: trash
km: សំរាម

# local mail folder
source: drafts
km: សេចក្តីព្រាង

# local mail folder
source: templates
km: គំរូ

# local mail folder
source: Local Folders
km: ថតឯកសារក្នុងស្រុក

source: Add Folder...
km: បន្ថែមថតឯកសារ ...

source: Add a new folder to the currently selected account.
km: បន្ថែមថតឯកសារថ្មីទៅគណនីដែលបានជ្រើសរើសបច្ចុប្បន្ន។

# @title:window
source: New Folder
km: ប្រអប់​ឯកសារ​ថ្មី

source: Could not create folder: %1
km: មិនអាចបង្កើតថតឯកសារបានទេ៖ %1

source: Folder creation failed
km: ការបង្កើតថតបានបរាជ័យ

source: Copy Folder
km: ថតចំលងថតឯកសារ

source: Copy the selected folders to the clipboard.
km: ចម្លងថតដែលបានជ្រើសរើសទៅក្តារតម្បៀតខ្ទាស់។

# @title:window
source: Properties of Folder %1
km: លក្ខណៈសម្បត្តិរបស់ Folder %1

source: Delete Folder
km: លុបថតឯកសារ

source: Delete the selected folders from the account.
km: លុបថតដែលបានជ្រើសរើសចេញពីគណនី។

source: Do you really want to delete this folder and all its sub-folders?
km: តើអ្នកពិតជាចង់លុបថតនេះនិងថតរងទាំងអស់របស់វាឬ?

# @title:window
source: Delete folder?
km: លុបថតឯកសារ?

source: Could not delete folder: %1
km: មិនអាចលុបថតឯកសារបានទេ៖ %1

source: Folder deletion failed
km: ការលុបថតឯកសារបានបរាជ័យ

source: Update Folder
km: ធ្វើបច្ចុប្បន្នភាពថតឯកសារ

source: Update the contents of the selected folders.
km: ធ្វើបច្ចុប្បន្នភាពមាតិកានៃថតដែលបានជ្រើសរើស។

source: Cut Folder
km: កាត់ថតឯកសារ

source: Cut the selected folders from the account.
km: កាត់ថតដែលបានជ្រើសរើសចេញពីគណនី។

source: Folder Properties
km: លក្ខណៈសម្បត្តិថត

source: Open a dialog to edit the properties of the selected folder.
km: បើកប្រអប់ដើម្បីកែសម្រួលលក្ខណសម្បត្តិរបស់ថតដែលបានជ្រើសរើស។

source: Copy Message
km: ចម្លងសារ

source: Copy the selected messages to the clipboard.
km: ចម្លងសារដែលបានជ្រើសរើសទៅក្តារតម្បៀតខ្ទាស់។

source: Delete Message
km: លុបសារ

source: Delete the selected messages from the folder.
km: លុបសារដែលបានជ្រើសរើសចេញពីថតឯកសារ។

source: Do you really want to delete the selected message?
km: តើអ្នកពិតជាចង់លុបសារដែលបានជ្រើសរើសមែនទេ?

# @title:window
source: Delete Message?
km: លុបសារ?

source: Could not delete message: %1
km: មិនអាចលុបសារ៖ %1

source: Message deletion failed
km: ការលុបសារបានបរាជ័យ

source: Cut Message
km: កាត់សារ

source: Cut the selected message from the folder.
km: កាត់សារដែលបានជ្រើសរើសចេញពីថត។

source: Add &Account...
km: បន្ថែមគណនី ...

source: Add a new account<p>You will be presented with a dialog where you can select the type of the account that shall be added.</p>
km: បន្ថែមគណនីថ្មី <p> អ្នកនឹងត្រូវបានបង្ហាញជាមួយប្រអប់ដែលអ្នកអាចជ្រើសរើសប្រភេទគណនីដែលត្រូវបន្ថែម។ </p>

# @title:window
source: Add Account
km: បន្ថែមគណនី

source: Could not create account: %1
km: មិនអាចបង្កើតគណនីបានទេ៖ %1

source: Account creation failed
km: ការបង្កើតគណនីបានបរាជ័យ

source: &Delete Account
km: លុប​គណនី

source: Delete the selected accounts<p>The currently selected accounts will be deleted, along with all the messages they contain.</p>
km: លុបគណនីដែលបានជ្រើសរើស <p> គណនីដែលបានជ្រើសបច្ចុប្បន្ននឹងត្រូវបានលុបរួមជាមួយសារទាំងអស់ដែលពួកគេមាន។ </p>

source: Do you really want to delete this account?
km: តើអ្នកពិតជាចង់លុបគណនីនេះឬ?

# @title:window
source: Delete Account?
km: លុប​គណនី?

source: Account Properties...
km: លក្ខណៈសម្បត្តិគណនី ...

source: Open a dialog to edit properties of the selected account.
km: បើកប្រអប់ដើម្បីកែសម្រួលលក្ខណសម្បត្តិរបស់គណនីដែលបានជ្រើសរើស។

source: Update Account
km: ធ្វើបច្ចុប្បន្នភាពគណនី

source: Updates the content of all folders of the selected accounts.
km: ធ្វើបច្ចុប្បន្នភាពមាតិកាថតទាំងអស់នៃគណនីដែលបានជ្រើសរើស។

source: Update This Folder and All Its Subfolders
km: ធ្វើបច្ចុប្បន្នភាពថតឯកសារនេះនិងថតរងទាំងអស់

source: Update the contents of the selected folders and all their subfolders.
km: ធ្វើឱ្យទាន់សម័យមាតិកានៃថតដែលបានជ្រើសនិងថតរងរបស់ពួកគេទាំងអស់។

source: Could not paste message: %1
km: មិនអាចបិទភ្ជាប់សារ៖ %1

source: Paste failed
km: ការបិទភ្ជាប់បានបរាជ័យ

source: Remove Important Mark
km: យកម៉ាកសម្គាល់សំខាន់ចេញ

source: &Mark Message as Important
km: សម្គាល់សារថាសំខាន់

source: Remove Action Item Mark
km: លុបសញ្ញាសម្គាល់សកម្មភាព

source: &Mark Message as Action Item
km: សម្គាល់សារជាធាតុសកម្មភាព

source: &Mark Message as Read
km: សម្គាល់សារថាបានអាន

source: Mark as Read
km: សម្គាល់ថាអានរួច

source: Mark selected messages as read.
km: សម្គាល់សារដែលបានជ្រើសរើសថាអានរួច។

source: &Mark Message as Unread
km: សម្គាល់សារថាមិនទាន់អាន

source: Mark as Unread
km: សម្គាល់ថាមិនទាន់អាន

source: Mark selected messages as unread.
km: សម្គាល់សារដែលបានជ្រើសរើសថាមិនទាន់អាន។

source: Mark as Important
km: សម្គាល់ថាសំខាន់

source: Mark selected messages as important.
km: សម្គាល់សារដែលបានជ្រើសរើសថាសំខាន់។

source: Mark as Action Item
km: សម្គាល់ជាធាតុសកម្មភាព

source: Mark selected messages as action items.
km: សម្គាល់សារដែលបានជ្រើសរើសជាធាតុសកម្មភាព។

source: Mark &All Messages as Read
km: សម្គាល់សារទាំងអស់ថាអានរួច

source: Mark All as Read
km: សម្គាល់ទាំងអស់ថាអាន

source: Mark all messages as read.
km: សម្គាល់សារទាំងអស់ថាអានរួច។

source: Mark &All Messages as Read Recursively
km: សម្គាល់សារទាំងអស់ថាអានឡើងវិញ

source: Mark All as Read Recursively
km: សម្គាល់ទាំងអស់ថាត្រូវអានឡើងវិញ

source: Mark all messages as read recursively.
km: សម្គាល់សារទាំងអស់ថាអានឡើងវិញ។

source: Mark &All Messages as Unread
km: សម្គាល់សារទាំងអស់ថាមិនទាន់អាន

source: Mark All as Unread
km: សម្គាល់ទាំងអស់ថាមិនទាន់អាន

source: Mark all messages as unread.
km: សម្គាល់សារទាំងអស់ថាមិនទាន់អាន។

source: Mark &All Messages as Important
km: សម្គាល់សារទាំងអស់ថាសំខាន់

source: Mark All as Important
km: សម្គាល់ទាំងអស់ថាសំខាន់

source: Mark all messages as important.
km: សម្គាល់សារទាំងអស់ថាសំខាន់។

source: Mark All as Action Item
km: សម្គាល់ទាំងអស់ថាជាធាតុសកម្មភាព

source: Mark &All Messages as Action Item
km: សម្គាល់សារទាំងអស់ជាធាតុសកម្មភាព

source: Mark all messages as action items.
km: សម្គាល់សារទាំងអស់ជាធាតុសកម្មភាព។

source: Move to &Trash
km: ផ្លាស់ទីទៅធុងសំរាម

source: Move selected messages to the trash folder.
km: ផ្លាស់ទីសារដែលបានជ្រើសរើសទៅថតធុងសំរាម។

source: Move All to &Trash
km: ផ្លាស់ទីទាំងអស់ទៅធុងសំរាម

source: Move all messages to the trash folder.
km: ផ្លាស់ទីសារទាំងអស់ទៅថតធុងសំរាម។

source: Remove &Duplicate Messages
km: យកសារស្ទួនចេញ

source: Remove duplicate messages.
km: លុបសារស្ទួន។

source: Empty All &Trash Folders
km: ថតធុងសំរាមទាំងអស់

source: Permanently delete all messages from all trash folders.
km: លុបសារជាអចិន្ត្រៃយ៍ចេញពីថតធុងសំរាមទាំងអស់។

source: E&mpty Trash
km: សម្អាតធុងសំរាម

source: Permanently delete all messages from the trash folder.
km: លុបរាល់សារទាំងអស់ចេញពីថតធុងសំរាម។
