Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/audiocd-kio/audiocd_encoder_opus.po
Languages: km

source: Vorbis Encoding Complexity or Bitrate
km: ការអ៊ិនកូដឌីវីកូសស្មុគស្មាញឬប៊ីត

source: Constant bitrate specified
km: អត្រាប៊ីតថេរបានបញ្ជាក់

source: Constrained variable bitrate specified
km: អត្រាប៊ីតអថេរថេរបានបញ្ជាក់

source: Average variable bitrate specified
km: អត្រាប៊ីតអថេរមធ្យមបានបញ្ជាក់

source: Add Comments
km: បន្ថែមយោបល់

source: Complexity
km: ភាពស្មុគស្មាញ

source: Constant bitrate
km: អត្រាប៊ីតថេរ

source: Constrained variable bitrate
km: អត្រាប៊ីតអថេរថេរ

source: Average variable bitrate
km: អត្រាប៊ីតអថេរមធ្យម

source: &Encoding Method
km: វិធីសាស្ត្រអ៊ិនកូដ

source: Complexity based
km: ផ្អែកលើភាពស្មុគស្មាញ

source: Bitrate based
km: ផ្អែកលើអត្រាប៊ីត

source: Opus Bitrate Settings
km: ការកំណត់អត្រាប៊ីត Opus

source: C&onstant bitrate:
km: អត្រាប៊ីតថេរ៖

source: 96 kbps
km: ៩៦ kbps

source: 6 kbps
km: ៦ kbps

source: 12 kbps
km: ១២ kbps

source: 24 kbps
km: ២៤ kbps

source: 48 kbps
km: ៤៨ kbps

source: 64 kbps
km: ៦៤ kbps

source: 80 kbps
km: ៨០ kbps

source: 128 kbps
km: ១២៨ kbps

source: 160 kbps
km: ១៦០ kbps

source: 192 kbps
km: ១៩២ kbps

source: 256 kbps
km: ២៥៦ kbps

source: Co&nstrained variable bitrate:
km: អត្រាប៊ីតអថេរថេរ៖

source: A&verage variable bitrate:
km: អត្រាប៊ីតអថេរមធ្យម៖

source: You can set the complexity of the encoded stream here. A higher value implies a higher complexity but encodes slower.
km: អ្នកអាចកំណត់ភាពស្មុគស្មាញនៃចរន្តដែលបានអ៊ិនកូដនៅទីនេះ។ តម្លៃកាន់តែខ្ពស់បញ្ជាក់ពីភាពស្មុគស្មាញខ្ពស់តែអ៊ិនកូដយឺតជាង។

source: Opus Co&mplexity Setting
km: ការកំណត់ស្មុគស្មាញ Opus

source: Higher is better but slower
km: ខ្ពស់ជាងនេះល្អជាងប៉ុន្តែយឺតជាង

source: Options
km: ជម្រើស

source: Add a description of the song to the file header. This makes it easy for the user to get advanced song information shown by his media player. You can get this information automatically via the Internet. Look at the <i>"CDDB Retrieval"</i> control module for details.
km: បន្ថែមការពិពណ៌នានៃបទចម្រៀងទៅបឋមកថាឯកសារ។ នេះផ្តល់ភាពងាយស្រួលដល់អ្នកប្រើប្រាស់ក្នុងការទទួលបានព័ត៌មានចម្រៀងជឿនលឿនដែលបង្ហាញដោយអ្នកលេងមេឌារបស់គាត់។ អ្នកអាចទទួលបានព័ត៌មាននេះដោយស្វ័យប្រវត្តិតាមរយៈអ៊ីនធឺណិត។ មើល​ទៅ​កាន់ <i> "CDDB Retrieval" </i> ម៉ូឌុលត្រួតពិនិត្យសម្រាប់ព័ត៌មានលម្អិត។

source: Add &track information
km: បន្ថែមព័ត៌មានបទ
