Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/audiocd-kio/audiocd_encoder_lame.po
Languages: km

source: Constant Bitrate
km: អត្រាប៊ីតថេរ

source: Variable Bitrate
km: អត្រាប៊ីតអថេរ

source: Stereo Mode
km: របៀបស្តេរ៉េអូ

source: Quality
km: គុណភាព

source: Byte Swap
km: ស្វបបៃ

source: Copyrighted
km: រក្សាសិទ្ធិ

source: Original
km: ដើម

source: ISO Encoding
km: ការអ៊ិនកូដអាយអេសអូ

source: Error protection
km: ការការពារកំហុស

source: Write ID3 Tag
km: សរសេរស្លាកលេខ ៣

source: Constant Bitrate Settings
km: ការកំណត់អត្រាប៊ីតថេរ

source: Minimal bitrate
km: អត្រាប៊ីតអប្បបរមា

source: Minimal Value is a hard limit
km: តម្លៃអប្បបរមាគឺជាដែនកំណត់ពិបាក

source: Maximal bitrate
km: អត្រាប៊ីតអតិបរមា

source: Average bitrate
km: អត្រាចង្វាក់មធ្យម

source: Write Xing VBR tag
km: សរសេរស្លាក Xing VBR

source: Minimal bitrate value
km: តម្លៃអត្រាចង្វាក់អប្បបរមា

source: Maximal bitrate value
km: តម្លៃអត្រាចង្វាក់អតិបរិមា

source: Average bitrate value
km: តម្លៃអត្រាចង្វាក់មធ្យម

source: Enable the lowpass filter
km: បើកដំណើរការតម្រងច្រកទាប

source: Value of the cutoff frequency for the lowpass filter
km: តម្លៃនៃប្រេកង់កាត់សម្រាប់តម្រងច្រកទាប

source: Enable the highpass filter
km: បើកដំណើរការតម្រងច្រកខ្ពស់

source: Value of the cutoff frequency for the highpass filter
km: តម្លៃនៃប្រេកង់កាត់សម្រាប់តម្រងច្រកខ្ពស់

source: Lowpass filter width
km: ទទឹងតម្រងទាប

source: Lowpass filter width value
km: តម្លៃទទឹងតម្រងទាប

source: Highpass filter width
km: ទទឹងតម្រងខ្ពស់

source: Options
km: ជម្រើស

source: Cop&yrighted
km: រក្សាសិទ្ធិ

source: Mark MP3 file as copyrighted
km: សម្គាល់ឯកសារ MP3 ជាឯកសាររក្សាសិទ្ធិ

source: Mark MP3 file as copyrighted.
km: សម្គាល់ឯកសារ MP3 ជាឯកសាររក្សាសិទ្ធិ។

source: Origi&nal
km: ដើម

source: Mark MP3 file as an original
km: សម្គាល់ឯកសារ MP3 ជាឯកសារដើម

source: Mark MP3 file as an original.
km: សម្គាល់ឯកសារ MP3 ជាឯកសារដើម។

source: &ISO encoding
km: ការអ៊ិនកូដអាយអេសអូ

source: Try to use strict ISO encoding
km: ព្យាយាមប្រើការអ៊ិនកូដអាយអេសអូយ៉ាងតឹងរឹង

source: This selects the maximal bitrate used for encoding.
km: វាជ្រើសរើសអត្រាប៊ីតអតិបរិមាដែលបានប្រើសម្រាប់ការអ៊ិនកូដ។

source: &Error protection
km: ការការពារកំហុស

source: &Write ID3 tag
km: សរសេរស្លាកលេខ ៣

source: If checked and if cddb support is available, an id3 tag will be appended
km: ប្រសិនបើបានគូសធីកហើយប្រសិនបើមានការគាំទ្រ cddb ស្លាក id3 នឹងត្រូវបានបន្ថែមនៅខាងចុង

source: Encoding Method
km: វិធីសាស្ត្រអ៊ិនកូដ

source: Low
km: ទាប

source: High
km: ខ្ពស់

source: &Quality:
km: គុណភាព៖

source: This option controls whether MP3 files are recorded with one or two channels. Note that choosing <i>"Mono"</i> reduces file size, but also kills the stereo signal.
km: ជម្រើសនេះគ្រប់គ្រងថាតើឯកសារ MP3 ត្រូវបានថតជាមួយប៉ុស្តិ៍មួយឬពីរ។ ចំណាំថាការជ្រើសរើស <i> "Mono" </i> កាត់បន្ថយទំហំឯកសារប៉ុន្តែក៏សម្លាប់សញ្ញាស្តេរ៉េអូ។

source: Stereo
km: ស្តេរ៉េអូ

source: Joint Stereo
km: រួមស្តេរ៉ូ

source: Dual Channel
km: ឆានែលទ្វេ

source: Mono
km: មនោ

source: Constant bitrate
km: អត្រាប៊ីតថេរ

source: Variable bitrate
km: អត្រាប៊ីតអថេរ

source: Variable Bitrate Settings
km: ការកំណត់អត្រាប៊ីតអថេរ

source: Avera&ge bitrate:
km: អត្រាចង្វាក់មធ្យម៖

source: This selects the average bitrate used for encoding.
km: វាជ្រើសរើសអត្រាប៊ីតជាមធ្យមដែលប្រើសម្រាប់ការអ៊ិនកូដ។

source: 32 kbs
km: ៣២ kbs

source: 40 kbs
km: ៤០ kbs

source: 48 kbs
km: ៤៨ kbs

source: 56 kbs
km: ៥៦ kbs

source: 64 kbs
km: ៦៤ kbs

source: 80 kbs
km: ៨០ kbs

source: 96 kbs
km: ៩៦ kbs

source: 112 kbs
km: ១១២ kbs

source: 128 kbs
km: ១២៨ kbs្រ

source: 192 kbs
km: ១៩២ kbs

source: 224 kbs
km: ២២៤ kbs

source: 256 kbs
km: ២៥៦ kbs

source: 320 kbs
km: ៣២០ kbs

source: Maximal bi&trate:
km: អត្រាប៊ីតអតិបរមា៖

source: Write &Xing VBR tag
km: សរសេរស្លាក Xing VBR

source: This writes additional information related to VBR as introduced by Xing.
km: នេះសរសេរព័ត៌មានបន្ថែមទាក់ទងនឹង VBR ដូចដែលណែនាំដោយស៊ីង។

source: Minimal &value is a hard limit
km: តម្លៃអប្បបរមាគឺជាដែនកំណត់រឹង

source: Minimal &bitrate:
km: អត្រាប៊ីតអប្បបរមា៖

source: This selects the minimal bitrate used for encoding.
km: វាជ្រើសរើសអត្រាប៊ីតអប្បបរមាដែលត្រូវបានប្រើសម្រាប់ការអ៊ិនកូដ។

source: Bitrate:
km: អត្រាប៊ីត៖

source: The higher the bitrate, the better the quality and the larger the file.
km: អត្រាប៊ីតកាន់តែខ្ពស់គុណភាពនិងឯកសារកាន់តែធំ។

source: Filter Settings
km: ការកំណត់តម្រង

source: Apply &lowpass filter above
km: អនុវត្តតម្រងទាបនៅខាងលើ

source: Apply &highpass filter below
km: អនុវត្តតម្រងច្រកខ្ពស់ខាងក្រោម

source: Low&pass filter width
km: ទទឹងតម្រងទាប

source: Highpa&ss filter width
km: ទទឹងតម្រងខ្ពស់
