Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/audiocd-kio/kio_audiocd.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: CDDB Information
km: ព័ត៌មាន CDDB

source: Information
km: ព័ត៌មាន

source: Full CD
km: ស៊ីឌីពេញ

source: You cannot specify a host with this protocol. Please use the audiocd:/ format instead.
km: អ្នកមិនអាចបញ្ជាក់ម៉ាស៊ីនជាមួយពិធីការនេះទេ។ សូមប្រើទម្រង់សោតទស្សន៍ជំនួសវិញ។

# The URL does not include a device name
source: Missing device specification
km: បាត់ការបញ្ជាក់ឧបករណ៍

source: Device does not have read permissions for this account. Check the read permissions on the device.
km: ឧបករណ៍មិនមានសិទ្ធិអានសម្រាប់គណនីនេះទេ។ ពិនិត្យសិទ្ធិអាននៅលើឧបករណ៍។

source: Device does not have write permissions for this account. Check the write permissions on the device.
km: ឧបករណ៍មិនមានសិទ្ធិសរសេរសម្រាប់គណនីនេះទេ។ ពិនិត្យសិទ្ធិសរសេរនៅលើឧបករណ៍។

source: Unknown error. If you have a cd in the drive try running cdparanoia -vsQ as yourself (not root). Do you see a track list? If not, make sure you have permission to access the CD device. If you are using SCSI emulation (possible if you have an IDE CD writer) then make sure you check that you have read and write permissions on the generic SCSI device, which is probably /dev/sg0, /dev/sg1, etc.. If it still does not work, try typing audiocd:/?device=/dev/sg0 (or similar) to tell kio_audiocd which device your CD-ROM is.
km: កំហុសមិនស្គាល់។ ប្រសិនបើអ្នកមានស៊ីឌីនៅក្នុងដ្រាយព្យាយាមរត់ cdparanoia -vsQ ដូចជាខ្លួនអ្នក (មិនមែនជា root) ។ តើអ្នកឃើញបញ្ជីបទទេ? បើមិនដូច្នោះទេសូមប្រាកដថាអ្នកមានសិទ្ធិចូលប្រើស៊ីឌី។ ប្រសិនបើអ្នកកំពុងប្រើការត្រាប់តាមអេសស៊ីអាយ (អាចធ្វើទៅបានប្រសិនបើអ្នកមានអ្នកសរសេរស៊ីឌីអ៊ីឌី) បន្ទាប់មកអ្នកត្រូវប្រាកដថាអ្នកបានពិនិត្យថាអ្នកបានអាននិងសរសេរសិទ្ធិលើឧបករណ៍អេសស៊ីអេសអេសអេសអេសដែលប្រហែលជា / dev / sg0, / dev / sg1 ។ ល។ ប្រសិនបើវានៅតែមិនដំណើរការសូមព្យាយាមវាយ audiocd៖ /? device = / dev / sg0 (ឬស្រដៀងគ្នា) ដើម្បីប្រាប់ kioaudiocd ថាតើស៊ីឌីរ៉ូមរបស់អ្នកមួយណា។

source: AudioCD: Disk damage detected on this track, risk of data corruption.
km: អូឌីយ៉ូស៊ីឌី៖ ការបំផ្លាញថាសនៅលើបទនេះហានិភ័យនៃការពុករលួយទិន្នន័យ។

source: Error reading audio data for %1 from the CD
km: កំហុសក្នុងការអានទិន្នន័យអូឌីយ៉ូសម្រាប់ %1 ពីស៊ីឌី

source: Could not read %1: encoding failed
km: មិនអាចអាន %1៖ បានបរាជ័យក្នុងការអ៊ិនកូដ

source: Track %1
km: តាមដាន %1
