Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/artikulate/artikulate.po
Languages: km

# Language Title
source: Bengali
km: បង់ក្លាដែស

# Language Title
source: Catalan
km: កាតាឡាន

# Language Title
source: German
km: អាឡឺម៉ង់

# Language Title
source: Dutch
km: ហូឡង់

# Language Title
source: British English
km: អង់គ្លេសអង់គ្លេស

# Language Title
source: English
km: អង់គ្លេស

# Language Title
source: French
km: បារាំង

# Language Title
source: Greek
km: ក្រិក

# Language Title
source: Hindi
km: ហិណ្ឌូ

# Language Title
source: Italian
km: អ៊ីតាលី

# Language Title
source: Marathi
km: ម៉ារ៉ាធី

# Language Title
source: Polish
km: ប៉ូឡូញ

# Language Title
source: Spanish
km: អេស្ប៉ាញ

# @item:inlistbox unknown learning goal
source: unknown
km: មិនស្គាល់

# @title:column
source: Learning Goal
km: គោលដៅនៃការរៀនសូត្រ

source: Open Image
km: បើករូបភាព

source: Image Files (*.png *.jpg *.bmp)
km: ឯកសាររូបភាព (* .png * .jpg * .bmp)

source: Invalid database version '%1'.
km: កំណែមូលដ្ឋានទិន្នន័យមិនត្រឹមត្រូវ '%1' ។

# default sound device
source: Default
km: លំនាំដើម

source: If true, the main menu bar is shown.
km: ប្រសិនបើពិតរបារម៉ឺនុយមេត្រូវបានបង្ហាញ។

source: If enabled, course files are only read from the local contributor repository
km: ប្រសិនបើបានបើកឯកសារវគ្គសិក្សាត្រូវបានអានតែពីឃ្លាំងអ្នកចូលរួមក្នុងមូលដ្ឋានប៉ុណ្ណោះ

source: Path to local contributor repository
km: ផ្លូវទៅកាន់ឃ្លាំងអ្នកចូលរួមក្នុងតំបន់

source: Name of audio input device
km: ឈ្មោះឧបករណ៍បញ្ចូលសំលេង

source: Audio input volume
km: បរិមាណបញ្ចូលសំលេង

source: Audio output volume
km: កម្រិតសំឡេងលទ្ធផលអូឌីយ៉ូ

source: Font
km: ពុម្ពអក្សរ

source: Set either to 'qtmultimediabackend' or 'qtgstreamerbackend', selected on runtime if available.
km: កំណត់ទៅ 'qtmultimediabackend' ឬ 'qtgstreamerbackend' ដែលបានជ្រើសពេលរត់បើមាន។

source: Please select a course
km: សូមជ្រើសរើសវគ្គសិក្សា

source: New Unit
km: ខ្នាតថ្មី

# @title KAboutData: short program description
source: Artikulate Pronunciation Trainer
km: គ្រូបណ្តុះបណ្តាលជំនាញសំអាងការ

# @info:credit
source: (c) 2013-2020 The Artikulate Developers
km: (គ) ឆ្នាំ ២០១៣-២០២០ អ្នកអភិវឌ្ឍន៍អាកទីក

# @title Short program description
source: Train your pronunciation in a foreign language.
km: បណ្តុះបណ្តាលការបញ្ចេញសំឡេងរបស់អ្នកជាភាសាបរទេស។

# @info:credit Role
source: Original Author
km: អ្នកនិពន្ធដើម

# @info:credit Role
source: Developer
km: អ្នកអភិវឌ្ឍន៍

# @info:credit Role
source: Developer and Course Data
km: អ្នកអភិវឌ្ឍន៍និងទិន្នន័យវគ្គសិក្សា

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

# @title Displayed program name
source: Artikulate Editor
km: អ្នកកែសំរួល Artikulate

# @title KAboutData: short program description
source: Artikulate Course Editor
km: អ្នកកែសំរួលវគ្គសិក្សា Artikulate

# @info:credit
source: (c) 2013-2019 The Artikulate Developers
km: (c) ឆ្នាំ ២០១៣-២០១៩ អ្នកអភិវឌ្ឍន៍អាកឃី

# @title Short program description
source: Edit Artikulate course files.
km: កែសម្រួលឯកសារវគ្គសិក្សា Artikulate ។

source: Unnamed Identity
km: អត្តសញ្ញាណមិនបញ្ចេញឈ្មោះ

# @item:inlistbox:
source: unknown
km: មិនស្គាល់

# @title:column
source: Course
km: វគ្គសិក្សា

# @title:column
source: Language
km: ភាសា

source: Words
km: ពាក្យ

source: Sentences
km: ប្រយោគ

source: Expressions
km: កន្សោម

source: Paragraphs
km: កថាខណ្ឌ

# @title:column
source: Phoneme Group
km: ផុនមេគ្រុប

# @title:column
source: Phoneme
km: ផុនមេ

# @title:column
source: Phoneme Unit
km: ឯកតាផុនមេ

# @title:column
source: Phrase
km: ឃ្លា

# @title:column
source: Profile
km: ប្រវត្តិរូប

# @title:column
source: Skeleton
km: គ្រោងឆ្អឹង

# @title:column
source: Unit
km: ខ្នាត

source: Training
km: ការបណ្តុះបណ្តាល

source: Download Training
km: ទាញយកការបណ្តុះបណ្តាល

source: About Artikulate
km: អំពីអាឃីទីក

source: Course Configuration
km: កំណត់រចនាសម្ព័ន្ធវគ្គសិក្សា

source: Prototype Configuration
km: ការកំណត់រចនាសម្ព័ន្ធគំរូ

source: Prototype Description
km: ការពិពណ៌នាគំរូ

source: Course Description
km: ការពិពណ៌នាវគ្គ

source: Title:
km: ចំណងជើង៖

source: Localized Title:
km: ចំណងជើងធ្វើមូលដ្ឋានីយកម្ម៖

source: Description:
km: ការពិពណ៌នាសង្ខេប៖

source: Language:
km: ភាសា៖

source: Prototype
km: គំរូ

source: Update from Prototype:
km: ធ្វើបច្ចុប្បន្នភាពពីគំរូដើម៖

source: Update
km: ធ្វើបច្ចុប្បន្នភាព

source: Update the course with elements from prototype.
km: ធ្វើបច្ចុប្បន្នភាពវគ្គសិក្សាជាមួយធាតុពីគំរូដើម។

source: Download Training Material
km: ទាញយកឯកសារបណ្តុះបណ្តាល

# @action:button
source: Update
km: ធ្វើបច្ចុប្បន្នភាព

# @action:button
source: Install
km: ដំឡើង

# @action:button
source: Remove
km: លុប

source: Edit Course
km: កែសម្រួលវគ្គសិក្សា

source: Previous
km: មុន

source: Switch to previous phrase.
km: ប្តូរទៅឃ្លាមុន។

source: Next
km: បន្ទាប់

source: Switch to next phrase.
km: ប្តូរទៅឃ្លាបន្ទាប់។

source: Delete
km: លុប

source: Delete this phrase.
km: លុបឃ្លានេះ។

source: Create Phrase
km: បង្កើតឃ្លា

source: Create phrase after current phrase.
km: បង្កើតឃ្លាបន្ទាប់ពីឃ្លាបច្ចុប្បន្ន។

source: Welcome to Artikulate Course Editor
km: សូមស្វាគមន៍មកកាន់កម្មវិធីនិពន្ធវគ្គសិក្សារបស់អាឃីក

# @action:button
source: Edit Course
km: កែសម្រួលវគ្គសិក្សា

source: Courses
km: វគ្គសិក្សា

source: Repository
km: ឃ្លាំង

source: Save
km: រក្សាទុក

source: About Artikulate Editor
km: អំពីកម្មវិធីនិពន្ធអាក្រាក

source: Select Prototype
km: ជ្រើសរើសគំរូ

# @action:button
source: Edit Prototype
km: កែសម្រួលគំរូ

source: Unit
km: ឯកតា

source: Unit:
km: ឯកតា៖

source: Localized Unit:
km: អង្គភាពធ្វើមូលដ្ឋានីយកម្ម៖

source: Phrase:
km: ឃ្លា៖

source: Localized Phrase:
km: ឃ្លាដែលបានធ្វើមូលដ្ឋានីយកម្ម៖

source: Edit State:
km: កែប្រែរដ្ឋ៖

# state
source: Unknown
km: មិនស្គាល់

# state
source: Translated
km: បានបកប្រែ

# state
source: Completed
km: បានបញ្ចប់

source: Native Speaker Recording
km: ឧបករណ៍ថតសំលេងនិយាយដើម

source: Existing Recording:
km: ការកត់ត្រាដែលមានស្រាប់៖

source: Create New Recording:
km: បង្កើតការកត់ថ្មី៖

source: Replace Existing Recording
km: ជំនួសការកត់ត្រាដែលមានស្រាប់

source: Dismiss
km: បោះបង់ចោល

source: Difficulty:
km: ភាពលំបាក៖

source: Word
km: ពាក្យ

source: Expression
km: ការបញ្ចេញមតិ

source: Sentence
km: ប្រយោគ

source: Paragraph
km: កថាខណ្ឌ

source: Learner
km: អ្នកសិក្សា

source: Favorite Languages
km: ភាសាដែលខ្ញុំចូលចិត្ត

source: Create New Learner Identity
km: បង្កើតអត្តសញ្ញាណអ្នកសិក្សាថ្មី

source: Use Selected Identity
km: ប្រើអត្តសញ្ញាណដែលបានជ្រើសរើស

source: Configure Profile
km: កំណត់រចនាសម្ព័ន្ធប្រវត្តិរូប

source: Edit
km: កែសម្រួល

source: Select Image
km: ជ្រើសរើសរូបភាព

source: Clear Image
km: សម្អាតរូបភាព

source: Delete User
km: លុបអ្នកប្រើប្រាស់

source: Name
km: ឈ្មោះ

source: Change Image
km: ផ្លាស់ប្តូររូបភាព

source: Done
km: ធ្វើរួច

source: Do you really want to delete this identity "<b>%1</b>"?
km: តើអ្នកពិតជាចង់លុបអត្តសញ្ញាណនេះ " <b> %1 </b> "?

source: Cancel
km: បោះបង់

source: Repository Configuration
km: ការកំណត់រចនាសម្ព័ន្ធឃ្លាំង

source: Select Repository Folder
km: ជ្រើសថតឯកសារឃ្លាំង

source: Repository:
km: ឃ្លាំង៖

source: Change Folder
km: ផ្លាស់ប្តូរថតឯកសារ

source: Play
km: ចាក់

source: Record
km: កំណត់ត្រា

source: Attempts
km: ការប៉ុនប៉ង

source: Category: no category selected
km: ប្រភេទ៖ គ្មានប្រភេទត្រូវបានជ្រើសរើស

source: Category: %1
km: ប្រភេទ៖ %1

source: Mark current phrase as completed and proceed with next one.
km: សម្គាល់ឃ្លាបច្ចុប្បន្នដែលបានបញ្ចប់ហើយបន្តជាមួយឃ្លាបន្ទាប់។

source: Skip
km: រំលង

source: Skip current phrase and proceed with next one.
km: រំលងឃ្លាបច្ចុប្បន្នហើយបន្តមួយឃ្លាបន្ទាប់។

source: Play original
km: លេងដើម

source: Record yourself
km: កត់ត្រាដោយខ្លួនឯង

source: Play yourself
km: លេងដោយខ្លួនឯង

source: Welcome to Artikulate
km: សូមស្វាគមន៍មកកាន់ Artikulate

# @action:button
source: Start Training
km: ចាប់ផ្តើមបណ្តុះបណ្តាល
