Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/akonadi-calendar/libakonadi-calendar5.po
Languages: km

source: Could not find incidence to update, it probably was deleted recently.
km: មិនអាចរកឃើញឧប្បត្តិហេតុដើម្បីធ្វើបច្ចុប្បន្នភាពទេវាប្រហែលជាត្រូវបានលុបថ្មីៗនេះ។

source: Error performing deletion.
km: កំហុសក្នុងការអនុវត្តការលុប។

source: Error performing copy.
km: មានកំហុសក្នុងការថតចំលង។

source: Can't find item: %1
km: មិនអាចរកឃើញធាតុ៖ %1

source: Error while removing relations.
km: មានកំហុសនៅពេលដកចេញទំនាក់ទំនង។

source: Error while deleting incidences: %1
km: កំហុសពេលលុបឧប្បត្តិហេតុ៖ %1

source: The item "%1" has sub-to-dos. Do you want to cut just this item and make all its sub-to-dos independent, or cut the to-do with all its sub-to-dos?
km: ធាតុ " %1" មានការងារត្រូវធ្វើ។ តើអ្នកចង់កាត់ធាតុនេះហើយធ្វើឱ្យការងារត្រូវធ្វើរបស់វាទាំងអស់ឯករាជ្យឬកាត់ការងារដែលត្រូវធ្វើជាមួយអនុការងារត្រូវធ្វើទាំងអស់?

source: KOrganizer Confirmation
km: ការបញ្ជាក់របស់ Korganizer

source: Cut Only This
km: កាត់តែនេះ

source: Cut All
km: កាត់ទាំងអស់

source: The item "%1" has sub-to-dos. Do you want to copy just this item or copy the to-do with all its sub-to-dos?
km: ធាតុ " %1" មានការងារត្រូវធ្វើ។ តើអ្នកចង់ចម្លងធាតុនេះឬចម្លងការងារត្រូវធ្វើជាមួយការងារត្រូវធ្វើរបស់វាទាំងអស់ទេ?

source: Copy Only This
km: ចម្លងតែប៉ុណ្ណឹង

source: Copy All
km: ចម្លងទាំងអស់

# @title:column calendar event summary
source: Summary
km: សង្ខេប

# @title:column calendar event start date and time
source: Start Date and Time
km: កាលបរិច្ឆេទនិងពេលវេលាចាប់ផ្តើម

# @title:column calendar event end date and time
source: End Date and Time
km: កាលបរិច្ឆេទនិងពេលវេលាបញ្ចប់

# @title:column calendar event type
source: Type
km: ប្រភេទ

# @title:column todo item due date and time
source: Due Date and Time
km: កាលបរិច្ឆេទនិងពេលវេលាដល់កំណត់

# @title:column todo item priority
source: Priority
km: អាទិភាព

# @title:column todo item completion in percent
source: Complete
km: បញ្ចប់

# @title:column calendar title
source: Calendar
km: ប្រតិទិន

source: Free/Busy Publish URL
km: URL ផ្សាយពាណិជ្ជកម្មទំនេរ / រវល់

source: URL for publishing free/busy information
km: URL សម្រាប់ផ្សព្វផ្សាយព័ត៌មានទំនេរ / រវល់

source: Free/Busy Publish Username
km: ឈ្មោះអ្នកប្រើផ្សាយដោយឥតគិតថ្លៃ / រវល់

source: Username for publishing free/busy information
km: ឈ្មោះអ្នកប្រើសម្រាប់ផ្សព្វផ្សាយព័ត៌មានទំនេរ / រវល់

source: Free/Busy Publish Password
km: ពាក្យសម្ងាត់បោះពុម្ព / រវល់

source: Password for publishing free/busy information
km: ពាក្យសម្ងាត់សម្រាប់ផ្សព្វផ្សាយព័ត៌មានទំនេរ / រវល់

source: Enable Automatic Free/Busy Retrieval
km: បើកដំណើរការទាញយកដោយឥតគិតថ្លៃ / រវល់ដោយស្វ័យប្រវត្តិ

source: Use full email address for retrieval
km: ប្រើអាសយដ្ឋានអ៊ីមែលពេញលេញដើម្បីទៅយក

source: With this setting, you can change the filename that will be fetched from the server. With this checked, it will download a free/busy file called user@domain.ifb, for example nn@kde.org.ifb. Without this set, it will download user.ifb, for example nn.ifb.
km: ជាមួយនឹងការកំណត់នេះអ្នកអាចប្តូរឈ្មោះឯកសារដែលនឹងត្រូវបានទៅយកពីម៉ាស៊ីនមេ។ ជាមួយនឹងការធីកនេះវានឹងទាញយកឯកសារទំនេរ / រវល់មួយដែលមានឈ្មោះថា user@domain។ifb ឧទាហរណ៍ nn@kde។org។ifb ។ បើគ្មានសំណុំនេះទេវានឹងទាញយក user។ifb ឧទាហរណ៍ nn។ifb ។

source: Free/Busy Retrieval URL
km: URL ទាញយកដោយឥតគិតថ្លៃ / រវល់

source: Free/Busy Retrieval Username
km: ឈ្មោះអ្នកប្រើទាញយកដោយឥតគិតថ្លៃ / រវល់

source: Free/Busy Retrieval Password
km: ពាក្យសម្ងាត់ដើម្បីទៅយកដោយឥតគិតថ្លៃ / រវល់

source: Password for retrieving free/busy information
km: ពាក្យសម្ងាត់សម្រាប់ការទាញយកព័ត៌មានទំនេរ / រវល់

source: Send copy to owner when mailing events
km: ផ្ញើច្បាប់ចម្លងទៅម្ចាស់នៅពេលផ្ញើព្រឹត្តិការណ៍

source: Check this box to get a copy of all e-mail messages that KOrganizer sends at your request to event attendees.
km: ធីកប្រអប់នេះដើម្បីទទួលបានច្បាប់ចម្លងនៃសារអ៊ីមែលទាំងអស់ដែល Korganizer ផ្ញើតាមការស្នើសុំរបស់អ្នកទៅកាន់អ្នកចូលរួមព្រឹត្តិការណ៍។

source: Mail transport to use for sending e-mail messages
km: ការដឹកជញ្ជូនតាមសំបុត្រដើម្បីប្រើសម្រាប់ផ្ញើសារតាមអ៊ីមែល

source: If specified all, groupware e-mails will use this transport. Otherwise, the default one will be used.
km: ប្រសិនបើបានបញ្ជាក់ទាំងអស់អ៊ីមែលក្រុមប្រើនឹងប្រើការដឹកជញ្ជូននេះ។ បើមិនដូច្នោះទេលំនាំដើមនឹងត្រូវបានប្រើ។

source: Send Outlook-like pseudo counter proposals
km: ផ្ញើសំណើរាប់ក្លែងក្លាយរបស់ចក្ខុវិស័យ

source: Check whether hostname and retrieval email address match
km: ពិនិត្យមើលថាតើឈ្មោះម៉ាស៊ីននិងការទាញយកអាសយដ្ឋានអ៊ីមែលត្រូវគ្នា

source: With this setting you can configure whether the domain part of the free/busy URL has to match the domain part of the user ID you are looking for. For example, if this option is set, then looking for the free/busy data of joe@mydomain.com on the server www.yourdomain.com will fail.
km: ជាមួយការកំណត់នេះអ្នកអាចកំណត់ថាតើផ្នែកដែនរបស់ URL ទំនេរ / រវល់ត្រូវផ្គូផ្គងផ្នែកដូនៃលេខសម្គាល់អ្នកប្រើដែលអ្នកកំពុងស្វែងរក។ ឧទាហរណ៍ប្រសិនបើជម្រើសនេះត្រូវបានកំណត់បន្ទាប់មកការស្វែងរកទិន្នន័យទំនេរ / រវល់របស់ joe@mydomain។com នៅលើម៉ាស៊ីនមេ www។yourdomain។com នឹងបរាជ័យ។

source: Failed to download free/busy data from: %1 Reason: %2
km: បានបរាជ័យក្នុងការទាញយកទិន្នន័យទំនេរ / រវល់ពី៖ %1 មូលហេតុ៖ %2

source: Free/busy retrieval error
km: កំហុសក្នុងការទៅយកដោយឥតគិតថ្លៃ / រវល់

source: Failed to parse free/busy information that was retrieved from: %1
km: បានបរាជ័យក្នុងការញែកព័ត៌មានទំនេរ / រវល់ដែលត្រូវបានទាញយកពី៖ %1

source: <qt><p>The software could not upload your free/busy list to the URL '%1'. There might be a problem with the access rights, or you specified an incorrect URL. The system said: <em>%2</em>.</p><p>Please check the URL or contact your system administrator.</p></qt>
km: <qt><p> កម្មវិធីមិនអាចផ្ទុកឡើងបញ្ជីទំនេរ / រវល់របស់អ្នកទៅ URL '%1' ។ វាអាចមានបញ្ហាជាមួយសិទ្ធិចូលប្រើឬអ្នកបានបញ្ជាក់ URL មិនត្រឹមត្រូវ។ ប្រព័ន្ធនេះបាននិយាយថា៖ <em> %2 </em> ។ </p><p> សូមពិនិត្យមើល URL ឬទាក់ទងអ្នកគ្រប់គ្រងប្រព័ន្ធរបស់អ្នក។ </p></qt>

source: The free/busy information was successfully sent.
km: ព័ត៌មានទំនេរ / រវល់ត្រូវបានផ្ញើដោយជោគជ័យ។

source: Sending Free/Busy
km: ការផ្ញើដោយឥតគិតថ្លៃ / រវល់

source: Unable to publish the free/busy data: %1
km: មិនអាចផ្សព្វផ្សាយទិន្នន័យទំនេរ / រវល់បានទេ៖ %1

source: <qt><p>No URL configured for uploading your free/busy list. Please set it in KOrganizer's configuration dialog, on the "Free/Busy" page.</p><p>Contact your system administrator for the exact URL and the account details.</p></qt>
km: <qt><p> គ្មាន URL កំណត់រចនាសម្ព័ន្ធសម្រាប់ផ្ទុកឡើងបញ្ជីទំនេរ / រវល់របស់អ្នកទេ។ សូមកំណត់វានៅក្នុងប្រអប់កំណត់រចនាសម្ព័ន្ធរបស់ Krrganizer នៅលើទំព័រ "Free / Busy" ។ </p><p> ទាក់ទងអ្នកគ្រប់គ្រងប្រព័ន្ធរបស់អ្នកសម្រាប់ URL ពិតប្រាកដនិងព័ត៌មានគណនី។ </p></qt>

source: No Free/Busy Upload URL
km: គ្មាន URL ផ្ទុកឡើងសេរី / រវល់

source: <qt>The target URL '%1' provided is invalid.</qt>
km: <qt> URL គោលដៅ '%1' ដែលបានផ្តល់មិនត្រឹមត្រូវ។ </qt>

source: Invalid URL
km: URL មិនត្រឹមត្រូវ

source: General error
km: កំហុសទូទៅ

# %1 is event, todo or journal
source: %1 creation
km: ការបង្កើត %1

# %1 is event, todo or journal
source: %1 deletion
km: ការលុប %1

# %1 is event, todo or journal
source: %1 modification
km: ការកែប្រែ %1

source: Error creating ical resource: %1
km: កំហុសក្នុងការបង្កើតធនធាន ical៖ %1

source: Failed to obtain D-Bus interface for remote configuration.
km: បានបរាជ័យក្នុងការទទួលចំណុចប្រទាក់ D-Bus សម្រាប់ការកំណត់រចនាសម្ព័ន្ធពីចម្ងាយ។

source: Could not download remote file.
km: មិនអាចទាញយកឯកសារពីចម្ងាយ។

source: An import task is already in progress.
km: កិច្ចការនាំចូលកំពុងដំណើរការរួចហើយ។

source: Empty filename. Will not import ical file.
km: ឈ្មោះឯកសារទទេ។ នឹងមិននាំចូលឯកសារ ical ទេ។

source: Url to import is malformed.
km: Url ដើម្បីនាំចូលមិនត្រឹមត្រូវ។

source: The specified file doesn't exist, aborting import.
km: មិនមានឯកសារដែលបានបញ្ជាក់ទេបញ្ឈប់ការនាំចូល។

source: Failed to load ical file, check permissions.
km: បានបរាជ័យក្នុងការផ្ទុកឯកសារ ical, ពិនិត្យសិទ្ធិ។

source: The ical file to merge is empty.
km: ឯកសារ ical ដែលត្រូវបញ្ចូលគ្នាគឺទទេ។

source: Merge ical file into existing calendar.
km: បញ្ចូលឯកសារ ical ចូលទៅក្នុងប្រតិទិនដែលមានស្រាប់។

source: Error while trying to create calendar item. Error was: %1
km: មានកំហុសខណៈពេលព្យាយាមបង្កើតធាតុប្រតិទិន។ កំហុសគឺ៖ %1

source: Error while trying to delete calendar item. Error was: %1
km: មានកំហុសខណៈពេលព្យាយាមលុបធាតុប្រតិទិន។ កំហុសគឺ៖ %1

# errormessage for a job ended with an unexpected result
source: An unknown error occurred
km: កំហុសមិនស្គាល់បានកើតឡើង

source: Error while trying to modify calendar item. Error was: %1
km: មានកំហុសខណៈពេលព្យាយាមកែប្រែធាតុប្រតិទិន។ កំហុសគឺ៖ %1

source: That calendar item was already deleted, or currently being deleted.
km: ធាតុប្រតិទិននោះត្រូវបានលុបរួចហើយឬបច្ចុប្បន្នត្រូវបានលុបចោល។

source: Operation can not be performed due to ACL restrictions
km: ប្រតិបត្តិការមិនអាចត្រូវបានអនុវត្តដោយសារតែការរឹតបន្តឹង ACL

source: The chosen collection is invalid
km: ការប្រមូលដែលបានជ្រើសរើសមិនត្រឹមត្រូវ

source: Default collection is invalid or doesn't have proper ACLs and DestinationPolicyNeverAsk was used
km: ការប្រមូលលំនាំដើមគឺមិនត្រឹមត្រូវឬមិនមាន ACLs ត្រឹមត្រូវនិងទិសដៅ DestinationPolicyNeverAsk ត្រូវបានប្រើ

source: Duplicate item id in a group operation
km: លេខសម្គាល់ធាតុស្ទួននៅក្នុងប្រតិបត្តិការក្រុម

source: One change belonging to a group of changes failed. All changes are being rolled back.
km: ការផ្លាស់ប្តូរមួយដែលជាកម្មសិទ្ធិរបស់ក្រុមការផ្លាស់ប្តូរបានបរាជ័យ។ ការផ្លាស់ប្តូរទាំងអស់កំពុងត្រូវបានរមៀលត្រឡប់មកវិញ។

source: Unknown error
km: កំហុសមិនស្គាល់

source: Error loading calendar.
km: កំហុសក្នុងការផ្ទុកប្រតិទិន។

source: Error message: %1
km: សារកំហុស៖ %1

source: Unknown error while parsing iCal invitation
km: កំហុសមិនស្គាល់ខណៈពេលកំពុងវិភាគការអញ្ជើញរបស់ iCal

source: Error while processing an invitation or update.
km: មានកំហុសពេលដំណើរការការអញ្ជើញឬធ្វើបច្ចុប្បន្នភាព។

source: Invalid incidence
km: ឧប្បត្តិហេតុមិនត្រឹមត្រូវ

source: Invalid action: %1
km: សកម្មភាពមិនត្រឹមត្រូវ៖ %1

source: Error sending counter proposal
km: កំហុសក្នុងការផ្ញើសំណើរាប់

source: Could not start editor to edit counter proposal
km: មិនអាចចាប់ផ្តើមកម្មវិធីនិពន្ធដើម្បីកែសម្រួលសំណើរតបតទេ

source: The item '%1' has no attendees. Therefore no groupware message will be sent.
km: ធាតុ '%1' គ្មានអ្នកចូលរួម។ ដូច្នេះគ្មានសារជាក្រុមនឹងត្រូវបានផ្ញើទេ។

source: Message Not Sent
km: សារមិនបានផ្ញើទេ

# @action:button dialog positive answer
source: Send Email
km: ផ្ញើអ៊ីមែល

source: Error: %1
km: កំហុស៖ %1

source: Error loading calendar: %1
km: កំហុសក្នុងការផ្ទុកប្រតិទិន៖ %1

source: The groupware message for item '%1' was successfully sent. Method: %2
km: សារក្រុមប្រើសម្រាប់ធាតុ '%1' ត្រូវបានផ្ញើដោយជោគជ័យ។ វិធីសាស្រ្ត៖ %2

# Groupware message sending failed. %2 is request/reply/add/cancel/counter/etc.
source: Unable to send the item '%1'. Method: %2
km: មិនអាចផ្ញើធាតុ '%1' ។ វិធីសាស្រ្ត៖ %2

source: The item information was successfully sent.
km: ព័ត៌មានធាតុត្រូវបានផ្ញើដោយជោគជ័យ។

source: Publishing
km: ការបោះពុម្ពផ្សាយ

source: Unable to publish the item '%1'
km: មិនអាចផ្សព្វផ្សាយធាតុ '%1'

source: Forwarding
km: បញ្ជូនបន្ត

source: Unable to forward the item '%1'
km: មិនអាចបញ្ជូនបន្តធាតុ '%1'

source: Forwarding Error
km: កំហុសបញ្ជូនបន្ត

source: Proposed new meeting time: %1 - %2
km: ពេលវេលាប្រជុំថ្មីដែលបានស្នើ៖ %1 - %2

source: Group Scheduling Email
km: អ៊ីមែលកំណត់ពេលក្រុម

source: <placeholder>No summary given</placeholder>
km: <placeholder> មិនមានសេចក្ដីសង្ខេប </placeholder>

source: The event "%1" includes other people. Do you want to email the invitation to the attendees?
km: ព្រឹត្តិការណ៍ " %1" រួមមានមនុស្សផ្សេងទៀត។ តើអ្នកចង់ផ្ញើអ៊ីមែលការអញ្ជើញទៅកាន់អ្នកចូលរួមទេ?

source: The todo "%1" includes other people. Do you want to email the invitation to the attendees?
km: ការងារត្រូវធ្វើ " %1" រួមទាំងមនុស្សផ្សេងទៀត។ តើអ្នកចង់ផ្ញើអ៊ីមែលការអញ្ជើញទៅកាន់អ្នកចូលរួមទេ?

source: This incidence includes other people. Should an email be sent to the attendees?
km: ឧប្បត្តិហេតុនេះរួមបញ្ចូលទាំងមនុស្សផ្សេងទៀត។ តើគួរផ្ញើអ៊ីមែលទៅអ្នកចូលរួមដែរឬទេ?

source: You are not the organizer of this event. Editing it will bring your calendar out of sync with the organizer's calendar. Do you really want to edit it?
km: អ្នកមិនមែនជាអ្នករៀបចំព្រឹត្តិការណ៍នេះទេ។ ការកែសម្រួលវានឹងនាំប្រតិទិនរបស់អ្នកមិនសមកាលជាមួយប្រតិទិនរបស់អ្នករៀបចំ។ តើអ្នកពិតជាចង់កែសម្រួលវាទេ?

source: You changed the invitation "%1". Do you want to email the attendees an update message?
km: អ្នកបានប្តូរការអញ្ជើញ " %1" ។ តើអ្នកចង់ផ្ញើអ៊ីមែលទៅអ្នកចូលរួមនូវសារបច្ចុប្បន្នភាពទេ?

source: Do you want to send a status update to the organizer of this task?
km: តើអ្នកចង់ផ្ញើបច្ចុប្បន្នភាពស្ថានភាពទៅអ្នករៀបចំភារកិច្ចនេះទេ?

source: Your status as an attendee of this event changed. Do you want to send a status update to the event organizer?
km: ស្ថានភាពរបស់អ្នកជាអ្នកចូលរួមព្រឹត្តិការណ៍នេះបានផ្លាស់ប្តូរ។ តើអ្នកចង់ផ្ញើបច្ចុប្បន្នភាពស្ថានភាពទៅអ្នករៀបចំព្រឹត្តិការណ៍ទេ?

source: You removed the invitation "%1". Do you want to email the attendees that the event is canceled?
km: អ្នកបានលុបការអញ្ជើញ " %1" ។ តើអ្នកចង់ផ្ញើអ៊ីមែលទៅអ្នកចូលរួមថាព្រឹត្តិការណ៍នេះត្រូវបានលុបចោលទេ?

source: You removed the invitation "%1". Do you want to email the attendees that the todo is canceled?
km: អ្នកបានលុបការអញ្ជើញ " %1" ។ តើអ្នកចង់ផ្ញើអ៊ីមែលទៅអ្នកចូលរួមថាការងារត្រូវលុបចោលទេ?

source: You removed the invitation "%1". Do you want to email the attendees that the journal is canceled?
km: អ្នកបានលុបការអញ្ជើញ " %1" ។ តើអ្នកចង់ផ្ញើអ៊ីមែលទៅអ្នកចូលរួមថាទិនានុប្បវត្តិត្រូវបានលុបចោលទេ?

source: Do you want to send a status update to the organizer of this journal?
km: តើអ្នកចង់ផ្ញើបច្ចុប្បន្នភាពស្ថានភាពទៅអ្នករៀបចំទិនានុប្បវត្តិនេះទេ?

# @action:button dialog positive answer
source: Send Update
km: ផ្ញើបច្ចុប្បន្នភាព

source: You had previously accepted an invitation to this event. Do you want to send an updated response to the organizer declining the invitation?
km: កាលពីមុនអ្នកបានទទួលយកការអញ្ជើញចូលរួមព្រឹត្តិការណ៍នេះ។ តើអ្នកចង់ផ្ញើការឆ្លើយតបថ្មីទៅអ្នករៀបចំដែលបដិសេធការអញ្ជើញទេ?

source: Counter proposal: %1
km: សំណើរប្រឆាំង៖ %1

source: Sending group scheduling email failed.
km: ការផ្ញើអ៊ីមែលតាមកាលវិភាគក្រុមបានបរាជ័យ។

# @action:button dialog positive answer to abort question
source: Abort Update
km: បោះបង់បច្ចុប្បន្នភាព

source: There are no attendees to e-mail
km: មិនមានអ្នកចូលរួមផ្ញើអ៊ីមែលទេ

source: Free Busy Object
km: វត្ថុរវល់

source: Free Busy Message
km: សាររវល់

source: Error while creating transport
km: មានកំហុសពេលបង្កើតការដឹកជញ្ជូន

source: Error fetching transport. Unable to send invitations
km: កំហុសក្នុងការទៅរកការដឹកជញ្ជូន។ មិនអាចផ្ញើការអញ្ជើញបានទេ

source: Error queuing message in outbox: %1
km: កំហុសក្នុងការតំរង់ជួរសារនៅក្នុងប្រអប់ចេញ៖ %1

source: Error sending e-mail:
km: កំហុសក្នុងការផ្ញើអ៊ីមែល៖

# @title:window
source: Select Addresses
km: ជ្រើសរើសអាសយដ្ឋាន

source: Send email to these recipients
km: ផ្ញើអ៊ីមែលទៅអ្នកទទួលទាំងនេះ

source: Clicking the <b>Ok</b> button will cause an email to be sent to the recipients you have entered.
km: ចុចប៊ូតុង <b> យល់ព្រម </b> ប៊ូតុងនឹងបណ្តាលឱ្យអ៊ីមែលត្រូវបានផ្ញើទៅអ្នកទទួលដែលអ្នកបានបញ្ចូល។

source: Cancel recipient selection and the email
km: បោះបង់ការជ្រើសរើសអ្នកទទួលនិងអ៊ីមែល

source: Clicking the <b>Cancel</b> button will cause the email operation to be terminated.
km: ចុចប៊ូតុង <b> បោះបង់ </b> ប៊ូតុងនឹងបណ្តាលឱ្យបញ្ចប់ប្រតិបត្តិការអ៊ីមែល។

source: Click the <b>Help</b> button to read more information about Group Scheduling.
km: ចុចលើប៊ូតុង <b> ជំនួយ </b> ប៊ូតុងដើម្បីអានព័ត៌មានបន្ថែមអំពីការកំណត់ពេលវេលាជាក្រុម។

source: Unable to publish the calendar incidence due to an invalid recipients string. %1
km: មិនអាចផ្សព្វផ្សាយឧប្បត្តិហេតុប្រតិទិនដោយសារតែខ្សែអក្សរអ្នកទទួលមិនត្រឹមត្រូវ។ %1

source: Publishing Error
km: កំហុសផ្សព្វផ្សាយ

source: The list of addressees to receive the invitation
km: បញ្ជីអ្នកបន្ថែមដើម្បីទទួលបានការអញ្ជើញ

source: This is a list of all the addresses you have currently selected to receive the iCalendar invitation.
km: នេះជាបញ្ជីអាសយដ្ឋានទាំងអស់ដែលអ្នកបានជ្រើសដើម្បីទទួលការអញ្ជើញរបស់ iCalendar ។

source: Create a new recipient
km: បង្កើតអ្នកទទួលថ្មី

source: Click this button and you will be able to enter a name and email for a new addressee to add to the recipients list
km: ចុចប៊ូតុងនេះហើយអ្នកនឹងអាចបញ្ចូលឈ្មោះនិងអ៊ីមែលសម្រាប់អ្នកទទួលអាសយដ្ឋានថ្មីដើម្បីបន្ថែមទៅក្នុងបញ្ជីអ្នកទទួល

source: &New
km: ថ្មី

source: Remove the recipient currently selected
km: យកអ្នកទទួលដែលបានជ្រើសបច្ចុប្បន្នចេញ

source: Click this button to remove the recipient currently selected from the list
km: ចុចប៊ូតុងនេះដើម្បីដកអ្នកទទួលដែលបានជ្រើសរើសចេញពីបញ្ជី

source: &Remove
km: លុប

source: Select a recipient from your address book
km: ជ្រើសរើសអ្នកទទួលពីសៀវភៅអាសយដ្ឋានរបស់អ្នក

source: Click this button to show another dialog where you will be able to select a recipient from your address book
km: ចុចប៊ូតុងនេះដើម្បីបង្ហាញប្រអប់ផ្សេងទៀតដែលអ្នកនឹងអាចជ្រើសរើសអ្នកទទួលពីសៀវភៅអាសយដ្ឋានរបស់អ្នក

source: &Select...
km: ជ្រើសរើស ...

# recipient name
source: Name:
km: ឈ្មោះ៖

source: The recipient's name
km: ឈ្មោះរបស់អ្នកទទួល

source: This field contains the name of the recipient
km: វាលនេះមានឈ្មោះអ្នកទទួល

# recipient email
source: E&mail:
km: អ៊ីមែល៖

source: The recipient's email address
km: អាសយដ្ឋានអ៊ីមែលរបស់អ្នកទទួល

source: This field contains the email address of the recipient
km: វាលនេះមានអាសយដ្ឋានអ៊ីមែលរបស់អ្នកទទួល

source: (EmptyName)
km: (ទទេឈ្មោះ)

source: Error: Assigning different incidence types.
km: កំហុស៖ ចាត់តាំងប្រភេទឧប្បត្តិហេតុផ្សេងៗគ្នា។

source: This isn't an update. The found incidence was modified more recently.
km: នេះមិនមែនជាបច្ចុប្បន្នភាពទេ។ ឧប្បត្តិហេតុដែលត្រូវបានរកឃើញត្រូវបានកែប្រែថ្មីជាងនេះ។

source: Error modifying incidence
km: កំហុសក្នុងការកែប្រែឧប្បត្តិហេតុ

# @info
source: <para>You added an invitation update, but an earlier version of the item could not be found in your calendar.</para><para>This may have occurred because:<list><item>the organizer did not include you in the original invitation</item><item>you did not accept the original invitation yet</item><item>you deleted the original invitation from your calendar</item><item>you no longer have access to the calendar containing the invitation</item></list></para><para>This is not a problem, but we thought you should know.</para>
km: <para> អ្នកបានបន្ថែមបច្ចុប្បន្នភាពការអញ្ជើញប៉ុន្តែកំណែមុននៃធាតុមិនអាចរកឃើញនៅក្នុងប្រតិទិនរបស់អ្នកទេ។ </para><para> វាអាចកើតឡើងដោយសារតែ៖ <list><item> អ្នករៀបចំមិនបានបញ្ចូលអ្នកតាមការអញ្ជើញដើមទេ </item><item> អ្នកមិនទាន់ទទួលយកការអញ្ជើញដើមនៅឡើយទេ </item><item> អ្នកបានលុបការអញ្ជើញដើមពីប្រតិទិនរបស់អ្នក </item><item> អ្នកលែងចូលប្រើប្រតិទិនដែលមានការអញ្ជើញ </item></list></para><para> នេះមិនមែនជាបញ្ហាទេប៉ុន្តែយើងគិតថាអ្នកគួរតែដឹង។ </para>

# @title
source: Cannot find invitation to be updated
km: មិនអាចរកការអញ្ជើញឱ្យធ្វើបច្ចុប្បន្នភាពទេ

source: Error adding incidence
km: កំហុសបន្ថែមឧប្បត្តិហេតុ

source: Could not find incidence to delete.
km: មិនអាចរកឃើញឧប្បត្តិហេតុដែលត្រូវលុបទេ។

source: Error recording exception
km: កំហុសក្នុងការកត់ត្រាករណីលើកលែង

# @info
source: The event or task could not be removed from your calendar. Maybe it has already been deleted or is not owned by you. Or it might belong to a read-only or disabled calendar.
km: ព្រឹត្តិការណ៍ឬភារកិច្ចមិនអាចលុបពីប្រតិទិនរបស់អ្នកបានទេ។ ប្រហែលជាវាត្រូវបានលុបរួចហើយឬមិនមែនជាកម្មសិទ្ធិរបស់អ្នក។ ឬវាអាចជារបស់ប្រតិទិនបានតែអានឬបិទ។

source: Generic Error
km: កំហុសទូទៅ

# @info
source: %1 wants to attend %2 but was not invited.
km: %1 ចង់ចូលរួម %2 ប៉ុន្តែមិនត្រូវបានអញ្ជើញទេ។

# @info
source: %1 wants to attend %2 on behalf of %3.
km: %1 ចង់ចូលរួម %2 ក្នុងនាម %3 ។

# @title
source: Uninvited attendee
km: អ្នកចូលរួមដែលមិនបានអញ្ជើញ

# @option
source: Accept Attendance
km: ទទួលយកការចូលរួម

# @option
source: Reject Attendance
km: បដិសេធការចូលរួម

# @info
source: The organizer rejected your attendance at this meeting.
km: អ្នករៀបចំបានច្រានចោលការចូលរួមរបស់អ្នកនៅឯកិច្ចប្រជុំនេះ។

# @info
source: An attendee was added to the incidence. Do you want to email the attendees an update message?
km: អ្នកចូលរួមម្នាក់ត្រូវបានបន្ថែមទៅនឹងឧប្បត្តិហេតុ។ តើអ្នកចង់ផ្ញើអ៊ីមែលបច្ចុប្បន្នភាពទៅអ្នកចូលរួមឬទេ?

# @title
source: Attendee Added
km: អ្នកចូលរួមបន្ថែម

# @option
source: Send Messages
km: ផ្ញើសារ

# @option
source: Do Not Send
km: កុំផ្ញើ

source: No incidence for scheduling.
km: គ្មានឧប្បត្តិហេតុសម្រាប់ការកំណត់ពេលវេលាទេ។

source: No Free Busy Cache
km: មិនមានឃ្លាំងសម្ងាត់រវល់ទេ

source: Error saving freebusy object
km: មានកំហុសក្នុងការរក្សាទុកវត្ថុឥតគិតថ្លៃ

source: Add Folder...
km: បន្ថែមថតឯកសារ ...

source: Add a new calendar folder to the currently selected calendar folder.
km: បន្ថែមថតប្រតិទិនថ្មីទៅថតប្រតិទិនដែលបានជ្រើសរើសបច្ចុប្បន្ន។

# @title:window
source: New Folder
km: ប្រអប់​ឯកសារ​ថ្មី

source: Could not create calendar folder: %1
km: មិនអាចបង្កើតថតឯកសារប្រតិទិនទេ៖ %1

source: Calendar folder creation failed
km: ការបង្កើតថតប្រតិទិនបានបរាជ័យ

source: Copy Folder
km: ថតចំលងថតឯកសារ

source: Copy the selected calendar folders to the clipboard.
km: ចម្លងថតឯកសារប្រតិទិនដែលបានជ្រើសរើសទៅក្តារតម្បៀតខ្ទាស់។

source: Delete Folder
km: លុបថតឯកសារ

source: Delete the selected calendar folders from the calendar.
km: លុបថតឯកសារប្រតិទិនដែលបានជ្រើសរើសចេញពីប្រតិទិន។

source: Do you really want to delete this calendar folder and all its sub-folders?
km: តើអ្នកពិតជាចង់លុបថតប្រតិទិននេះនិងថតរងទាំងអស់ឬ?

# @title:window
source: Delete calendar folder?
km: លុបថតឯកសារប្រតិទិន?

source: Could not delete calendar folder: %1
km: មិនអាចលុបថតឯកសារប្រតិទិនបានទេ៖ %1

source: Calendar folder deletion failed
km: ការលុបថតឯកសារប្រតិទិនបានបរាជ័យ

source: Update Folder
km: ធ្វើបច្ចុប្បន្នភាពថតឯកសារ

source: Update the content of the selected calendar folders.
km: ធ្វើបច្ចុប្បន្នភាពមាតិកានៃថតប្រតិទិនដែលបានជ្រើសរើស។

source: Cut Folder
km: កាត់ថតឯកសារ

source: Cut the selected calendar folders from the calendar.
km: កាត់ថតឯកសារប្រតិទិនដែលបានជ្រើសរើសពីប្រតិទិន។

source: Folder Properties...
km: លក្ខណៈសម្បត្តិថតឯកសារ ...

source: Open a dialog to edit the properties of the selected calendar folder.
km: បើកប្រអប់ដើម្បីកែសម្រួលលក្ខណសម្បត្តិរបស់ថតប្រតិទិនដែលបានជ្រើសរើស។

# @title:window
source: Properties of Calendar Folder %1
km: លក្ខណៈសម្បត្តិនៃថតឯកសារប្រតិទិន %1

source: Copy Event
km: ចម្លងព្រឹត្តិការណ៍

source: Copy the selected events to the clipboard.
km: ចម្លងព្រឹត្តិការណ៍ដែលបានជ្រើសរើសទៅក្តារតម្បៀតខ្ទាស់។

source: Delete Event
km: លុបព្រឹត្តិការណ៍

source: Delete the selected events from the calendar.
km: លុបព្រឹត្តិការណ៍ដែលបានជ្រើសរើសចេញពីប្រតិទិន។

source: Do you really want to delete the selected event?
km: តើអ្នកពិតជាចង់លុបព្រឹត្តិការណ៍ដែលបានជ្រើសរើសឬ?

# @title:window
source: Delete Event?
km: លុបព្រឹត្តិការណ៍?

source: Could not delete event: %1
km: មិនអាចលុបព្រឹត្តិការណ៍បានទេ៖ %1

source: Event deletion failed
km: ការលុបព្រឹត្តិការណ៍បានបរាជ័យ

source: Cut Event
km: កាត់ព្រឹត្តិការណ៍

source: Cut the selected events from the calendar.
km: កាត់ព្រឹត្តិការណ៍ដែលបានជ្រើសរើសចេញពីប្រតិទិន។

source: Add &Calendar...
km: បន្ថែមប្រតិទិន ...

source: Add a new calendar<p>You will be presented with a dialog where you can select the type of the calendar that shall be added.</p>
km: បន្ថែមប្រតិទិនថ្មី <p> អ្នកនឹងត្រូវបានបង្ហាញជាមួយប្រអប់ដែលអ្នកអាចជ្រើសរើសប្រភេទប្រតិទិនដែលនឹងត្រូវបន្ថែម។ </p>

# @title:window
source: Add Calendar
km: បន្ថែមប្រតិទិន

source: Could not create calendar: %1
km: មិនអាចបង្កើតប្រតិទិនទេ៖ %1

source: Calendar creation failed
km: ការបង្កើតប្រតិទិនបានបរាជ័យ

source: &Delete Calendar
km: លុបប្រតិទិន

source: Delete the selected calendars<p>The currently selected calendars will be deleted, along with all the events, todos and journals they contain.</p>
km: លុបប្រតិទិនដែលបានជ្រើសរើស <p> ប្រតិទិនដែលបានជ្រើសរើសបច្ចុប្បន្ននឹងត្រូវបានលុបចោលរួមជាមួយព្រឹត្តិការណ៍ទាំងអស់ការងារតូតាល់និងទិនានុប្បវត្តិដែលពួកគេមាន។ </p>

source: Do you really want to delete this calendar?
km: តើអ្នកពិតជាចង់លុបប្រតិទិននេះឬ?

# @title:window
source: Delete Calendar?
km: លុបប្រតិទិន?

source: Calendar Properties...
km: លក្ខណៈសម្បត្តិប្រតិទិន ...
