Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/akonadi-calendar/libakonadi-calendar5.po
Languages: km

source: Open a dialog to edit properties of the selected calendar.
km: បើកប្រអប់ដើម្បីកែសម្រួលលក្ខណសម្បត្តិនៃប្រតិទិនដែលបានជ្រើសរើស។

source: Update Calendar
km: ធ្វើបច្ចុប្បន្នភាពប្រតិទិន

source: Updates the content of all folders of the selected calendars.
km: ធ្វើបច្ចុប្បន្នភាពមាតិកានៃថតទាំងអស់នៃប្រតិទិនដែលបានជ្រើសរើស។

source: &Copy to Calendar
km: ចម្លងទៅប្រតិទិន

source: Copy the selected event to a different calendar.
km: ចម្លងព្រឹត្តិការណ៍ដែលបានជ្រើសរើសទៅប្រតិទិនផ្សេង។

source: &Move to Calendar
km: ផ្លាស់ទីទៅប្រតិទិន

source: Move the selected event to a different calendar.
km: ផ្លាស់ទីព្រឹត្តិការណ៍ដែលបានជ្រើសរើសទៅប្រតិទិនផ្សេង។

source: Could not paste event: %1
km: មិនអាចបិទភ្ជាប់ព្រឹត្តិការណ៍បានទេ៖ %1

source: Paste failed
km: ការបិទភ្ជាប់បានបរាជ័យ

source: Update Available Calendars
km: ធ្វើបច្ចុប្បន្នភាពប្រតិទិនដែលមាន

source: Updates the tree of available calendars.
km: ធ្វើបច្ចុប្បន្នភាពមែកធាងនៃប្រតិទិនដែលមាន។

source: Copy Event To
km: ចម្លងព្រឹត្តិការណ៍ទៅ

source: Move Event To
km: ផ្លាស់ទីព្រឹត្តិការណ៍ទៅ

source: Edit Event...
km: កែសម្រួលព្រឹត្តិការណ៍ ...

source: Copy To-do
km: ចម្លងការងារត្រូវធ្វើ

source: Copy To-do To
km: ចម្លងការងារត្រូវធ្វើទៅ

source: Delete To-do
km: លុបការងារត្រូវធ្វើ

source: Cut To-do
km: កាត់ការងារត្រូវធ្វើ

source: Move To-do To
km: ផ្លាស់ទីការងារត្រូវធ្វើទៅ

source: Edit To-do...
km: កែសម្រួលការងារត្រូវធ្វើ ...

source: Copy Journal
km: ចំលងទិនានុប្បវត្តិ

source: Copy Journal To
km: ចម្លងទិនានុប្បវត្តិទៅ

source: Delete Journal
km: លុបទិនានុប្បវត្តិ

source: Cut Journal
km: កាត់ទិនានុប្បវត្តិ

source: Move Journal To
km: ផ្លាស់ទីទិនានុប្បវត្តិទៅ

source: Edit Journal...
km: កែសម្រួលទិនានុប្បវត្តិ ...

source: New E&vent...
km: ព្រឹត្តិការណ៍ថ្មី ...

source: Create a new event
km: បង្កើតព្រឹត្តិការណ៍ថ្មី

source: New &To-do...
km: ការងារត្រូវធ្វើថ្មី ...

source: Create a new To-do
km: បង្កើតការងារត្រូវធ្វើថ្មី

source: New Su&b-to-do...
km: ការងារត្រូវធ្វើថ្មី ...

source: Create a new Sub-to-do
km: បង្កើតការងារត្រូវធ្វើថ្មី

source: New &Journal...
km: ទិនានុប្បវត្តិថ្មី ...

source: Create a new Journal
km: បង្កើតទិនានុប្បវត្តិថ្មី

source: &Edit...
km: កែសម្រួល ...

source: Edit the selected incidence.
km: កែសម្រួលឧប្បត្តិហេតុដែលបានជ្រើសរើស។

source: Purging completed to-dos
km: ការបោសសំអាតបានបញ្ចប់ការងារត្រូវធ្វើ
