Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/analitza/analitza_qt.po
Languages: km

# QCoreApplication|
source: Cannot calculate an empty expression
km: មិនអាចគណនាកន្សោមទទេបានទេ

# QCoreApplication|
source: Must specify a correct operation
km: ត្រូវបញ្ជាក់ប្រតិបត្តិការត្រឹមត្រូវ

# QCoreApplication|
source: Unknown identifier: '%1'
km: មិនស្គាល់អត្តសញ្ញាណ៖ '%1'

# Error message, no proper condition found.|
source: Could not find a proper choice for a condition statement.
km: មិនអាចរកឃើញជម្រើសត្រឹមត្រូវសម្រាប់សេចក្តីថ្លែងការណ៍លក្ខខណ្ឌ។

# QCoreApplication|
source: Type not supported for bounding.
km: ប្រភេទមិនត្រូវបានគាំទ្រសម្រាប់ការភ្ជាប់។

# QCoreApplication|
source: The downlimit is greater than the uplimit
km: downlimit គឺធំជាងសម្មតិកម្ម

# QCoreApplication|
source: Incorrect uplimit or downlimit.
km: uplimit ឬ downlimit មិនត្រឹមត្រូវ។

# QCoreApplication|
source: Invalid type for parameter '%1'
km: ប្រភេទមិនត្រឹមត្រូវសំរាប់ប៉ារ៉ាម៉ែត្រ '%1'

# By a cycle i mean a variable that depends on itself|
source: Defined a variable cycle
km: វដ្តអថេរ

# QCoreApplication|
source: The result is not a number
km: លទ្ធផលមិនមែនជាលេខទេ

# QCoreApplication|
source: Invalid parameter count for '%1'
km: ការរាប់ប៉ារ៉ាម៉ែត្រមិនត្រឹមត្រូវសម្រាប់ '%1'

# QCoreApplication|
source: Blocks must have consistent size between each and other
km: ប្លុកត្រូវតែមានទំហំថេររវាងគ្នានិងគ្នា

# QCoreApplication|
source: Do not want empty blocks
km: មិនចង់បានប្លុកទទេ

# QCoreApplication|
source: Blocks must be matrices
km: ប្លុកត្រូវតែជាម៉ាទ្រីស

# QCoreApplication|
source: Number of blocks must be consistent
km: ចំនួនប្លុកត្រូវតែស្របគ្នា

# QCoreApplication|
source: Do not want empty vectors/matrixrow elements
km: មិនចង់បានវ៉ិចទ័រទទេ / ធាតុម៉ាទ្រីស

# QCoreApplication|
source: Matrix constructor needs vectors or matrixrow elements
km: អ្នកសាងសង់ម៉ាទ្រីសត្រូវការវ៉ិចទ័រឬធាតុម៉ាទ្រីស

# QCoreApplication|
source: the arg %1 is invalid or is error
km: អាគុយម៉ង់ %1 មិនត្រឹមត្រូវឬជាកំហុស

# QCoreApplication|
source: Invalid parameter count for '%1'. Should have 1 parameter
km: ការរាប់ប៉ារ៉ាម៉ែត្រមិនត្រឹមត្រូវសម្រាប់ '%1' ។ គួរតែមានប៉ារ៉ាម៉ែត្រ ១

# QCoreApplication|
source: To use '%1' command the input matrix must be square
km: ដើម្បីប្រើពាក្យបញ្ជា '%1' ម៉ាទ្រីសបញ្ចូលត្រូវតែជាការេ

# QCoreApplication|
source: Invalid parameter type in matrix entry (%1,%2) for '%3', it must be a number value
km: ប្រភេទប៉ារ៉ាម៉ែត្រមិនត្រឹមត្រូវក្នុងធាតុម៉ាទ្រីស (%1, %2) សម្រាប់ '%3' វាត្រូវតែជាតម្លៃលេខ

# QCoreApplication|NaN means Not a Number, is an invalid float number
source: Returned eigenvalue is NaN
km: eigenvalue ដែលបានត្រលប់មកវិញគឺ NaN

# QCoreApplication|
source: Returned eigenvalue is too big
km: eigenvalue ដែលបានត្រលប់មកវិញគឺធំពេកហើយ

# QCoreApplication|
source: Matrix dimensions must be greater than zero
km: វិមាត្រម៉ាទ្រីសត្រូវតែធំជាងសូន្យ

# QCoreApplication|
source: All matrixrow elements must have the same size
km: ធាតុម៉ាទ្រីសទាំងអស់ត្រូវតែមានទំហំដូចគ្នា

# QCoreApplication|
source: Not all are rows or vectors
km: មិនមែនទាំងអស់ជាជួររឺវ៉ិចទ័រទេ

# QCoreApplication|
source: Every argument must be a matrixrow element
km: រាល់អំណះអំណាងត្រូវតែជាធាតុម៉ាទ្រីស

# QCoreApplication|
source: The nth diagonal index must be less than the row count
km: សន្ទស្សន៍អង្កត់ទ្រូងទី ១ ត្រូវតែតិចជាងចំនួនជួរដេក

# QCoreApplication|
source: The nth diagonal index must be less than the column count
km: សន្ទស្សន៍អង្កត់ទ្រូងទី ១ ត្រូវតែតិចជាងចំនួនជួរឈរ

# QCoreApplication|
source: nth diagonal index must be integer number
km: លិបិក្រមអង្កត់ទ្រូងត្រូវតែជាលេខគត់

# QCoreApplication|
source: nth diagonal index must be a positive integer number
km: លិបិក្រមអង្កត់ទ្រូងត្រូវតែជាចំនួនគត់វិជ្ជមាន

# QCoreApplication|
source: Invalid parameter type for '%1', was expected a list
km: ប្រភេទប៉ារ៉ាម៉ែត្រមិនត្រឹមត្រូវសម្រាប់ '%1' ត្រូវបានគេរំពឹងថាជាបញ្ជី

# QCoreApplication|
source: Vector size must be some integer value greater to zero
km: ទំហំវ៉ិចទ័រត្រូវតែជាតម្លៃគត់មួយចំនួនធំជាងសូន្យ

# QCoreApplication|
source: Unexpectedly arrived to the end of the input
km: ការមកដល់ដោយមិនបានរំពឹងទុកដល់ចុងបញ្ចប់នៃការបញ្ចូល

# QCoreApplication|
source: Unknown token %1
km: មិនស្គាល់និមិត្តសញ្ញា %1

# QCoreApplication|
source: <em>%1</em> needs at least 2 parameters
km: <em> %1 </em> ត្រូវការយ៉ាងហោចណាស់ ២ ប៉ារ៉ាម៉ែត្រ

# QCoreApplication|
source: <em>%1</em> requires %2 parameters
km: <em> %1 </em> ត្រូវការប៉ារ៉ាម៉ែត្រ %2

# QCoreApplication|
source: Missing boundary for '%1'
km: បាត់ព្រំដែនសម្រាប់ '%1'

# QCoreApplication|
source: Unexpected bounding for '%1'
km: ព្រំដែនដែលមិនបានរំពឹងទុកសម្រាប់ '%1'

# QCoreApplication|
source: <em>%1</em> missing bounds on '%2'
km: <em> %1 </em> បាត់ព្រំដែន '%2'

# QCoreApplication|
source: Wrong declare
km: ប្រកាសខុស

# QCoreApplication|
source: Empty container: %1
km: កុងតឺន័រទទេ៖ %1

# there was a conditional outside a condition structure|
source: We can only have conditionals inside piecewise structures.
km: យើងគ្រាន់តែអាចមានលក្ខខណ្ឌនៅខាងក្នុងរចនាសម្ព័ន្ធដែលអាចធ្វើបាន។

# QCoreApplication|
source: Cannot have two parameters with the same name like '%1'.
km: មិនអាចមានប៉ារ៉ាម៉ែត្រពីរដែលមានឈ្មោះដូចគ្នាដូចជា '%1' ។

# this is an error message. otherwise is the else in a mathml condition|
source: The <em>otherwise</em> parameter should be the last one
km: នេះ <em> បើមិនដូច្នេះទេ </em> ប៉ារ៉ាម៉ែត្រគួរតែជាចុងក្រោយ

# there was an element that was not a conditional inside a condition|
source: %1 is not a proper condition inside the piecewise
km: %1 មិនមែនជាលក្ខខណ្ឌត្រឹមត្រូវនៅខាងក្នុងទេ

# QCoreApplication|
source: We can only declare variables
km: យើងអាចប្រកាសតែអថេរប៉ុណ្ណោះ

# QCoreApplication|
source: We can only have bounded variables
km: យើងអាចមានតែអថេរដែលមានព្រំដែនប៉ុណ្ណោះ

# QCoreApplication|
source: Do not want empty matrixrow elements
km: មិនចង់បានធាតុម៉ាទ្រីសទទេ

# QCoreApplication|
source: The matrix must contain only matrixrow elements
km: ម៉ាទ្រីសត្រូវតែមានតែធាតុម៉ាទ្រីសប៉ុណ្ណោះ

# QCoreApplication|
source: Error while parsing: %1
km: មានកំហុសខណៈពេលកំពុងវិភាគ៖ %1

# An error message|
source: Container unknown: %1
km: មិនស្គាល់កុងតឺន័រ៖ %1

# QCoreApplication|
source: Cannot codify the %1 value.
km: មិនអាចសរសេរកូដតម្លៃ %1 ។

# QCoreApplication|
source: The %1 operator cannot have child contexts.
km: ប្រតិបត្តិករ %1 មិនអាចមានបរិបទកុមារទេ។

# QCoreApplication|
source: The element '%1' is not an operator.
km: ធាតុ '%1' មិនមែនជាប្រតិបត្តិករទេ។

# QCoreApplication|
source: Do not want empty vectors
km: មិនចង់បានវ៉ិចទ័រទទេ

# QCoreApplication|
source: Do not want empty matrices
km: មិនចង់បានវិឡាទំនាយទទេ

# Error message due to an unrecognized input|
source: Not supported/unknown: %1
km: មិនគាំទ្រ / មិនស្គាល់៖ %1

# error message|
source: Expected %1 instead of '%2'
km: បានរំពឹងថា %1 ជំនួស '%2'

# QCoreApplication|
source: Missing right parenthesis
km: បាត់វង់ក្រចកខាងស្តាំ

# QCoreApplication|
source: Unbalanced right parenthesis
km: វង់ក្រចកខាងស្តាំគ្មានតុល្យភាព

# QCoreApplication|
source: Unexpected token identifier: %1
km: គ្រឿងសម្គាល់និមិត្តសញ្ញាដែលមិនបានរំពឹងទុក៖ %1

# QCoreApplication|
source: Unexpected token %1
km: និមិត្តសញ្ញាដែលមិនបានរំពឹងទុក %1

# QCoreApplication|
source: Could not find a type that unifies '%1'
km: មិនអាចរកឃើញប្រភេទដែលបង្រួម '%1'

# QCoreApplication|
source: The domain should be either a vector or a list
km: ដែនគួរតែជាវ៉ិចទ័រឬជាបញ្ជី

# type error message|
source: Cannot call '%1'
km: មិនអាចហៅ '%1'

# QCoreApplication|
source: Cannot reduce '%1' to '%2'. Invalid type of parameter '%3' for '%4'
km: មិនអាចកាត់បន្ថយ '%1' ទៅ '%2' ។ ប្រភេទប៉ារ៉ាម៉ែត្រមិនត្រឹមត្រូវ '%3' សម្រាប់ '%4'

# QCoreApplication|
source: Invalid parameter count for '%2'. Should have %1 parameters.
km: ការរាប់ប៉ារ៉ាម៉ែត្រមិនត្រឹមត្រូវសម្រាប់ '%2' ។ គួរតែមានប៉ារ៉ាម៉ែត្រ %1 ។

# QCoreApplication|
source: Cannot compare '%1' to '%2'. Invalid type of parameter '%3' for '%4'
km: មិនអាចប្រៀបធៀប '%1' ទៅ '%2' ។ ប្រភេទប៉ារ៉ាម៉ែត្រមិនត្រឹមត្រូវ '%3' សម្រាប់ '%4'

# QCoreApplication|
source: Could not call '%1'
km: មិនអាចហៅ '%1'

# QCoreApplication|
source: Could not solve '%1'
km: មិនអាចដោះស្រាយ '%1'

# QCoreApplication|
source: Incoherent type for the variable '%1'
km: ប្រភេទមិនស៊ីជម្រៅសម្រាប់អថេរ '%1'

# QCoreApplication|
source: Could not determine the type for piecewise
km: មិនអាចកំណត់ប្រភេទសម្រាប់ដុំដែកទេ

# QCoreApplication|
source: Unexpected type
km: ប្រភេទដែលមិនបានរំពឹងទុក

# QCoreApplication|
source: Cannot convert '%1' to '%2'
km: មិនអាចបំលែង '%1' ទៅ '%2'

# Error message|
source: Unknown token '%1'
km: មិនស្គាល់និមិត្តសញ្ញា '%1'

# QCoreApplication|
source: Cannot divide by 0.
km: មិនអាចចែកដោយ ០ ។

# QCoreApplication|
source: Cannot calculate the remainder on 0.
km: មិនអាចគណនាចំនួនដែលនៅសល់លើលេខ ០ ។

# QCoreApplication|
source: Cannot calculate the factor on 0.
km: មិនអាចគណនាកត្តាលើ ០ ។

# QCoreApplication|
source: Cannot calculate the lcm of 0.
km: មិនអាចគណនាអិល។

# QCoreApplication|
source: Boolean operations on complex numbers not available
km: ប្រតិបត្តិការប៊ូលីនលើលេខដែលមិនមាន

# QCoreApplication|
source: Only square root implemented for complex numbers
km: អនុវត្តតែឫសការេដែលអនុវត្តសម្រាប់ចំនួនកុំផ្លិច

# QCoreApplication|
source: Could not calculate a value %1
km: មិនអាចគណនាតម្លៃ %1

# QCoreApplication|
source: Cannot calculate %1 between a value and an error type
km: មិនអាចគណនា %1 រវាងតម្លៃនិងប្រភេទកំហុស

# QCoreApplication|
source: Invalid index for a container
km: សន្ទស្សន៍មិនត្រឹមត្រូវសម្រាប់កុងតឺន័រ

# QCoreApplication|
source: Cannot operate '%1' on different sized vectors.
km: មិនអាចដំណើរការ '%1' លើវ៉ិចទ័រដែលមានទំហំខុសគ្នា។

# QCoreApplication|
source: Multiplication between a matrix and a vector is allowed provided that the number of columns of the matrix equals the size of the vector
km: គុណរវាងម៉ាទ្រីសនិងវ៉ិចទ័រមួយត្រូវបានអនុញ្ញាតដែលចំនួនជួរឈរនៃម៉ាទ្រីសស្មើនឹងទំហំវ៉ិចទ័រ។

# QCoreApplication|
source: Matrix and vector entries must be numbers
km: ធាតុម៉ាទ្រីសនិងវ៉ិចទ័រត្រូវតែជាលេខ

# QCoreApplication|
source: Could not calculate a vector's %1
km: មិនអាចគណនាវ៉ិចទ័រ %1 របស់វ៉ិចទ័រ

# QCoreApplication|
source: Could not calculate a list's %1
km: មិនអាចគណនាតារាង %1

# QCoreApplication|
source: Multiplication between a vector and a matrix is allowed provided that the matrix has only one matrixrow element
km: គុណរវាងវ៉ិចទ័រនិងម៉ាទ្រីសមួយត្រូវបានអនុញ្ញាតដែលម៉ាទ្រីសមានធាតុម៉ាទ្រីសតែមួយ

# QCoreApplication|
source: Addition of two matrices is allowed provided that both matrices have the same number of rows and the same number of columns
km: ការបូកបន្ថែមចំនួនពីរគឺត្រូវបានអនុញ្ញាតិឱ្យផ្តល់ជូនដែលថាទាំងពីរគឺមានចំនួនជួរដេកដូចគ្នានិងចំនួនជួរឈរដូចគ្នា

# QCoreApplication|
source: Multiplication of two matrices is allowed provided that the number of columns of the first matrix equals the number of rows of the second matrix
km: គុណនៃម៉ាទ្រីសពីរត្រូវបានអនុញ្ញាតដែលបានផ្តល់ថាចំនួនជួរឈរនៃម៉ាទ្រីសទីមួយស្មើនឹងចំនួនជួរដេកនៃម៉ាទ្រីសទីពីរ

# QCoreApplication|
source: Matrix entries must be numbers
km: ធាតុម៉ាទ្រីសត្រូវតែជាលេខ

# QCoreApplication|
source: The exponent of 'power' must be some integer number
km: និទស្សន្តនៃ 'អំណាច' ត្រូវតែជាលេខគត់មួយចំនួន

# QCoreApplication|
source: Cannot compute 'power' for non square matrix
km: មិនអាចគណនា 'ថាមពល' សម្រាប់ម៉ាទ្រីសដែលមិនមែនជាការេទេ

# QCoreApplication|
source: Cannot calculate %1 between a matrix and an error type
km: មិនអាចគណនា %1 រវាងម៉ាទ្រីសនិងប្រភេទកំហុស

# QCoreApplication|
source: Could not calculate the derivative for '%1'
km: មិនអាចគណនាដេរីវេសម្រាប់ '%1'

# @title:column|
source: Name
km: ឈ្មោះ

# @title:column|
source: Description
km: ការពិពណ៌នា

# @title:column|
source: Parameters
km: ប៉ារ៉ាម៉ែត្រ

# @title:column|
source: Example
km: ឧទាហរណ៍

# Syntax for function bounding values|
source: =from..to
km: = ពី .. ទៅ

# QCoreApplication|
source: %1... parameters, ...%2)
km: %1 ... ប៉ារ៉ាម៉ែត្រ, ... %2)

# QCoreApplication|
source: Addition
km: ការបន្ថែម

# QCoreApplication|
source: Multiplication
km: គុណ

# QCoreApplication|
source: Division
km: ការបែងចែក

# QCoreApplication|
source: Subtraction. Will remove all values from the first one.
km: ដក។ នឹងយកតម្លៃទាំងអស់ចេញពីលេខទីមួយ។

# QCoreApplication|
source: Power
km: ថាមពល

# QCoreApplication|
source: Remainder
km: នៅសល់

# QCoreApplication|
source: Quotient
km: ផលចំណេញ

# QCoreApplication|
source: The factor of
km: កត្តានៃ

# QCoreApplication|
source: Factorial. factorial(n)=n!
km: ហ្វាក់តូរីស។ factorial (n) = n!

# QCoreApplication|
source: Function to calculate the sine of a given angle
km: មុខងារដើម្បីគណនាស៊ីនុសនៃមុំដែលបានផ្តល់ឱ្យ

# QCoreApplication|
source: Function to calculate the cosine of a given angle
km: មុខងារដើម្បីគណនាកូស៊ីនុសនៃមុំដែលបានផ្តល់ឱ្យ

# QCoreApplication|
source: Function to calculate the tangent of a given angle
km: មុខងារដើម្បីគណនាតង់សង់នៃមុំដែលបានផ្តល់ឱ្យ

# QCoreApplication|
source: Secant
km: សុវត្ថិភាព

# QCoreApplication|
source: Cosecant
km: សេសេសេន

# QCoreApplication|
source: Cotangent
km: កូតាសេន

# QCoreApplication|
source: Hyperbolic sine
km: ស៊ីនុសអ៊ីពែរបូល

# QCoreApplication|
source: Hyperbolic cosine
km: កូស៊ីនុសអ៊ីពែរបូល

# QCoreApplication|
source: Hyperbolic tangent
km: តង់សង់អ៊ីពែរបូល

# QCoreApplication|
source: Hyperbolic secant
km: អ៊ីពែបូលអ៊ីស

# QCoreApplication|
source: Hyperbolic cosecant
km: កូស៊ីនុសអ៊ីពែរបូល

# QCoreApplication|
source: Hyperbolic cotangent
km: កូតង់សង់អ៊ីពែរបូល

# QCoreApplication|
source: Arc sine
km: ស៊ីនស៊ីន

# QCoreApplication|
source: Arc cosine
km: ធ្នូកូស៊ីនុស

# QCoreApplication|
source: Arc tangent
km: តង់សង់ធ្នូ

# QCoreApplication|
source: Arc cotangent
km: កូតង់សង់ធ្នូ

# QCoreApplication|
source: Hyperbolic arc tangent
km: តង់សង់ធ្នូអ៊ីពែរបូល

# QCoreApplication|
source: Productory
km: ផលិតផល

# QCoreApplication|
source: For all
km: សម្រាប់​ទាំងអស់

# QCoreApplication|
source: Exists
km: មាន

# QCoreApplication|
source: Differentiation
km: ភាពខុសគ្នា

# QCoreApplication|
source: Hyperbolic arc sine
km: ស៊ីនុសអ៊ីពែរបូល

# QCoreApplication|
source: Hyperbolic arc cosine
km: កូស៊ីនុសធ្នូអ៊ីពែរបូល

# QCoreApplication|
source: Arc cosecant
km: ធ្នូសេស៊ីក

# QCoreApplication|
source: Hyperbolic arc cosecant
km: កូស៊ីនុសអ៊ីពែរបូល

# QCoreApplication|
source: Arc secant
km: ធ្នូស៊ី

# QCoreApplication|
source: Hyperbolic arc secant
km: ស៊ីនុសអ៊ីពែរបូល

# QCoreApplication|
source: Exponent (e^x)
km: និទស្សន្ត (e ^ x)

# QCoreApplication|
source: Base-e logarithm
km: លោការីត - លោការីត

# QCoreApplication|
source: Base-10 logarithm
km: លោការីត - ១០

# QCoreApplication|
source: Absolute value. abs(n)=|n|
km: តម្លៃ​ដាច់ខាត។ abs (n) = | n |

# QCoreApplication|
source: Conjugate
km: រួមរស់

# QCoreApplication|
source: Arg
km: អាហ្គ

# QCoreApplication|
source: Real
km: ពិតប្រាកដ

# QCoreApplication|
source: Imaginary
km: ការស្រមើលស្រមៃ

# QCoreApplication|
source: Floor value. floor(n)=⌊n⌋
km: តម្លៃជាន់។ ជាន់ (n) = ⌊n⌋

# QCoreApplication|
source: Ceil value. ceil(n)=⌈n⌉
km: តម្លៃពិដាន។ ceil (n) = ⌈n⌉

# QCoreApplication|
source: Minimum
km: អប្បបរមា

# QCoreApplication|
source: Maximum
km: អតិបរិមា

# QCoreApplication|
source: Greater than. gt(a,b)=a>b
km: ធំជាង។ gt (a, b) = a> b

# QCoreApplication|
source: Less than. lt(a,b)=a<b
km: តិច​ជាង។ lt (a, b) = a <b

# QCoreApplication|
source: Equal. eq(a,b) = a=b
km: ស្មើ។ eq (a, b) = a = b

# QCoreApplication|
source: Approximation. approx(a)=a±n
km: ប្រហាក់ប្រហែល។ ប្រហាក់ប្រហែល (a) = a ± n

# QCoreApplication|
source: Not equal. neq(a,b)=a≠b
km: មិនស្មើ។ neq (a, b) = a ≠ b

# QCoreApplication|
source: Greater or equal. geq(a,b)=a≥b
km: ធំជាងឬស្មើ។ geq (a, b) = a≥b

# QCoreApplication|
source: Less or equal. leq(a,b)=a≤b
km: តិចឬស្មើ។ leq (a, b) = a≤b

# QCoreApplication|
source: Boolean and
km: ប៊ូលីននិង

# QCoreApplication|
source: Boolean not
km: ប៊ូលីនមិនមែនទេ

# QCoreApplication|
source: Boolean or
km: ប៊ូលីនឬ

# QCoreApplication|
source: Boolean xor
km: ប៊ូលីន xor

# QCoreApplication|
source: Boolean implication
km: ផលប៉ះពាល់ប៊ូលីន

# QCoreApplication|
source: Greatest common divisor
km: អ្នកចែកទូទៅធំបំផុត

# QCoreApplication|
source: Least common multiple
km: តិចច្រើនរួម

# QCoreApplication|
source: Root
km: ឫស

# QCoreApplication|
source: Cardinal
km: ខា

# QCoreApplication|
source: Scalar product
km: ផលិតផល Scalar

# QCoreApplication|
source: Select the par1-th element of par2 list or vector
km: ជ្រើសរើសធាតុទី ១ នៃបញ្ជី par2 ឬវ៉ិចទ័រ

# QCoreApplication|
source: Joins several items of the same type
km: ចូលរួមរបស់របរជាច្រើនប្រភេទដូចគ្នា

# QCoreApplication|
source: Applies a function to every element in a list
km: អនុវត្តមុខងារដល់ធាតុទាំងអស់ក្នុងបញ្ជី

# QCoreApplication|
source: Removes all elements that don't fit a condition
km: យកធាតុទាំងអស់ដែលមិនសមនឹងលក្ខខណ្ឌចេញ

# QCoreApplication|
source: Transpose
km: ផ្លាស់ប្តូរ

# Current parameter is the bounding|
source: : bounds
km: ៖ ព្រំដែន

# @title:column|
source: Value
km: តម្លៃ

# QCoreApplication|
source: The expression is not correct
km: ការបញ្ចេញមតិមិនត្រឹមត្រូវ

# QCoreApplication|
source: Function type '%1' not recognized
km: មិនស្គាល់ប្រភេទមុខងារ '%1'

# QCoreApplication|
source: Function '%1' not recognized
km: មុខងារ '%1' មិនស្គាល់

# @title:column|
source: Plot
km: គ្រោង

# QObject|
source: PNG Image (*.png)
km: រូបភាព PNG (* .png)

# QObject|
source: PDF Document (*.pdf)
km: ឯកសារ PDF (* .pdf)

# QObject|
source: X3D Document (*.x3d)
km: ឯកសារ X3D (* .x៣ ឃ)

# QObject|
source: STL Document (*.stl)
km: ឯកសារអេសអិល (* .stl)

# Function type|
source: Plane Curve F(y)
km: ខ្សែកោងយន្តហោះ F (y)

# Function type|
source: Plane Curve F(x)
km: ខ្សែកោងយន្តហោះ F (x)

# QCoreApplication|
source: We can only draw Real results.
km: យើងអាចទាញលទ្ធផលពិតតែប៉ុណ្ណោះ។

# Function type|
source: Surface z=F(x,y)
km: ផ្ទៃ z = F (x, y)

# Function type|
source: Surface y=F(x,z)
km: ផ្ទៃ y = F (x, z)

# Function type|
source: Surface x=F(y,z)
km: ផ្ទៃ x = F (y, z)

# Function type|
source: Cylindrical Surface z=F(r: Radial, p: Polar)
km: ផ្ទៃស៊ីឡាំង z = F (r៖ រ៉ាឌីកាល់ទំ៖ ប៉ូល)

# Function type|
source: Implicit Curve
km: ខ្សែកោងឆ្លុះ

# Function type|
source: Polar implicit Curve 0=F(r: Radial, p: Polar)
km: ខ្សែកោងរាងប៉ូលត្រង់ ០ = F (r៖ រ៉ាឌីកាល់ទំ៖ ប៉ូល)

# Function type|
source: Implicit Surface
km: ផ្ទៃខាងក្នុង

# Function type|
source: Parametric Curve 2D
km: ខ្សែកោងប៉ារ៉ាម៉ិច 2D

# Function type|
source: Parametric Curve 3D
km: ខ្សែកោង Parametric ខ្សែកោង 3D

# Function type|
source: Parametric Surface
km: ផ្ទៃប៉ារ៉ាម៉ែត្រ

# Function type|
source: Polar Curve r=F(p: Polar)
km: ខ្សែកោងរាងប៉ូល r = F (p៖ ប៉ូល)

# Function type|
source: Spherical Surface Radial=F(t:Azimuth, p: Polar)
km: រាងជារង្វង់មូលរាងស្វ៊ែរ = F (t៖ Azimuth, p៖ Polar)

# QCoreApplication|
source: Result: %1
km: លទ្ធផល៖ %1

# QCoreApplication|
source: To Expression
km: ដើម្បីបង្ហាញ

# QCoreApplication|
source: To MathML
km: ទៅ MathML

# QCoreApplication|
source: Simplify
km: ធ្វើឱ្យសាមញ្ញ

# QCoreApplication|
source: Examples
km: ឧទាហរណ៍

# QCoreApplication|
source: Selected viewport too small
km: ច្រកមើលដែលបានជ្រើសតូចពេក
