Repository: koompi/kde-khmer-translation
Catalog: Applications in stable KF5-based/messages/akonadi-contacts/akonadicontact5.po
Languages: km

source: Defines which application shall be used to show the postal address of a contact on a map. If 'Web Browser' is selected, an URL can be defined with placeholders for the single address parts. If 'External Application' is selected, a command with placeholders can be defined.
km: កំណត់ថាតើកម្មវិធីណាមួយដែលនឹងត្រូវប្រើដើម្បីបង្ហាញអាសយដ្ឋានប្រៃសណីយ៍នៃទំនាក់ទំនងនៅលើផែនទី។ ប្រសិនបើ 'កម្មវិធីរុករកគេហទំព័រ' ត្រូវបានជ្រើសរើស URL មួយអាចត្រូវបានកំណត់ជាមួយកន្លែងដាក់សម្រាប់ផ្នែកអាសយដ្ឋានតែមួយ។ ប្រសិនបើ 'កម្មវិធីខាងក្រៅ' ត្រូវបានជ្រើសរើសពាក្យបញ្ជាដែលមានកន្លែងដាក់អាចត្រូវបានកំណត់។

source: This URL defines the website that shall be used to show a contact's postal address.
km: URL នេះកំណត់គេហទំព័រដែលត្រូវប្រើដើម្បីបង្ហាញអាសយដ្ឋានប្រៃសណីយ៍ទំនាក់ទំនង។

source: The following placeholders can be used in the URL: %s: Street %r: Region %l: Location %z: Zip Code %c: Country ISO Code
km: កន្លែងដាក់ខាងក្រោមអាចត្រូវបានប្រើនៅក្នុង URL៖ %s៖ ផ្លូវ %r៖ តំបន់ %l៖ ទីតាំង lz1zcent1zlz1percent1 zlz1percent1

source: Address Command
km: បញ្ជាការអាសយដ្ឋាន

source: This command defines the application that shall be executed to show a contact's postal address.
km: ពាក្យបញ្ជានេះកំណត់កម្មវិធីដែលត្រូវប្រតិបត្តិដើម្បីបង្ហាញអាសយដ្ឋានប្រៃសណីយ៍ទំនាក់ទំនង។

source: The following placeholders can be used in the command: %s: Street %r: Region %l: Location %z: Zip Code %c: Country ISO Code
km: កន្លែងដាក់ខាងក្រោមអាចត្រូវបានប្រើក្នុងពាក្យបញ្ជា៖ %s៖ ផ្លូវ %r៖ តំបន់ %l៖ ទីតាំង lz1zcent1zlz1percent1 zlz1percent1

source: Define how a phone number of a contact should be dialed. 'System Default' uses the default application configured for this on your system (e.g. KDE Connect). Selecting a specific application will use that (if installed), 'External Application' allows you to specify a dial command with placeholders manually.
km: កំណត់វិធីដែលត្រូវហៅតាមលេខទូរស័ព្ទ។ 'លំនាំដើមរបស់ប្រព័ន្ធ' ប្រើកម្មវិធីលំនាំដើមដែលបានកំណត់រចនាសម្ព័ន្ធសម្រាប់វាលើប្រព័ន្ធរបស់អ្នក (ឧ។ KDE ភ្ជាប់) ។ ការជ្រើសរើសកម្មវិធីជាក់លាក់នឹងប្រើវា (ប្រសិនបើបានដំឡើង) 'កម្មវិធីខាងក្រៅ' អនុញ្ញាតឱ្យអ្នកបញ្ជាក់ពាក្យបញ្ជាតាមលេខទូរស័ព្ទជាមួយកន្លែងដាក់ដោយដៃ។

source: Phone Command
km: ពាក្យបញ្ជាទូរស័ព្ទ

source: This command defines the application that shall be executed to dial a contact's phone number.
km: ពាក្យបញ្ជានេះកំណត់កម្មវិធីដែលត្រូវប្រតិបត្តិដើម្បីចុចលេខទូរស័ព្ទទំនាក់ទំនង។

source: The following placeholders can be used in the command: %N: The raw number as stored in the address book. %n: The normalized number with all non-digit characters removed.
km: កន្លែងដាក់ខាងក្រោមអាចត្រូវបានប្រើក្នុងពាក្យបញ្ជា៖ %N៖ លេខឆៅដែលបានរក្សាទុកក្នុងសៀវភៅអាសយដ្ឋាន។ %n៖ លេខធម្មតាដែលមានតួអក្សរមិនមែនលេខទាំងអស់ត្រូវបានដកចេញ។

source: Defines which application shall be used to send an SMS to the phone number of a contact. If 'System Default' is selected the default handler for SMS messages on your system will be used (e.g. KDE Connect), otherwise the selected application will be used to send the SMS message (if installed on the computer). If 'External Application' is selected, a command with placeholders can be defined.
km: កំណត់កម្មវិធីណាមួយដែលនឹងត្រូវប្រើដើម្បីផ្ញើសារទៅលេខទូរស័ព្ទទំនាក់ទំនង។ ប្រសិនបើ 'ប្រព័ន្ធលំនាំដើម' ត្រូវបានជ្រើសរើសយកកម្មវិធីដោះស្រាយលំនាំដើមសម្រាប់សារ SMS នៅលើប្រព័ន្ធរបស់អ្នកនឹងត្រូវបានប្រើ (ឧ។ ភ្ជាប់ខេនអេស) បើមិនដូច្នេះទេកម្មវិធីដែលបានជ្រើសនឹងត្រូវបានប្រើដើម្បីផ្ញើសារ SMS (ប្រសិនបើដំឡើងលើកុំព្យូទ័រ) ។ ប្រសិនបើ 'កម្មវិធីខាងក្រៅ' ត្រូវបានជ្រើសរើសពាក្យបញ្ជាដែលមានកន្លែងដាក់អាចត្រូវបានកំណត់។

source: SMS Command
km: ពាក្យបញ្ជាសារជាអក្សរ

source: This command defines the application that shall be executed to send an SMS to a contact's phone number.
km: ពាក្យបញ្ជានេះកំណត់កម្មវិធីដែលត្រូវប្រតិបត្តិដើម្បីផ្ញើសារទៅលេខទូរស័ព្ទទំនាក់ទំនង។

source: The following placeholders can be used in the command: %N: The raw number as stored in the address book. %n: The normalized number with all non-digit characters removed. %t: The text
km: កន្លែងដាក់ខាងក្រោមអាចត្រូវបានប្រើក្នុងពាក្យបញ្ជា៖ %N៖ លេខឆៅដែលបានរក្សាទុកក្នុងសៀវភៅអាសយដ្ឋាន។ %n៖ លេខធម្មតាដែលមានតួអក្សរមិនមែនលេខទាំងអស់ត្រូវបានដកចេញ។ %t៖ អត្ថបទ

source: There is no application set which could be executed. Please go to the settings dialog and configure one.
km: មិនមានសំណុំកម្មវិធីដែលអាចត្រូវបានប្រតិបត្តិ។ សូមចូលទៅកាន់ប្រអប់កំណត់ហើយតំឡើងមួយ។

source: Dialing a number is not supported
km: ការហៅលេខមិនត្រូវបានគាំទ្រទេ

source: Sending an SMS is not supported
km: ការផ្ញើសារខ្លីមិនត្រូវបានគាំទ្រទេ

source: Unable to start ekiga process, check that ekiga executable is in your PATH variable.
km: មិនអាចចាប់ផ្តើមដំណើរការ ekiga បានទេពិនិត្យមើលថា ekiga ដែលអាចប្រតិបត្តិបានស្ថិតនៅក្នុងអថេរ PATH របស់អ្នក។

source: Ekiga Public API (D-Bus) seems to be disabled.
km: Ekiga API សាធារណៈ (D-Bus) ហាក់ដូចជាត្រូវបានបិទ។

source: Sending an SMS is currently not supported on Ekiga.
km: ការផ្ញើសារខ្លីបច្ចុប្បន្នមិនត្រូវបានគាំទ្រលើ Ekiga ទេ។

source: Unable to start sflphone-client-kde process, check that sflphone-client-kde executable is in your PATH variable.
km: មិនអាចចាប់ផ្តើមដំណើរការប្រព័ន្ធអេហ្វផលហ្វូន - ម៉ាស៊ីនភ្ញៀវ - ធីកបានទេពិនិត្យមើលថាតើកម្មវិធីអេហ្វដ្រូផិន - ខេ - ខេតអាចប្រតិបត្តិបាននៅក្នុងអថេរ PATH របស់អ្នក។

source: Unable to start skype process, check that skype executable is in your PATH variable.
km: មិនអាចចាប់ផ្តើមដំណើរការកម្មវិធី Skype សូមពិនិត្យមើលថាកម្មវិធី Skype អាចប្រតិបត្តិបានស្ថិតនៅក្នុងអថេរ PATH របស់អ្នក។

source: Skype Public API (D-Bus) seems to be disabled.
km: ស្កាយភ៍សាធារណៈ API (ឌី - បេស) ហាក់ដូចជាត្រូវបានបិទ។

source: Skype registration failed.
km: ការចុះឈ្មោះ Skype បានបរាជ័យ។

source: Protocol mismatch.
km: ពិធីសារមិនត្រូវគ្នា។

# @title:window
source: SMS text
km: សារ SMS

source: Please insert SMS text for an SMS to the following number: %1
km: សូមបញ្ចូលអក្សរផ្ញើសារជាអក្សរទៅកាន់លេខខាងក្រោម៖ %1

source: The contact has been changed by someone else. What should be done?
km: ទំនាក់ទំនងត្រូវបានផ្លាស់ប្តូរដោយនរណាម្នាក់ផ្សេងទៀត។ តើត្រូវធ្វើដូចម្តេច?

source: Take over changes
km: ទទួលយកការផ្លាស់ប្តូរ

source: Ignore and Overwrite changes
km: មិនអើពើនិងសរសេរជាន់លើការផ្លាស់ប្តូរ

# @title:window
source: Select Address Book
km: ជ្រើសសៀវភៅអាសយដ្ឋាន

source: Select the address book the new contact shall be saved in:
km: ជ្រើសរើសសៀវភៅអាសយដ្ឋានទំនាក់ទំនងថ្មីនឹងត្រូវបានរក្សាទុកក្នុង

source: New Contact
km: ទំនាក់ទំនងថ្មី

source: Edit Contact
km: កែសម្រួលទំនាក់ទំនង

source: Add to:
km: បន្ថែម​លើ៖

# @info
source: Do you really want to cancel?
km: តើអ្នកពិតជាចង់បោះបង់មែនទេ?

# @title:window
source: Confirmation
km: ការបញ្ជាក់

source: The contact group has been changed by someone else. What should be done?
km: ក្រុមទំនាក់ទំនងត្រូវបានផ្លាស់ប្តូរដោយនរណាម្នាក់ផ្សេងទៀត។ តើត្រូវធ្វើដូចម្តេច?

source: The name of the contact group must not be empty.
km: ឈ្មោះក្រុមទំនាក់ទំនងមិនត្រូវទុកចោលទេ។

source: Select the address book the new contact group shall be saved in:
km: ជ្រើសរើសសៀវភៅអាសយដ្ឋានក្រុមទំនាក់ទំនងថ្មីនឹងត្រូវរក្សាទុកនៅក្នុង

# @label The name of a contact group
source: Name:
km: ឈ្មោះ៖

# @label
source: Contact group members:
km: សមាជិកក្រុមទំនាក់ទំនង៖

source: New Contact Group
km: ក្រុមទំនាក់ទំនងថ្មី

source: Edit Contact Group
km: កែក្រុមទំនាក់ទំនង

source: The member with name <b>%1</b> is missing an email address
km: សមាជិកដែលមានឈ្មោះ <b> %1 </b> បាត់អាសយដ្ឋានអ៊ីមែល

source: Contact does not exist any more
km: ទំនាក់ទំនងមិនមានទៀតទេ

# contact's name
source: Name
km: ឈ្មោះ

# contact's email address
source: EMail
km: អ៊ីមែល

# @title:window
source: Contact Group %1
km: ក្រុមទំនាក់ទំនង %1

source: Address Book
km: សៀវភៅ​អាស័យ​ដ្ឋាន

# @title:window
source: Show Contact Group
km: បង្ហាញក្រុមទំនាក់ទំនង

# @title:column address books overview
source: Address Books
km: សៀវភៅអាសយដ្ឋាន

# @title:column name of a person
source: Name
km: ឈ្មោះ

# @title:column family name of a person
source: Family Name
km: ឈ្មោះគ្រួសារ

# @title:column given name of a person
source: Given Name
km: ឈ្មោះ​ដែល​បាន​អោយ

# @title:column home address of a person
source: Home
km: ផ្ទះ

# @title:column work address of a person
source: Work
km: ការងារ

# @title:column phone numbers of a person
source: Phone Numbers
km: លេខទូរសព្ទ

# @title:column the preferred email addresses of a person
source: Preferred EMail
km: អ៊ីម៉ែលដែលចូលចិត្ត

# @title:column all email addresses of a person
source: All EMails
km: អ៊ីម៉ែលទាំងអស់

# @title:window
source: Contact %1
km: ទំនាក់ទំនង %1

# @title:window
source: Show Contact
km: បង្ហាញទំនាក់ទំនង

source: Open Address Book
km: បើកសៀវភៅអាសយដ្ឋាន

source: Distribution List %1
km: បញ្ជីចែកចាយ %1

# @label Search in a list of contacts
source: Search:
km: ស្វែងរក

source: Anniversary
km: ខួប

source: Assistant's Name
km: ឈ្មោះជំនួយការ

source: Manager's Name
km: ឈ្មោះអ្នកគ្រប់គ្រង

source: Office
km: ការិយាល័យ

source: Profession
km: វិជ្ជាជីវៈ

# Wife/Husband/...
source: Partner's Name
km: ឈ្មោះដៃគូ

# Boolean value
source: yes
km: បាទ / ចាស

# Boolean value
source: no
km: ទេ

# @info
source: The vCard's primary email address is already in your address book; however, you may save the vCard into a file and import it into the address book manually.
km: អាសយដ្ឋានអ៊ីមែលចម្បងរបស់ vCard មានរួចហើយនៅក្នុងសៀវភៅអាសយដ្ឋានរបស់អ្នក។ ទោះយ៉ាងណាអ្នកអាចរក្សាទុក vCard ទៅក្នុងឯកសារហើយនាំចូលវាទៅក្នុងសៀវភៅអាសយដ្ឋានដោយដៃ។

# @info
source: The vCard was added to your address book; you can add more information to this entry by opening the address book.
km: កាតត្រូវបានបន្ថែមទៅសៀវភៅអាសយដ្ឋានរបស់អ្នក។ អ្នកអាចបន្ថែមព័ត៌មានបន្ថែមទៅធាតុនេះដោយបើកសៀវភៅអាសយដ្ឋាន។

# @info
source: A contact with the email address <email>%1</email> is already in your address book.
km: ទំនាក់ទំនងជាមួយអាសយដ្ឋានអ៊ីមែល <email> %1 </email> មាននៅក្នុងសៀវភៅអាសយដ្ឋានរបស់អ្នករួចហើយ។

# @info
source: You must create an address book before adding a contact. Do you want to create an address book?
km: អ្នកត្រូវតែបង្កើតសៀវភៅអាសយដ្ឋានមុនពេលបន្ថែមទំនាក់ទំនង។ តើអ្នកចង់បង្កើតសៀវភៅអាសយដ្ឋានទេ?

# @title:window
source: No Address Book Available
km: មិនមានសៀវភៅអាសយដ្ឋានទេ

# @title:window
source: Add Address Book
km: បន្ថែមសៀវភៅអាសយដ្ឋាន

# @info
source: <para>A contact for "%1" was successfully added to your address book.</para><para>Do you want to edit this new contact now?</para>
km: <para> ទំនាក់ទំនងសម្រាប់ " %1" ត្រូវបានបន្ថែមទៅសៀវភៅអាសយដ្ឋានរបស់អ្នកដោយជោគជ័យ។ </para><para> តើអ្នកចង់កែសម្រួលទំនាក់ទំនងថ្មីនេះទេ? </para>

source: Contact cannot be stored: %1
km: មិនអាចរក្សាទុកទំនាក់ទំនងបានទេ៖ %1

source: Failed to store contact
km: បានបរាជ័យក្នុងការផ្ទុកទំនាក់ទំនង

source: Contact created successfully
km: ទំនាក់ទំនងត្រូវបានបង្កើតដោយជោគជ័យ

# @info
source: Select the address book where the contact will be saved:
km: ជ្រើសសៀវភៅអាសយដ្ឋានដែលទំនាក់ទំនងនឹងត្រូវបានរក្សាទុក៖

source: Add Address Book Folder...
km: បន្ថែមថតសៀវភៅអាសយដ្ឋាន ...

source: Add a new address book folder to the currently selected address book folder.
km: បន្ថែមថតសៀវភៅអាសយដ្ឋានថ្មីទៅថតសៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើសបច្ចុប្បន្ន។

# @title:window
source: New Address Book Folder
km: ថតសៀវភៅអាសយដ្ឋានថ្មី

source: Could not create address book folder: %1
km: មិនអាចបង្កើតថតសៀវភៅអាស័យដ្ឋានបានទេ៖ %1

source: Address book folder creation failed
km: ការបង្កើតថតសៀវភៅអាសយដ្ឋានបានបរាជ័យ

source: Copy Address Book Folder
km: ថតចំលងថតសៀវភៅអាសយដ្ឋាន

source: Copy the selected address book folders to the clipboard.
km: ចម្លងថតសៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើសទៅក្ដារតម្បៀតខ្ទាស់។

source: Delete Address Book Folder
km: លុបថតសៀវភៅអាសយដ្ឋាន

source: Delete the selected address book folders from the address book.
km: លុបថតសៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើសចេញពីសៀវភៅអាសយដ្ឋាន។

source: Do you really want to delete this address book folder and all its sub-folders?
km: តើអ្នកពិតជាចង់លុបថតសៀវភៅអាសយដ្ឋាននេះនិងថតរងទាំងអស់ឬ?

# @title:window
source: Delete address book folder?
km: លុបថតសៀវភៅអាសយដ្ឋាន?

source: Could not delete address book folder: %1
km: មិនអាចលុបថតសៀវភៅអាសយដ្ឋានបានទេ៖ %1

source: Address book folder deletion failed
km: ការលុបថតសៀវភៅអាសយដ្ឋានបានបរាជ័យ

source: Update Address Book Folder
km: ធ្វើបច្ចុប្បន្នភាពថតសៀវភៅអាសយដ្ឋាន

source: Update the content of the selected address book folders.
km: ធ្វើបច្ចុប្បន្នភាពមាតិកាថតសៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើស។

source: Cut Address Book Folder
km: កាត់ថតសៀវភៅអាសយដ្ឋាន

source: Cut the selected address book folders from the address book.
km: កាត់ថតសៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើសចេញពីសៀវភៅអាសយដ្ឋាន។

source: Folder Properties...
km: លក្ខណៈសម្បត្តិថតឯកសារ ...

source: Open a dialog to edit the properties of the selected address book folder.
km: បើកប្រអប់ដើម្បីកែសម្រួលលក្ខណសម្បត្តិរបស់ថតសៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើស។

# @title:window
source: Properties of Address Book Folder %1
km: លក្ខណៈសម្បត្តិនៃថតសៀវភៅអាសយដ្ឋាន %1

source: Copy Contact
km: ចម្លងទំនាក់ទំនង

source: Copy the selected contacts to the clipboard.
km: ចម្លងទំនាក់ទំនងដែលបានជ្រើសរើសទៅក្តារតម្បៀតខ្ទាស់។

source: Delete Contact
km: លុបទំនាក់ទំនង

source: Delete the selected contacts from the address book.
km: លុបទំនាក់ទំនងដែលបានជ្រើសរើសចេញពីសៀវភៅអាសយដ្ឋាន។

source: Do you really want to delete the selected contact?
km: តើអ្នកពិតជាចង់លុបទំនាក់ទំនងដែលបានជ្រើសរើសឬ?

# @title:window
source: Delete Contact?
km: លុបទំនាក់ទំនង?

source: Could not delete contact: %1
km: មិនអាចលុបទំនាក់ទំនងបានទេ៖ %1

source: Contact deletion failed
km: ការលុបទំនាក់ទំនងបរាជ័យ

source: Cut Contact
km: កាត់ទំនាក់ទំនង

source: Cut the selected contacts from the address book.
km: កាត់ទំនាក់ទំនងដែលបានជ្រើសរើសចេញពីសៀវភៅអាសយដ្ឋាន។

source: Add &Address Book...
km: បន្ថែមសៀវភៅអាសយដ្ឋាន ...

source: Add a new address book<p>You will be presented with a dialog where you can select the type of the address book that shall be added.</p>
km: បន្ថែមសៀវភៅអាសយដ្ឋានថ្មី <p> អ្នកនឹងត្រូវបានបង្ហាញជាមួយប្រអប់ដែលអ្នកអាចជ្រើសរើសប្រភេទសៀវភៅអាសយដ្ឋានដែលត្រូវបន្ថែម។ </p>

source: Could not create address book: %1
km: មិនអាចបង្កើតសៀវភៅអាសយដ្ឋានបានទេ៖ %1

source: Address book creation failed
km: ការបង្កើតសៀវភៅអាសយដ្ឋានបានបរាជ័យ

source: &Delete Address Book
km: លុបសៀវភៅអាសយដ្ឋាន

source: Delete the selected address books<p>The currently selected address books will be deleted, along with all the contacts and contact groups they contain.</p>
km: លុបសៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើស <p> សៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើសបច្ចុប្បន្ននឹងត្រូវបានលុបចោលរួមជាមួយក្រុមទំនាក់ទំនងនិងក្រុមទំនាក់ទំនងទាំងអស់ដែលពួកគេមាន។ </p>

source: Do you really want to delete this address book?
km: តើអ្នកពិតជាចង់លុបសៀវភៅអាសយដ្ឋាននេះឬ?

# @title:window
source: Delete Address Book?
km: លុបសៀវភៅអាសយដ្ឋាន?

source: Address Book Properties...
km: ទ្រព្យសម្បត្តិសៀវភៅអាសយដ្ឋាន ...

source: Open a dialog to edit properties of the selected address book.
km: បើកប្រអប់ដើម្បីកែសម្រួលលក្ខណសម្បត្តិរបស់សៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើស។

source: Update Address Book
km: ធ្វើបច្ចុប្បន្នភាពសៀវភៅអាសយដ្ឋាន

source: Updates the content of all folders of the selected address books.
km: ធ្វើបច្ចុប្បន្នភាពមាតិកាថតទាំងអស់នៃសៀវភៅអាសយដ្ឋានដែលបានជ្រើសរើស។

source: Could not paste contact: %1
km: មិនអាចបិទភ្ជាប់ទំនាក់ទំនងបានទេ៖ %1

source: Paste failed
km: ការបិទភ្ជាប់បានបរាជ័យ

source: Copy Contact To
km: ចម្លងទំនាក់ទំនងទៅ

source: Move Contact To
km: ផ្លាស់ទីទំនាក់ទំនងទៅ

source: Edit Contact...
km: កែសម្រួលទំនាក់ទំនង ...

source: Copy Group
km: ចម្លងក្រុម

source: Copy Group To
km: ចម្លងក្រុមទៅ

source: Delete Group
km: លុបក្រុម

source: Cut Group
km: កាត់ក្រុម

source: Move Group To
km: ផ្លាស់ទីក្រុមទៅ

source: Edit Group...
km: កែក្រុម ...

source: New &Contact...
km: ទំនាក់ទំនងថ្មី ...

source: Create a new contact<p>You will be presented with a dialog where you can add data about a person, including addresses and phone numbers.</p>
km: បង្កើតទំនាក់ទំនងថ្មី <p> អ្នកនឹងត្រូវបានបង្ហាញជាមួយប្រអប់ដែលអ្នកអាចបន្ថែមទិន្នន័យអំពីមនុស្សម្នាក់រួមមានអាសយដ្ឋាននិងលេខទូរស័ព្ទ។ </p>

source: New &Group...
km: ក្រុមថ្មី ...

source: Create a new group<p>You will be presented with a dialog where you can add a new group of contacts.</p>
km: បង្កើតក្រុមថ្មី <p> អ្នកនឹងត្រូវបានបង្ហាញជាមួយប្រអប់ដែលអ្នកអាចបន្ថែមក្រុមទំនាក់ទំនងថ្មី។ </p>

source: Edit the selected contact<p>You will be presented with a dialog where you can edit the data stored about a person, including addresses and phone numbers.</p>
km: កែសម្រួលទំនាក់ទំនងដែលបានជ្រើសរើស <p> អ្នកនឹងត្រូវបានបង្ហាញជាមួយប្រអប់ដែលអ្នកអាចកែសម្រួលទិន្នន័យដែលបានរក្សាទុកអំពីមនុស្សម្នាក់រួមទាំងអាសយដ្ឋាននិងលេខទូរស័ព្ទ។ </p>

source: (One year old)
km: (អាយុមួយឆ្នាំ)

# @info:tooltip
source: Send SMS
km: ផ្ញើសារ SMS

# a contact's email address
source: Email
km: អ៊ីមែល

source: Homepage
km: គេហទំព័រ

source: Blog Feed
km: ប្លុកប្លក់

# @info:tooltip
source: Show address on map
km: បង្ហាញអាសយដ្ឋាននៅលើផែនទី

source: Notes
km: កំណត់ចំណាំ

source: Department
km: នាយកដ្ឋាន

source: IM Address
km: អាសយដ្ឋានអ៊ីម៉ែល

# @action:inmenu Copy the text of a general item
source: Copy Item
km: ចម្លងធាតុ

# @action:inmenu Copy a displayed email address
source: Copy Email Address
km: ចម្លងអាសយដ្ឋានអ៊ីមែល

# @action:inmenu Copy a link URL
source: Copy Link URL
km: ចម្លង URL តំណ

# @action:inmenu Copy a contact photo
source: Copy Photo
km: ថតចម្លងរូបថត

# @action:inmenu Copy a QR code image
source: Copy Code
km: លេខកូដចម្លង

source: <p style="color: white;"><b>Waiting for operation</b><br/></p>
km: <p style="color៖ white;"><b> កំពុងរង់ចាំប្រតិបត្តិការ </b><br/></p>

source: Remove Address
km: យកអាសយដ្ឋានចេញ

source: Do you really want to delete this address?
km: តើអ្នកពិតជាចង់លុបអាសយដ្ឋាននេះឬ?

source: Add Street
km: បន្ថែមផ្លូវ

source: Add Post Office Box
km: បន្ថែមប្រអប់ការិយាល័យប្រៃសណីយ៍

source: Add Postal Code
km: បន្ថែមលេខកូដប្រៃសណីយ

source: Add Locality
km: បន្ថែមតំបន់

source: Add Region
km: បន្ថែមតំបន់

source: Add a Country
km: បន្ថែមប្រទេស

# street/postal
source: This is the preferred address
km: នេះគឺជាអាសយដ្ឋានដែលពេញចិត្ត

source: Add Address
km: បន្ថែមអាសយដ្ឋាន

source: Update Address
km: អាស័យដ្ឋានធ្វើឱ្យទាន់សម័យ

source: Cancel
km: បោះបង់

# street/postal
source: Edit Address Type
km: កែសម្រួលប្រភេទអាសយដ្ឋាន

# street/postal
source: Address Types
km: ប្រភេទអាសយដ្ឋាន

# @item:inlistbox Category of contact info field
source: Other...
km: ផ្សេងទៀត...

# @item:inlistbox Category of contact info field
source: New Address Type
km: ប្រភេទអាសយដ្ឋានថ្មី

# @label The organization of a contact
source: Organization:
km: អង្គភាព៖

source: Add organization's name
km: បន្ថែមឈ្មោះអង្គភាព

# @label The profession of a contact
source: Profession:
km: វិជ្ជាជីវៈ៖

source: Add profession
km: បន្ថែមវិជ្ជាជីវៈ

# @label The title of a contact
source: Title:
km: ចំណងជើង៖

source: Add the title
km: បន្ថែមចំណងជើង

# @label The department of a contact
source: Department:
km: ផ្នែក៖

source: Add the department
km: បន្ថែមផ្នែក

# @label The office of a contact
source: Office:
km: ការិយាល័យ៖

source: Add the office
km: បន្ថែមការិយាល័យ

# @label The manager's name of a contact
source: Manager's name:
km: ឈ្មោះអ្នកគ្រប់គ្រង

source: Add manager's name
km: បន្ថែមឈ្មោះអ្នកគ្រប់គ្រង

# @label The assistant's name of a contact
source: Assistant's name:
km: ឈ្មោះជំនួយការ៖

source: Add assistant's name
km: បន្ថែមឈ្មោះជំនួយការ

# @label The free/busy information of a contact
source: Free/Busy:
km: ទំនេរ / រវល់៖

source: Add FreeBusy
km: បន្ថែម FreeBusy

# @title:tab
source: Contact
km: ទំនាក់ទំនង

# @title:tab
source: Location
km: ទីតាំង

# @title:tab
source: Business
km: អាជីវកម្ម

# @title:tab Personal properties of a contact
source: Personal
km: ផ្ទាល់ខ្លួន

# @title:tab
source: Notes
km: កំណត់ចំណាំ

# @title:tab
source: Custom Fields
km: វាលផ្ទាល់ខ្លួន

source: Custom Field Title
km: ចំណងជើងវាលផ្ទាល់ខ្លួន

source: Add name
km: បន្ថែមឈ្មោះ

source: Add Field
km: បន្ថែមវាល

source: Use field for all contacts
km: ប្រើវាលសម្រាប់ទំនាក់ទំនងទាំងអស់

source: Text
km: អត្ថបទ

source: Numeric
km: លេខ

source: Boolean
km: ប៊ូលីន

source: Date
km: កាលបរិច្ឆេទ

source: Time
km: ពេលវេលា

source: DateTime
km: ពេល​ណាត់ជួប

# Custom Fields
source: Do you really want to delete the selected custom field?
km: តើអ្នកពិតជាចង់លុបវាលផ្ទាល់ខ្លួនដែលបានជ្រើសរើសមែនទេ?

source: Confirm Delete
km: បញ្ជាក់លុប

# custom field title
source: Title
km: ចំណងជើង

# custom field value
source: Value
km: តម្លៃ

source: Add a Blog Feed
km: បន្ថែមមតិព័ត៌មានប្លុក

source: Short Name
km: ឈ្មោះ​ខ្លី

source: Full Name
km: ឈ្មោះ​ពេញ

source: Reverse Name with Comma
km: ឈ្មោះបញ្ច្រាសជាមួយសញ្ញាក្បៀស

source: Reverse Name
km: ឈ្មោះបញ្ច្រាស

source: Organization
km: អង្គការ

# @item:inlistbox A custom name format
source: Custom
km: ផ្ទាល់ខ្លួន

source: Tags
km: ស្លាក

source: Email
km: អ៊ីមែល

source: Select...
km: ជ្រើសរើស ...

source: Home
km: ផ្ទះ

source: Work
km: ការងារ

source: Other
km: ផ្សេងទៀត

source: Add an Email Account
km: បន្ថែមគណនីអ៊ីម៉ែល

source: Add an Email
km: បន្ថែមអ៊ីមែល

source: Remove Email
km: យកអ៊ីមែលចេញ

source: Show messages received from this contact as:
km: បង្ហាញសារដែលបានទទួលពីទំនាក់ទំនងនេះជា៖

source: Default
km: លំនាំដើម

source: Plain Text
km: អត្ថបទ​ធម្មតា

source: Allow remote content in received HTML messages
km: អនុញ្ញាតមាតិកាពីចម្ងាយនៅក្នុងសារ HTML ដែលបានទទួល

source: Messaging
km: ការផ្ញើសារ

source: Add an identifier
km: បន្ថែមអ្នកកំណត់អត្តសញ្ញាណ

# @item:inlistbox select from a list of IM protocols
source: Select...
km: ជ្រើសរើស ...

source: Add an IM
km: បន្ថែមអ៊ឹម

source: Remove IM
km: យក IM ចេញ

# @title:window
source: Edit Contact Name
km: កែសម្រួលឈ្មោះទំនាក់ទំនង

source: Honorific prefixes:
km: បុព្វបទកិត្តិយស៖

source: Given name:
km: ឈ្មោះ​ដែល​បាន​អោយ៖

source: Additional names:
km: ឈ្មោះបន្ថែម៖

source: Family names:
km: ឈ្មោះគ្រួសារ៖

source: Honorific suffixes:
km: បច្ច័យកិត្តិយស៖

source: Display:
km: បង្ហាញ៖

source: Dr.
km: លោកបណ្ឌិត

source: Miss
km: នឹក

source: Mr.
km: លោក

source: Mrs.
km: អ្នកស្រី

source: Ms.
km: លោកស្រី

source: Prof.
km: សាស្រ្តាចារ្យ

source: Name
km: ឈ្មោះ

source: Edit Contact Name
km: កែសម្រួលឈ្មោះទំនាក់ទំនង

source: Nickname
km: ឈ្មោះហៅក្រៅ

source: Add a Nickname
km: បន្ថែមសម្មតិនាម

source: Phone
km: ទូរស័ព្ទ

# @title:window
source: Edit Phone Number
km: កែលេខទូរស័ព្ទ

source: Add a Phone Number
km: បន្ថែមលេខទូរស័ព្ទ

source: Remove Phone Number
km: ដកលេខទូរស័ព្ទចេញ

source: Web
km: គេហទំព័រ

source: Profile
km: ប្រវត្តិរូប

source: Add a Web Site
km: បន្ថែមគេហទំព័រ

source: Remove Web Site
km: យកគេហទំព័រចេញ

source: Click to add date
km: ចុចដើម្បីបន្ថែមកាលបរិច្ឆេទ

source: Remove
km: លុប

# @option today
source: &Today
km: ថ្ងៃនេះ

# @option tomorrow
source: To&morrow
km: ថ្ងៃស្អែក

# @option next week
source: Next &Week
km: ស​ប្តា​ហ៍​ក្រោយ

# @option next month
source: Next M&onth
km: ខែក្រោយ

# @option do not specify a date
source: No Date
km: គ្មានកាលបរិច្ឆេទ

# @label The birthdate of a contact
source: Birthdate:
km: ថ្ងៃខែ​ឆ្នាំ​កំណើត៖

# @label The wedding anniversary of a contact
source: Anniversary:
km: ខួប៖

# @label The partner's name of a contact
source: Partner's name:
km: ឈ្មោះដៃគូ៖

source: This contact's image cannot be found.
km: រូបភាពទំនាក់ទំនងនេះមិនអាចរកឃើញទេ។

source: The photo of the contact (click to change)
km: រូបថតទំនាក់ទំនង (ចុចដើម្បីប្តូរ)

source: The logo of the company (click to change)
km: ឡូហ្គូរបស់ក្រុមហ៊ុន (ចុចដើម្បីប្តូរ)

source: Change photo...
km: ប្តូររូបថត ...

source: Change URL...
km: ប្តូរ URL ...

source: Save photo...
km: រក្សាទុក​រូបថត...

source: Remove photo
km: យករូបថតចេញ

source: Change logo...
km: ប្តូររូបសញ្ញា ...

source: Save logo...
km: រក្សាទុករូបសញ្ញា ...

source: Remove logo
km: យករូបសញ្ញាចេញ

source: Change image URL
km: ផ្លាស់ប្តូររូបភាព URL

source: Image URL:
km: URL រូបភាព៖

source: Images (%1)
km: រូបភាព (%1)

source: Set as Preferred
km: កំណត់ជាចំណូលចិត្ត
