Repository: koompi/kde-khmer-translation
Catalog: Applications in stable KF5-based/messages/akonadi-calendar-tools/calendarjanitor.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: Backup was successful. %1 incidence was saved.
km: ការបម្រុងទុកបានជោគជ័យ។ ឧប្បត្តិហេតុ %1 ត្រូវបានរក្សាទុក។

source: File is empty.
km: ឯកសារទទេ។

source: A backup is already in progress.
km: ការបម្រុងទុកកំពុងដំណើរការរួចហើយ។

source: Backing up your calendar data...
km: កំពុងបម្រុងទុកទិន្នន័យប្រតិទិនរបស់អ្នក ...

source: No data to backup.
km: គ្មានទិន្នន័យត្រូវបម្រុងទុក។

source: Processing collection %1 (id=%2)...
km: ដំណើរការប្រមូល %1 (id = %2) ...

source: An error occurred
km: កំហុស​មួយ​បាន​កើត​ឡើង

source: Bailing out. Fix your akonadi setup first. These kind of errors should not happen.
km: ការបង់ប្រាក់ធានា។ ជួសជុលការរៀបចំ akonadi របស់អ្នកជាមុន។ ប្រភេទនៃកំហុសទាំងនេះមិនគួរកើតឡើងទេ។

source: Error while fetching collections
km: មានកំហុសខណៈពេលទៅប្រមូលយក

source: There are no collections to process.
km: មិនមានការប្រមូលដើម្បីដំណើរការទេ។

source: Error while modifying incidence: %1
km: កំហុសខណៈពេលកែប្រែឧប្បត្តិហេតុ៖ %1

source: Fixed item %1
km: ធាតុថេរ %1

source: Error while deleting incidence: %1
km: កំហុសពេលលុបឧប្បត្តិហេតុ៖ %1

source: Deleted item %1
km: បានលុបធាតុ %1

source: Collection is read only, disabling fix mode.
km: ការប្រមូលត្រូវបានអានតែប៉ុណ្ណោះបិទរបៀបជួសជុល។

source: Collection is read only, skipping it.
km: ការប្រមូលត្រូវបានអានតែរំលងវា។

source: Collection is empty, ignoring it.
km: ការប្រមូលគឺទទេដោយមិនអើពើនឹងវា។

source: Checking for incidences with empty summary and description...
km: កំពុងពិនិត្យមើលឧប្បត្តិហេតុដោយមានការសង្ខេបនិងការពិពណ៌នាលំអិត ...

source: Checking for incidences with empty UID...
km: កំពុងពិនិត្យមើលឧប្បត្តិហេតុដែលមាន UID ទទេ ...

source: Checking for events with invalid DTSTART...
km: កំពុងពិនិត្យមើលព្រឹត្តិការណ៍ដែលមាន DTSTART មិនត្រឹមត្រូវ ...

source: Checking for recurring to-dos with invalid DTSTART...
km: កំពុងពិនិត្យមើលការងារត្រូវធ្វើដដែលៗជាមួយ DTSTART មិនត្រឹមត្រូវ ...

source: Checking for journals with invalid DTSTART...
km: ពិនិត្យទិនានុប្បវត្តិដែលមាន DTSTART មិនត្រឹមត្រូវ ...

source: Checking for orphans...
km: កំពុងពិនិត្យរកក្មេងកំព្រា…

source: The following incidences are children of nonexistent parents
km: ឧប្បត្តិហេតុខាងក្រោមនេះគឺជាកូនរបស់ឪពុកម្តាយដែលមិនមាន

source: In fix mode these children will be unparented.
km: នៅក្នុងរបៀបជួសជុលកុមារទាំងនេះនឹងមិនមានតម្លាភាពទេ។

source: Children were successfully unparented.
km: កុមារមិនមានតម្លាភាពដោយជោគជ័យ។

source: Checking for duplicate UIDs...
km: កំពុងពិនិត្យមើល UIDs ស្ទួន ...

source: Gathering statistics...
km: កំពុងប្រមូលស្ថិតិ ...

source: Events
km: ព្រឹត្តិការណ៍

source: Todos
km: ថូម៉ាស

source: Journals
km: ទិនានុប្បវត្តិ

source: Passed events and to-dos (>365 days)
km: ព្រឹត្តិការណ៍និងការងារត្រូវធ្វើដែលបានឆ្លងកាត់ (> ៣៦៥ ថ្ងៃ)

source: Old incidences with alarms
km: ឧប្បត្តិហេតុចាស់ជាមួយនឹងការជូនដំណឹង

source: Inline attachments
km: ឯកសារភ្ជាប់ក្នុងតួ

source: Items with empty remote id [!!]
km: ធាតុដែលមានលេខសម្គាល់ពីចម្ងាយទទេ [!!]

source: Total size of inline attachments (bytes)
km: ទំហំសរុបនៃឯកសារភ្ជាប់ក្នុងបណ្តាញ (បៃ)

source: Total size of inline attachments (KB)
km: ទំហំសរុបនៃឯកសារភ្ជាប់ក្នុងជួរ (KB)

source: Checking for RECURRING-ID incidences with nonexistent master incidence...
km: កំពុងពិនិត្យមើលឧប្បត្តិហេតុលេខសម្គាល់ដោយគ្មានឧប្បត្តិហេតុមេដែលមិនមាន ...

source: In fix mode the RECURRING-ID property will be unset and UID changed.
km: នៅក្នុងរបៀបជួសជុលលក្ខណៈសម្បត្តិ RECURRING-ID នឹងមិនត្រូវបានកំណត់ហើយ UID ត្រូវបានផ្លាស់ប្តូរ។

source: Recurrence cleared.
km: ការបោសសំអាតកើតឡើង។

source: Deleting alarms older than 365 days...
km: ការលុបសំឡេងរោទិ៍ចាស់ជាង ៣៦៥ ថ្ងៃ ...

source: invalid
km: មិនត្រឹមត្រូវ

source: recurrent
km: ចរន្ត

source: Found buggy incidence:
km: រកឃើញឧប្បត្តិហេតុ buggy៖

source: id=%1; summary="%2"
km: លេខសម្គាល់ = %1; សង្ខេប = " %2"

source: CalendarJanitor
km: ប្រតិទិន Janitor

source: A command line interface to report and fix errors in your calendar data
km: ចំណុចប្រទាក់បន្ទាត់ពាក្យបញ្ជាដើម្បីរាយការណ៍និងជួសជុលកំហុសនៅក្នុងទិន្នន័យប្រតិទិនរបស់អ្នក

source: Error while parsing %1
km: មានកំហុសខណៈពេលកំពុងវិភាគ %1

source: Example usage: %1
km: ការប្រើប្រាស់ឧទាហរណ៍៖ %1

source: Sérgio Martins
km: សេរីហ្គីម៉ាទីន

source: Maintainer
km: អ្នកថែរក្សា

source: Comma-separated list of collection ids to scan
km: បញ្ជីលេខដែលប្រមូលដោយសញ្ញាក្បៀសដើម្បីស្កេន

source: Fix broken incidences
km: ជួសជុលឧប្បត្តិហេតុដែលខូច

source: Backup your calendar
km: បម្រុងទុកប្រតិទិនរបស់អ្នក

source: Delete alarms older than 365 days
km: លុបសំឡេងរោទិ៍ចាស់ជាង ៣៦៥ ថ្ងៃ

source: --fix is incompatible with --backup
km: --ជួសជុល មិនឆបគ្នាជាមួយ ---បម្រុងទុក

source: --strip-old-alarms is incompatible with --backup
km: --ឆ្នូត-ចាស់-សំឡេងរោ មិនត្រូវគ្នានឹង - ថយក្រោយ

source: --strip-old-alarms is incompatible with --fix
km: --ឆ្នូត-ចាស់-សំឡេងរោទិ៍ មិនត្រូវគ្នានឹង --ជួសជុល

source: Running in fix mode.
km: ដំណើរការក្នុងរបៀបជួសជុល។

source: Please specify a output file.
km: សូមបញ្ជាក់ឯកសារលទ្ធផល។

source: Running in scan only mode.
km: ដំណើរការក្នុងរបៀបស្កេនតែប៉ុណ្ណោះ។
