Repository: koompi/kde-khmer-translation
Catalog: Applications in stable KF5-based/messages/akonadi-calendar-tools/konsolekalendar.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: There are no calendars available.
km: មិនមានប្រតិទិនទេ។

source: (Read only)
km: (អាច​បាន​តែ​អាន)

source: Create Calendar <Dry Run>: %1
km: បង្កើតប្រតិទិន <Dry Run> ៖ %1

source: Create Calendar <Verbose>: %1
km: បង្កើតប្រតិទិន <Verbose> ៖ %1

source: View Events <Dry Run>:
km: មើលព្រឹត្តិការណ៍ <Dry Run>

source: View Event <Verbose>:
km: មើលព្រឹត្តិការណ៍ <Verbose>

source: Sorry, export to HTML by UID is not supported yet
km: សូមអភ័យទោសការនាំចេញទៅ HTML ដោយ UID មិនត្រូវបានគាំទ្រនៅឡើយទេ

source: Events:
km: ព្រឹត្តិការណ៍៖

source: Events: %1
km: ព្រឹត្តិការណ៍៖ %1

source: Events: %1 - %2
km: ព្រឹត្តិការណ៍៖ %1 - %2

source: What: %1
km: តើអ្វីទៅ៖ %1

source: Begin: %1
km: ចាប់ផ្តើម៖ %1

source: End: %1
km: បញ្ចប់៖ %1

source: No Time Associated with Event
km: គ្មានពេលវេលាទាក់ទងនឹងព្រឹត្តិការណ៍ទេ

source: Location: %1
km: ទីតាំង៖ %1

source: Insert Event <Dry Run>:
km: បញ្ចូលព្រឹត្តិការណ៍ <Dry Run>

source: Insert Event <Verbose>:
km: បញ្ចូលព្រឹត្តិការណ៍ <Verbose>

source: Calendar is invalid. Please specify one with --calendar
km: ប្រតិទិនមិនត្រឹមត្រូវ។ សូមបញ្ជាក់មួយជាមួយ - ប្រតិទិន

source: Success: "%1" inserted
km: ជោគជ័យ៖ " %1" បានបញ្ចូល

source: Failure: "%1" not inserted
km: បរាជ័យ៖ " %1" មិនបានបញ្ចូល

source: Insert Event skipped, because UID "%1" is already known. <Verbose>
km: បញ្ចូលព្រឹត្តិការណ៍បានរំលងពីព្រោះ UID " %1" ត្រូវបានស្គាល់រួចហើយ។ <Verbose>

source: Add Event with UID "%1". <Verbose>
km: បន្ថែមព្រឹត្តិការណ៍ជាមួយ UID " %1" ។ <Verbose>

source: Change Event <Dry Run>:
km: ផ្លាស់ប្តូរព្រឹត្តិការណ៍ <Dry Run>

source: To Event <Dry Run>:
km: ព្រឹត្តិការណ៍ <Dry Run>

source: Change Event <Verbose>:
km: ផ្លាស់ប្តូរព្រឹត្តិការណ៍ <Verbose>

source: Success: "%1" changed
km: ជោគជ័យ៖ " %1" បានផ្លាស់ប្តូរ

source: Failure: "%1" not changed
km: បរាជ័យ៖ " %1" មិនបានផ្លាស់ប្តូរ

source: Delete Event <Dry Run>:
km: លុបព្រឹត្តិការណ៍ <Dry Run>

source: Delete Event <Verbose>:
km: លុបព្រឹត្តិការណ៍ <Verbose>

source: Success: "%1" deleted
km: ជោគជ័យ៖ " %1" ត្រូវបានលុបចោល

source: Error deleting: "%1"
km: កំហុសក្នុងការលុប៖ " %1"

source: Date:
km: កាលបរិច្ឆេទ៖

source: Summary:
km: សង្ខេប៖

source: (no summary available)
km: (មិនមានសេចក្តីសង្ខេបទេ)

source: Location:
km: ទីតាំង៖

source: (no location available)
km: (មិនមានទីតាំង)

source: Description:
km: ការពិពណ៌នាសង្ខេប៖

source: (no description available)
km: (មិនមានការពិពណ៌នាទេ)

source: [all day]
km: [ពេញមួយថ្ងៃ]

source: KonsoleKalendar
km: កុងសូលខេន

source: A command line interface to KDE calendars
km: ចំណុចប្រទាក់បន្ទាត់ពាក្យបញ្ជាទៅប្រតិទិន KDE

source: (c) 2002-2009, Tuukka Pasanen and Allen Winter
km: (c) ឆ្នាំ ២០០២-២០០៩ ទួគីកាប៉ាសាណាននិងអាឡិនរដូវរងារ

source: Bug fixing
km: ការកែកំហុស

source: Allen Winter
km: អាឡិនរដូវរងារ

source: Maintainer
km: អ្នកថែរក្សា

source: Author
km: អ្នកនិពន្ធ

source: Print helpful runtime messages
km: បោះពុម្ពសារពេលរត់មានប្រយោជន៍

source: Print what would have been done, but do not execute
km: ព្រីនអ្វីដែលនឹងត្រូវបានធ្វើប៉ុន្តែកុំប្រតិបត្តិ

source: Allow calendars which might need an interactive user interface
km: អនុញ្ញាតប្រតិទិនដែលអាចត្រូវការអន្តរកម្មអ្នកប្រើប្រាស់

source: Operate for Events only (Default)
km: ប្រតិបត្តិការសម្រាប់ព្រឹត្តិការណ៍នានា (លំនាំដើម)

source: Operate for To-dos only [NOT WORKING YET]
km: ប្រតិបត្តិការសំរាប់ការងារត្រូវធ្វើ

source: Operate for Journals only [NOT WORKING YET]
km: ប្រតិបត្តិការសម្រាប់ទិនានុប្បវត្តិតែប៉ុណ្ណោះ [កុំធ្វើការងារយ៉េត]

source: Print incidences in specified export format
km: បោះពុម្ពការបង្ហាញជាទ្រង់ទ្រាយនាំចេញដែលបានបញ្ជាក់

source: Insert an incidence into the calendar
km: បញ្ចូលឧប្បត្តិហេតុទៅក្នុងប្រតិទិន

source: Modify an existing incidence
km: កែប្រែឧប្បត្តិហេតុដែលមានស្រាប់

source: Remove an existing incidence
km: ដកចេញនូវឧប្បត្តិហេតុដែលមានស្រាប់

source: Create new Akonadi Resource for file
km: បង្កើតធនធាន Akonadi ថ្មីសម្រាប់ឯកសារ

source: Import this calendar to main calendar
km: នាំចូលប្រតិទិននេះទៅប្រតិទិនសំខាន់

source: List available calendars
km: រាយប្រតិទិនដែលមាន

source: View all calendar entries, ignoring date/time options
km: មើលធាតុប្រតិទិនទាំងអស់ដោយមិនអើពើនឹងជម្រើសកាលបរិច្ឆេទ / ពេលវេលា

source: View next activity in calendar
km: មើលសកម្មភាពបន្ទាប់នៅក្នុងប្រតិទិន

source: From start date show next # days' activities
km: ចាប់ពីកាលបរិច្ឆេទចាប់ផ្តើមបង្ហាញសកម្មភាព #ថ្ងៃបន្ទាប់

source: Incidence Unique-string identifier
km: ឧបករណ៏កំណត់អត្តសញ្ញាណខ្សែអក្សរដែលមានតែមួយ

source: Start from this day [YYYY-MM-DD]
km: ចាប់ផ្តើមពីថ្ងៃនេះ [YYYY-MM-DD]

source: Start from this time [HH:MM:SS]
km: ចាប់ផ្តើមពីពេលនេះ [HH៖ MM៖ SS]

source: End at this day [YYYY-MM-DD]
km: បញ្ចប់នៅថ្ងៃនេះ [YYYY-MM-DD]

source: End at this time [HH:MM:SS]
km: បញ្ចប់នៅពេលនេះ [HH៖ MM៖ SS]

source: Start from this time [secs since epoch]
km: ចាប់ផ្តើមពីពេលនេះ [វិនាទីចាប់តាំងពីសម័យកាល]

source: End at this time [secs since epoch]
km: បញ្ចប់នៅពេលនេះ [វិនាទីចាប់តាំងពីសម័យកាល]

source: Add summary to incidence (for add/change modes)
km: បន្ថែមការសង្ខេបទៅឧប្បត្តិហេតុ (សម្រាប់របៀបបន្ថែម / ផ្លាស់ប្តូរ)

source: Add description to incidence (for add/change modes)
km: បន្ថែមការពិពណ៌នាអំពីឧប្បត្តិហេតុ (សម្រាប់របៀបបន្ថែម / ផ្លាស់ប្តូរ)

source: Add location to incidence (for add/change modes)
km: បន្ថែមទីតាំងទៅនឹងឧប្បត្តិហេតុ (សម្រាប់របៀបបន្ថែម / ផ្លាស់ប្តូររបៀប)

source: Calendar to use when creating a new incidence
km: ប្រតិទិនត្រូវប្រើនៅពេលបង្កើតឧប្បត្តិហេតុថ្មី

source: Export file type (Default: text)
km: ប្រភេទឯកសារនាំចេញ (លំនាំដើម៖ អត្ថបទ)

source: Export to file (Default: stdout)
km: នាំចេញទៅឯកសារ (លំនាំដើម៖ stdout)

source: Print list of export types supported and exit
km: បោះពុម្ពបញ្ជីប្រភេទនាំចេញដែលគាំទ្រនិងចាកចេញ

source: %1 supports these export formats:
km: %1 គាំទ្រទ្រង់ទ្រាយនាំចេញទាំងនេះ៖

# the default export format
source: %1 [Default]
km: %1 [លំនាំដើម]

# short text export
source: %1 (like %2, but more compact)
km: %1 (ដូចជា %2 ប៉ុន្តែកាន់តែបង្រួម)

# HTMLmonth export
source: %1 (like %2, but in a month view)
km: %1 (ដូចជា %2 ប៉ុន្តែក្នុងមួយខែ)

# comma-separated values export
source: %1 (Comma-Separated Values)
km: %1 (តម្លៃបំបែកដោយក្បៀស)

source: Sorry, To-dos are not working yet.
km: សូមទោសការងារត្រូវធ្វើមិនទាន់ដំណើរការនៅឡើយទេ។

source: Sorry, Journals are not working yet.
km: សូមទោសទិនានុប្បវត្តិមិនទាន់ដំណើរការនៅឡើយទេ។

source: Invalid Export Type Specified: %1
km: ប្រភេទនាំចេញមិនត្រឹមត្រូវត្រូវបានបញ្ជាក់៖ %1

source: Invalid Start Date Specified: %1
km: កាលបរិច្ឆេទចាប់ផ្តើមមិនត្រឹមត្រូវដែលបានបញ្ជាក់៖ %1

source: Invalid Start Time Specified: %1
km: ពេលវេលាចាប់ផ្តើមមិនត្រឹមត្រូវត្រូវបានបញ្ជាក់៖ %1

source: Invalid End Date Specified: %1
km: កាលបរិច្ឆេទបញ្ចប់មិនត្រឹមត្រូវដែលបានបញ្ជាក់៖ %1

source: Invalid Date Count Specified: %1
km: ចំនួនកាលបរិច្ឆេទមិនត្រឹមត្រូវបានបញ្ជាក់៖ %1

source: Invalid End Time Specified: %1
km: ពេលវេលាបញ្ចប់មិនត្រឹមត្រូវដែលបានបញ្ជាក់៖ %1

source: Only 1 operation mode (view, add, change, delete, create) permitted at any one time
km: មានតែរបៀបប្រតិបត្ដិការ ១ ប៉ុណ្ណោះ (មើលបន្ថែមប្តូរលុបបង្កើត) ត្រូវបានអនុញ្ញាតក្នុងពេលតែមួយ

source: Ending Date/Time occurs before the Starting Date/Time
km: កាលបរិច្ឆេទបញ្ចប់ / ពេលវេលាកើតឡើងមុនពេលកាលបរិច្ឆេទ / ពេលវេលាចាប់ផ្តើម

source: Calendar %1 successfully imported
km: ប្រតិទិន %1 បាននាំចូលដោយជោគជ័យ

source: Unable to import calendar: %1
km: មិនអាចនាំចូលប្រតិទិន៖ %1

source: Attempting to insert an event that already exists
km: ប៉ុនប៉ងបញ្ចូលព្រឹត្តិការណ៍ដែលមានរួចហើយ

source: Missing event UID: use --uid command line option
km: បាត់ព្រឹត្តិការណ៍ UID៖ ប្រើជម្រើសបន្ទាត់ពាក្យបញ្ជា

source: No such event UID: change event failed
km: គ្មានព្រឹត្តិការណ៍បែបនេះ UID៖ ព្រឹត្តិការណ៍ផ្លាស់ប្ដូរបានបរាជ័យ

source: No such event UID: delete event failed
km: គ្មានព្រឹត្តិការណ៍បែបនេះទេ UID៖ លុបព្រឹត្តិការណ៍បានបរាជ័យ

source: Cannot open specified export file: %1
km: មិនអាចបើកឯកសារនាំចេញដែលបានបញ្ជាក់ទេ៖ %1

source: Cannot create Akonadi resource from file: %1
km: មិនអាចបង្កើតធនធាន Akonadi ពី file៖ %1
