Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/bomber/bomber.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

# Used to display the current level of play to the user
source: Level: %1
km: កំរិតៈ %1

# Used to inform the user of their current score
source: Score: %1
km: ពិន្ទុ​ ៖ %1

# Used to tell the user how many lives they have left
source: Lives: %1
km: ជីវិត​ ៖ %1

# Menu item used to disable or enable sound
source: &Play Sounds
km: ចាក់សំឡេង

# The name of the action used for dropping bombs
source: &Drop bomb
km: ទម្លាក់គ្រាប់បែក

# The tool tip text for the action used to drop bombs
source: Drop bomb
km: ទម្លាក់គ្រាប់បែក

# Description of the action used to drop bombs
source: Makes the plane drop a bomb while flying
km: ធ្វើឲ្យ យន្ដហោះទម្លាក់គ្រាប់បែកពេលហោះ

# Message displayed when player tries to quit a game that is currently running
source: Do you really want to close the running game?
km: តើអ្នកពិតជាចង់បិទល្បែងដែលកំពុងដំណើរការមែនទេ?

source: Congratulations! You made it into the hall of fame.
km: សូមអបអរសាទរ! អ្នកបានធ្វើឱ្យវាក្លាយជាសាលនៃកិត្តិនាម។

source: You gained a score of %1 point.
km: អ្នកទទួលបានពិន្ទុ %1 ។

source: End of Game
km: ចប់ហ្គេម

# Game over messaged displayed in the status bar
source: Game over. Press '%1' for a new game
km: ល្បែង​ចប់ហើយ។ ចុច '%1' សម្រាប់ហ្គេមថ្មី

source: Whether game sounds are played.
km: មិនថាសម្លេងហ្គេមត្រូវបានលេងទេ។

source: Main Toolbar
km: របារឧបករណ៍មេ

# Message show to the user when the game is loaded
source: Welcome to Bomber. Click to start a game
km: សូមស្វាគមន៍មកកាន់ Bomber ។ ចុចដើម្បីចាប់ផ្តើមល្បែង

# Message show to the user while the game is paused
source: Paused
km: បានផ្អាក

# Message telling user which level they just completed
source: You have successfully cleared level %1
km: អ្នកបានសម្អាតកម្រិត %1 បានយ៉ាងជោគជ័យ

# Message telling user which level they are about to start
source: On to level %1.
km: នៅលើកម្រិត %1 ។

# Used to tell the user that the game is over
source: Game over.
km: ល្បែង​ចប់ហើយ។

source: Arcade bombing game
km: ល្បែងបំផ្ទុះគ្រាប់បែក

source: Bomber
km: អ្នកបំផ្ទុះគ្រាប់បែក

source: (C) 2007 John-Paul Stanford
km: (C) ២០០៧ John-Paul Stanford

source: Porting to QGraphicsView.
km: ច្រកទៅ QGraphicsView ។
