Repository: koompi/kde-khmer-translation
Catalog: Applications in stable KF5-based/messages/akonadi-search/akonadi_search.po
Languages: km

# @info:status
source: No indexers available
km: មិនមានលិបិក្រមទេ

source: Indexing collection: %1
km: ការប្រមូលសន្ទស្សន៍៖ %1

source: Ready
km: រួចរាល់ហើយ

source: Collection "%1" indexed
km: ការប្រមូល " %1" បានធ្វើលិបិក្រម

source: Text Files (*.txt);;All Files (*)
km: ឯកសារអត្ថបទ (* .txt);; ឯកសារទាំងអស់ (*)

source: Could not write the file %1: "%2" is the detailed error description.
km: មិនអាចសរសេរឯកសារបានទេ %1៖ " %2" គឺជាការពិពណ៌នាកំហុសលម្អិត។

source: Save File Error
km: រក្សាទុកឯកសារកំហុស

source: Contacts
km: ទំនាក់ទំនង

source: Autocompleted from received and sent emails
km: បំពេញដោយស្វ័យប្រវត្តិពីអ៊ីមែលដែលបានទទួលនិងផ្ញើ

source: Search in contacts indexed from sent and received emails too
km: ស្វែងរកទំនាក់ទំនងដែលបានស្រង់ចេញពីអ៊ីមែលដែលបានផ្ញើនិងទទួលផងដែរ
