Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/calendarsupport/calendarsupport.po
Languages: km

# @title:window
source: Archive/Delete Past Events and To-dos
km: ទុកក្នុងប័ណ្ណសារ / លុបព្រឹត្តិការណ៍ពីមុននិងការងារត្រូវធ្វើ

# @action:button
source: &Archive
km: ប័ណ្ណសារ

# @info:whatsthis
source: Archiving saves old items into the given file and then deletes them in the current calendar. If the archive file already exists they will be added. (<link url="#">How to restore</link>)
km: បណ្ណសាររក្សាទុកធាតុចាស់ៗទៅក្នុងឯកសារដែលបានផ្តល់ហើយបន្ទាប់មកលុបវានៅក្នុងប្រតិទិនបច្ចុប្បន្ន។ ប្រសិនបើឯកសារប័ណ្ណសារមានរួចហើយពួកគេនឹងត្រូវបានបន្ថែម។ ( <link url="#"> វិធីស្តារ </link>

# @info:whatsthis
source: In order to add an archive to your calendar, use the Merge Calendar function. You can view an archive by opening it like you would any other calendar. It is not saved in a special format, but as vCalendar.
km: ដើម្បីបន្ថែមប័ណ្ណសារទៅប្រតិទិនរបស់អ្នកសូមប្រើមុខងារបញ្ចូលគ្នាប្រតិទិន។ អ្នកអាចមើលប័ណ្ណសារដោយបើកវាដូចជាអ្នកចង់មើលប្រតិទិនផ្សេងទៀតដែរ។ វាមិនត្រូវបានរក្សាទុកក្នុងទ្រង់ទ្រាយពិសេសទេប៉ុន្តែជា vCalendar ។

# @option:radio
source: Archive now items older than:
km: ទុកធាតុចាស់ជាងនេះក្នុងប័ណ្ណសារឥឡូវ៖

# @info:tooltip
source: Enable one time archiving or purging of older items
km: បើកដំណើរការបណ្ណសារមួយដងឬលុបចោលធាតុចាស់

# @info:whatsthis
source: If you check this box, events and to-dos older than the specified age will be archived or purged. The items will be archived unless the "Delete only" option is enabled; else the items will be purged and not saved.
km: ប្រសិនបើអ្នកធីកប្រអប់នេះព្រឹត្តិការណ៍និងការងារត្រូវធ្វើចាស់ជាងអាយុដែលបានបញ្ជាក់នឹងត្រូវទុកក្នុងប័ណ្ណសារឬលុបចោល។ ធាតុនឹងត្រូវបានទុកក្នុងប័ណ្ណសារលុះត្រាតែបានបើកជម្រើស "Delete only" ។ ធាតុផ្សេងទៀតនឹងត្រូវបានសម្អាតហើយមិនបានរក្សាទុកទេ។

# @info:tooltip
source: Set the one time archiving cut-off date
km: កំណត់កាលបរិច្ឆេទកាត់បណ្ណសារតែមួយដង

# @info:whatsthis
source: The date before which items should be archived. All older events and to-dos will be saved and deleted, the newer (and events exactly on that date) will be kept.
km: កាលបរិច្ឆេទមុនធាតុណាដែលត្រូវទុកក្នុងប័ណ្ណសារ។ រាល់ព្រឹត្តិការណ៍និងការងារត្រូវធ្វើចាស់ៗទាំងអស់នឹងត្រូវបានរក្សាទុកនិងលុបចោល (ថ្មីជាងនេះនិងព្រឹត្តិការណ៍ដែលនឹងត្រូវធ្វើឡើងនៅកាលបរិច្ឆេទនោះ) ។

# @option:radio
source: Automaticall&y archive items older than:
km: ទុកប័ណ្ណសារដែលចាស់ជាង៖

# @info:tooltip
source: Enable automatic archiving or purging of older items
km: បើកដំណើរការបណ្ណសារដោយស្វ័យប្រវត្តិរឺបោសសំអាតរបស់ចាស់ៗ

# @info:whatsthis
source: If this feature is enabled, the application will regularly check if events and to-dos have to be archived; this means you will not need to use this dialog box again, except to change the settings.
km: ប្រសិនបើមុខងារនេះត្រូវបានបើកដំណើរការកម្មវិធីនឹងត្រួតពិនិត្យជាទៀងទាត់ប្រសិនបើព្រឹត្តិការណ៍និងការងារត្រូវធ្វើត្រូវធ្វើក្នុងប័ណ្ណសារ។ នេះមានន័យថាអ្នកនឹងមិនចាំបាច់ប្រើប្រអប់នេះម្តងទៀតទេលើកលែងតែផ្លាស់ប្តូរការកំណត់។

# @info:tooltip
source: Set the archival age in days, weeks or months
km: កំណត់អាយុប័ណ្ណសារជាថ្ងៃសប្តាហ៍ឬខែ

# @info:whatsthis
source: The age of the events and to-dos to archive. All older items will be saved and deleted, the newer will be kept.
km: អាយុព្រឹត្តិការណ៍និងការងារត្រូវធ្វើត្រូវធ្វើក្នុងប័ណ្ណសារ។ រាល់វត្ថុចាស់ៗទាំងអស់នឹងត្រូវបានរក្សាទុកនិងលុបហើយរបស់ថ្មីនឹងត្រូវរក្សាទុក។

# @info:tooltip
source: Set the units for the automatic archive age
km: កំណត់ឯកតាសម្រាប់អាយុប័ណ្ណសារដោយស្វ័យប្រវត្តិ

# @info:whatsthis
source: Select the time units (days, weeks or months) for automatic archiving.
km: ជ្រើសរើសឯកតាពេលវេលា (ថ្ងៃសប្តាហ៍ឬខែ) សម្រាប់ប័ណ្ណសារដោយស្វ័យប្រវត្តិ។

# @item:inlistbox expires in daily units
source: Day(s)
km: ថ្ងៃ

# @item:inlistbox expiration in weekly units
source: Week(s)
km: សប្តាហ៍

# @item:inlistbox expiration in monthly units
source: Month(s)
km: ខែ

# @label
source: Archive &file:
km: ឯកសារប័ណ្ណសារ៖

# @label filter for KUrlRequester
source: *.ics|iCalendar Files
km: * .ics | ឯកសារ iCalendar

# @info:tooltip
source: Set the location of the archive
km: កំណត់ទីតាំងប័ណ្ណសារ

# @info:whatsthis
source: The path of the archive file. The events and to-dos will be appended to the specified file, so any events that are already in the file will not be modified or deleted. You can later load or merge the file like any other calendar. It is not saved in a special format, it uses the iCalendar format.
km: ផ្លូវនៃឯកសារប័ណ្ណសារ។ ព្រឹត្តិការណ៍និងការងារត្រូវធ្វើនឹងត្រូវបន្ថែមទៅឯកសារដែលបានបញ្ជាក់ដូច្នេះព្រឹត្តិការណ៍ណាមួយដែលមានរួចហើយនៅក្នុងឯកសារនឹងមិនត្រូវបានកែប្រែឬលុបចោលទេ។ ក្រោយមកអ្នកអាចផ្ទុកឬបញ្ចូលឯកសារចូលគ្នាដូចប្រតិទិនផ្សេងទៀត។ វាមិនត្រូវបានរក្សាទុកក្នុងទ្រង់ទ្រាយពិសេសទេវាប្រើទ្រង់ទ្រាយ iCalendar ។

# @title:group
source: Type of Items to Archive
km: ប្រភេទនៃធាតុដែលត្រូវទុកក្នុងប័ណ្ណសារ

# @info:whatsthis
source: Here you can select which items should be archived. Events are archived if they ended before the date given above; to-dos are archived if they were finished before the date.
km: នៅទីនេះអ្នកអាចជ្រើសរើសធាតុណាដែលគួរតែទុកក្នុងប័ណ្ណសារ។ ព្រឹត្តិការណ៍ត្រូវបានទុកក្នុងប័ណ្ណសារប្រសិនបើវាបញ្ចប់មុនកាលបរិច្ឆេទដែលបានផ្តល់ជូនខាងលើ។ ការងារត្រូវធ្វើត្រូវបានទុកក្នុងប័ណ្ណសារប្រសិនបើពួកវាបានបញ្ចប់មុនកាលបរិច្ឆេទ។

# @option:check
source: Archive &Events
km: ព្រឹត្តិការណ៍ប័ណ្ណសារ

# @option:check
source: Archive or purge events
km: ទុកក្នុងប័ណ្ណសារឬលុបចោលព្រឹត្តិការណ៍

# @info:whatsthis
source: Select this option to archive events if they ended before the date given above.
km: ជ្រើសជម្រើសនេះដើម្បីទុកព្រឹត្តិការណ៍ក្នុងប័ណ្ណសារប្រសិនបើវាបញ្ចប់មុនកាលបរិច្ឆេទដែលបានផ្តល់ជូនខាងលើ។

# @option:check
source: Archive Completed &To-dos
km: ប័ណ្ណសារបានបញ្ចប់ការងារត្រូវធ្វើ

# @option:check
source: Archive or purge completed to-dos
km: ប័ណ្ណសារឬការបោសសំអាតដែលបានបញ្ចប់ត្រូវធ្វើការងារត្រូវធ្វើ

# @info:whatsthis
source: Select this option to archive to-dos if they were completed before the date given above.
km: ជ្រើសជម្រើសនេះដើម្បីទុកការងារត្រូវធ្វើប្រសិនបើប័ណ្ណសារត្រូវបានបញ្ចប់មុនកាលបរិច្ឆេទដែលបានផ្តល់ជូនខាងលើ។

# @option:check
source: &Delete only, do not save
km: លុបតែកុំរក្សាទុក

# @info:tooltip
source: Purge the old items without saving them
km: លុបបំបាត់ធាតុចាស់ដោយមិនរក្សាទុកវា

# @info:whatsthis
source: Select this option to delete old events and to-dos without saving them. It is not possible to recover the events later.
km: ជ្រើសជម្រើសនេះដើម្បីលុបព្រឹត្តិការណ៍ចាស់និងការងារត្រូវធ្វើដោយមិនរក្សាទុកវា។ វាមិនអាចទៅរួចទេក្នុងការរកឃើញព្រឹត្តិការណ៍នៅពេលក្រោយ។

# @info
source: The archive file name is not valid.
km: ឈ្មោះឯកសារប័ណ្ណសារមិនត្រឹមត្រូវ។

source: No attachment named "%1" found in the incidence.
km: គ្មានឯកសារភ្ជាប់ដែលមានឈ្មោះថា " %1" ត្រូវបានរកឃើញនៅក្នុងឧប្បត្តិហេតុនេះ។

source: The attachment "%1" is a web link that is inaccessible from this computer.
km: ឯកសារភ្ជាប់ " %1" គឺជាតំណគេហទំព័រដែលមិនអាចចូលប្រើបានពីកុំព្យូទ័រនេះ។

source: The calendar invitation stored in this email message is broken in some way. Unable to continue.
km: ការអញ្ជើញប្រតិទិនដែលបានរក្សាទុកនៅក្នុងសារអ៊ីមែលនេះត្រូវបានខូចតាមមធ្យោបាយខ្លះ។ មិនអាចបន្ត។

source: Unable to create a temporary file for the attachment.
km: មិនអាចបង្កើតឯកសារបណ្តោះអាសន្នសម្រាប់ឯកសារភ្ជាប់ទេ។

source: Save Attachment
km: រក្សាទុកឯកសារភ្ជាប់

# @info
source: Unable to purge to-dos with uncompleted children.
km: មិនអាចបោសសំអាតការងារត្រូវធ្វើជាមួយកុមារដែលមិនទាន់បានបញ្ចូល។

# @title:window
source: Delete To-do
km: លុបការងារត្រូវធ្វើ

# incidence category: appointment
source: Appointment
km: ការតែងតាំង

# incidence category
source: Business
km: អាជីវកម្ម

# incidence category
source: Meeting
km: ការប្រជុំ

# incidence category: phone call
source: Phone Call
km: ទូរស័ព្ទ

# incidence category
source: Education
km: ការអប់រំ

source: Vacation
km: វិស្សមកាល

source: Special Occasion
km: ឳ​កាស​ពិសេស

# incidence category
source: Personal
km: ផ្ទាល់ខ្លួន

source: Travel
km: ធ្វើដំណើរ

# incidence category
source: Miscellaneous
km: ផ្សេងៗ

# incidence category
source: Birthday
km: ថ្ងៃកំណើត

source: <placeholder>undefined</placeholder>
km: <placeholder> មិនបានកំណត់ </placeholder>

source: There are no items before %1
km: មិនមានធាតុមុនពេល %1

source: Delete all items before %1 without saving? The following items will be deleted:
km: លុបធាតុទាំងអស់មុន %1 ដោយមិនរក្សាទុក? ធាតុខាងក្រោមនឹងត្រូវលុបចេញ៖

source: Delete Old Items
km: លុបធាតុចាស់

# save failure cause unknown
source: Reason unknown
km: មូលហេតុមិនដឹង

source: Cannot write archive file %1. %2
km: មិនអាចសរសេរឯកសារប័ណ្ណសារ %1 ។ %2

source: Cannot write archive. %1
km: មិនអាចសរសេរប័ណ្ណសារ។ %1

source: Archiving events
km: ព្រឹត្តិការណ៍ទុកក្នុងប័ណ្ណសារ

source: Free
km: ឥតគិតថ្លៃ

source: Busy
km: រវល់

source: Unavailable
km: មិនមាន

source: Tentative
km: ការសងសឹក

source: Attendee
km: អ្នក​ចូលរួម

source: %1 %2, %3 to %4
km: %1 %2, %3 ទៅ %4

source: %1, %2 %3, %4 to %5
km: %1, %2 %3, %4 ទៅ %5

# @info:tooltip
source: Free Period
km: រយៈពេលឥតគិតថ្លៃ

# @info:tooltip period start time
source: Start:
km: ចាប់ផ្តើម៖

# @info:tooltip period end time
source: End:
km: បញ្ចប់៖

# @info:tooltip period duration
source: Duration:
km: រយៈពេល៖

source: Use email settings from System Settings
km: ប្រើការកំណត់អ៊ីមែលពីការកំណត់ប្រព័ន្ធ

source: Check this box to use the KDE-wide e-mail settings, which are defined using the System Settings "About Me" Module. Uncheck this box to be able to specify your full name and e-mail.
km: ធីកប្រអប់នេះដើម្បីប្រើការកំណត់អ៊ីមែលធំទូលាយរបស់ KDE ដែលត្រូវបានកំណត់ដោយប្រើប្រព័ន្ធកំណត់ "About ម៉ូឌុល Me" ។ ដោះធីកប្រអប់នេះដើម្បីអាចបញ្ជាក់ឈ្មោះពេញនិងអ៊ីមែលរបស់អ្នក។

source: Default appointment time
km: ពេលវេលាណាត់ជួបលំនាំដើម

source: Enter the default time for events here. The default is used if you do not supply a start time.
km: បញ្ចូលពេលវេលាលំនាំដើមសម្រាប់ព្រឹត្តិការណ៍នៅទីនេះ។ លំនាំដើមត្រូវបានប្រើប្រសិនបើអ្នកមិនផ្តល់ពេលវេលាចាប់ផ្តើម។

source: Default duration of new appointment (HH:MM)
km: ថិរវេលាលំនាំដើមនៃការណាត់ជួបថ្មី (HH​ ៖ MM)

source: Enter default duration for events here. The default is used if you do not supply an end time.
km: បញ្ចូលថិរវេលាលំនាំដើមសម្រាប់ព្រឹត្តិការណ៍នៅទីនេះ។ លំនាំដើមត្រូវបានប្រើប្រសិនបើអ្នកមិនផ្គត់ផ្គង់ពេលវេលាបញ្ចប់។

source: Enable a default sound file for audio reminders
km: បើកដំណើរការឯកសារសម្លេងលំនាំដើមសម្រាប់កម្មវិធីរំលឹកសម្លេង

source: Check this box if you want to enable the specified file to be used as the default sound file for new reminders. You can always specify another file in the Reminder configuration accessible from the Event or To-do editors.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់ឱ្យឯកសារដែលបានបញ្ជាក់ត្រូវបានប្រើជាឯកសារសំឡេងលំនាំដើមសម្រាប់ការរំលឹកថ្មី។ អ្នកតែងតែអាចបញ្ជាក់ឯកសារផ្សេងទៀតនៅក្នុងការកំណត់រចនាសម្ព័ន្ធកម្មវិធីរំលឹកដែលអាចចូលដំណើរការបានពីកម្មវិធីនិពន្ធព្រឹត្តិការណ៍ឬការងារត្រូវធ្វើ។

source: Default audio file
km: ឯកសារអូឌីយ៉ូលំនាំដើម

source: Set a file to be used as the default sound file for new reminders. You can always specify another file in the Reminder configuration accessible from the Event or To-do editors.
km: កំណត់ឯកសារដែលត្រូវប្រើជាឯកសារសំឡេងលំនាំដើមសម្រាប់កម្មវិធីរំលឹកថ្មី។ អ្នកតែងតែអាចបញ្ជាក់ឯកសារផ្សេងទៀតនៅក្នុងការកំណត់រចនាសម្ព័ន្ធកម្មវិធីរំលឹកដែលអាចចូលដំណើរការបានពីកម្មវិធីនិពន្ធព្រឹត្តិការណ៍ឬការងារត្រូវធ្វើ។

source: Enable reminders for new Events
km: បើកដំណើរការកម្មវិធីរំលឹកសម្រាប់ព្រឹត្តិការណ៍ថ្មីៗ

source: Check this box if you want to enable reminders for all newly created Events. You can always turn-off the reminders in the Event editor dialog.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់បើកដំណើរការកម្មវិធីរំលឹកសម្រាប់ព្រឹត្តិការណ៍ដែលបានបង្កើតថ្មីៗ។ អ្នកតែងតែអាចបិទកម្មវិធីរំលឹកនៅក្នុងប្រអប់កម្មវិធីនិពន្ធព្រឹត្តិការណ៍។

source: By default, enable reminders for new events
km: តាមលំនាំដើមបើកការរំលឹកសម្រាប់ព្រឹត្តិការណ៍ថ្មីៗ

source: Enable reminders for new To-dos
km: បើកដំណើរការកម្មវិធីរំលឹកសម្រាប់ការងារត្រូវធ្វើថ្មី

source: Check this box if you want to enable reminders for all newly created To-dos. You can always turn-off the reminders in the To-do editor dialog.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់បើកដំណើរការកម្មវិធីរំលឹកសម្រាប់ការងារត្រូវធ្វើដែលបានបង្កើតថ្មី។ អ្នកតែងតែអាចបិទកម្មវិធីរំលឹកនៅក្នុងប្រអប់កម្មវិធីនិពន្ធត្រូវធ្វើ។

source: By default, enable reminders for new to-dos
km: តាមលំនាំដើមបើកការរំលឹកសម្រាប់ការងារត្រូវធ្វើថ្មី

source: Default reminder time
km: ពេលវេលារំaultកលំនាំដើម

source: Enter the default reminder time for all newly created items. The time unit is specified in the adjacent combobox.
km: បញ្ចូលពេលវេលារំលឹកលំនាំដើមសម្រាប់ធាតុដែលបានបង្កើតថ្មី។ ឯកតាពេលវេលាត្រូវបានបញ្ជាក់នៅក្នុងប្រអប់បន្សំនៅជាប់គ្នា។

source: Default time for reminders
km: ពេលវេលាលំនាំដើមសម្រាប់ការរំលឹក

source: Enter the default reminder time units for all newly created items. The time is specified in the adjacent spinbox.
km: បញ្ចូលឯកតាពេលវេលារំdefaultកលំនាំដើមសម្រាប់ធាតុដែលបានបង្កើតថ្មី។ ពេលវេលាត្រូវបានបញ្ជាក់នៅក្នុងប្រអប់វិលដែលនៅជាប់គ្នា។

source: Default time unit for reminders
km: ឯកតាពេលវេលាលំនាំដើមសម្រាប់កម្មវិធីរំលឹក

source: Day begins at
km: ថ្ងៃចាប់ផ្តើមនៅ

source: Enter the start time for events here. This time should be the earliest time that you use for events.
km: បញ្ចូលពេលវេលាចាប់ផ្តើមសម្រាប់ព្រឹត្តិការណ៍នៅទីនេះ។ ពេលវេលានេះគួរតែជាពេលវេលាដំបូងបំផុតដែលអ្នកប្រើសម្រាប់ព្រឹត្តិការណ៍។

source: Exclude holidays
km: មិនរាប់បញ្ចូលថ្ងៃឈប់សម្រាក

source: Check this box to prevent KOrganizer from marking the working hours on holidays.
km: ធីកប្រអប់នេះដើម្បីការពារ KOrganizer ពីការសម្គាល់ម៉ោងធ្វើការនៅថ្ងៃឈប់សម្រាក &&amp; K; ។

source: Use holiday regions:
km: ប្រើតំបន់ថ្ងៃឈប់សម្រាក៖

source: Select which regions you want to use the holidays here. Defined holidays are shown as non-working days in the date navigator, the agenda view, etc.
km: ជ្រើសរើសតំបន់ណាមួយដែលអ្នកចង់ប្រើថ្ងៃឈប់សម្រាកនៅទីនេះ។ ថ្ងៃឈប់សម្រាកដែលបានកំណត់ត្រូវបានបង្ហាញជាថ្ងៃមិនធ្វើការនៅក្នុងកម្មវិធីរុករកកាលបរិច្ឆេទមើលរបៀបវារៈ។ ល។

source: Use Groupware communication
km: ប្រើការទំនាក់ទំនងជាក្រុម

source: Check this box to enable automatic generation of mails when creating, updating or deleting events (or to-dos) involving other attendees. You should check this box if you want to use the groupware functionality (e.g. Configuring Kontact as a KDE Kolab client).
km: ធីកប្រអប់នេះដើម្បីបើកអ៊ីមែលជំនាន់ដោយស្វ័យប្រវត្តិនៅពេលបង្កើតធ្វើបច្ចុប្បន្នភាពឬលុបព្រឹត្តិការណ៍ (ឬការងារត្រូវធ្វើ) ដែលពាក់ព័ន្ធនឹងអ្នកចូលរួមផ្សេងទៀត។ អ្នកគួរតែធីកប្រអប់នេះប្រសិនបើអ្នកចង់ប្រើមុខងារដាក់ជាក្រុម (ឧ។ កំណត់រចនាសម្ព័ន្ធ Kontact ជាម៉ាស៊ីនភ្ញៀវរបស់ Kolab របស់ KDE) ។

source: Default policy for invitations to other users:
km: គោលនយោបាយលំនាំដើមសម្រាប់ការអញ្ជើញដល់អ្នកប្រើប្រាស់ដទៃទៀត៖

source: Send mails without asking.
km: ផ្ញើអ៊ីមែលដោយមិនចាំបាច់សួរ។

source: Ask for every individual attendee what to do.
km: ស្នើសុំឱ្យអ្នកចូលរួមម្នាក់ៗត្រូវធ្វើអ្វី។

source: Do not send invitation emails at all (this can break group scheduling for iTip compliant clients).
km: កុំផ្ញើអ៊ីម៉ែលអញ្ជើញទាល់តែសោះ (វាអាចធ្វើឱ្យខូចកាលវិភាគក្រុមសម្រាប់អតិថិជនអាយធីអាយភី) ។

source: Show timezone selectors in the event and todo editor dialog.
km: បង្ហាញកម្មវិធីជ្រើសរើសតំបន់ពេលវេលានៅក្នុងប្រអប់កម្មវិធីនិពន្ធនិងការងារត្រូវធ្វើ។

source: Regularly archive events
km: ព្រឹត្តិការណ៍ប័ណ្ណសារជាទៀងទាត់

source: If auto-archiving is enabled, events older than this amount will be archived. The unit of this value is specified in another field.
km: ប្រសិនបើប័ណ្ណសារត្រូវបានបើកដំណើរការព្រឹត្តិការណ៍ចាស់ជាងចំនួននេះនឹងត្រូវទុកក្នុងប័ណ្ណសារ។ ឯកតានៃតម្លៃនេះត្រូវបានបញ្ជាក់នៅក្នុងវាលផ្សេងទៀត។

source: The unit in which the expiry time is expressed.
km: ឯកតាដែលពេលវេលាផុតកំណត់ត្រូវបានបង្ហាញ។

source: In days
km: នៅក្នុងថ្ងៃ

source: In weeks
km: ក្នុងប៉ុន្មានសប្តាហ៍

source: In months
km: ក្នុងប៉ុន្មានខែ

source: URL of the file where old events should be archived
km: URL នៃឯកសារដែលព្រឹត្តិការណ៍ចាស់គួរតែត្រូវបានទុកក្នុងប័ណ្ណសារ

source: Archive events
km: ព្រឹត្តិការណ៍ប័ណ្ណសារ

source: Archive to-dos
km: ប័ណ្ណសារត្រូវធ្វើការងារត្រូវធ្វើ

source: What to do when archiving
km: អ្វីដែលត្រូវធ្វើនៅពេលធ្វើប័ណ្ណសារ

source: Delete old events
km: លុបព្រឹត្តិការណ៍ចាស់

source: Archive old events to a separate file
km: ទុកព្រឹត្តិការណ៍ចាស់ៗទុកក្នុងឯកសារដាច់ដោយឡែក

source: Full &name
km: ឈ្មោះ​ពេញ

source: Enter your full name here. This name will be displayed as "Organizer" in to-dos and events you create.
km: បញ្ចូលឈ្មោះពេញរបស់អ្នកនៅទីនេះ។ ឈ្មោះនេះនឹងត្រូវបានបង្ហាញជា "Organizer" ក្នុងការងារត្រូវធ្វើនិងព្រឹត្តិការណ៍ដែលអ្នកបង្កើត។

source: Anonymous
km: អនាមិក

source: E&mail address
km: អាស័យ​ដ្ឋាន​អ៊ី​ម៉េ​ល

source: Enter here your e-mail address. This e-mail address will be used to identify the owner of the calendar, and displayed in events and to-dos you create.
km: បញ្ចូលអាសយដ្ឋានអ៊ីមែលរបស់អ្នកនៅទីនេះ។ អាសយដ្ឋានអ៊ីមែលនេះនឹងត្រូវបានប្រើដើម្បីកំណត់អត្តសញ្ញាណម្ចាស់ប្រតិទិននិងបង្ហាញនៅក្នុងព្រឹត្តិការណ៍និងការងារត្រូវធ្វើដែលអ្នកបង្កើត។

source: nobody@nowhere
km: គ្មាន @ កន្លែងណាទេ

source: "No category" color (for "Only category" drawing schemes)
km: ពណ៌បែបផែន " គ្មានប្រភេទ" (សម្រាប់ប្រភេទគំនូរ "Only category")

source: Select a color to use for the "no category" or "unset category" situation, when an item does not belong to any category. This color is used when drawing items in the agenda or month views using the "Only category" scheme.
km: ជ្រើសរើសពណ៌ដើម្បីប្រើសម្រាប់ស្ថានភាព "no category" ឬ "unset category" នៅពេលដែលធាតុមិនមែនជាកម្មសិទ្ធិរបស់ប្រភេទណាមួយ។ ពណ៌នេះត្រូវបានប្រើនៅពេលគូរធាតុក្នុងរបៀបវារៈឬទិដ្ឋភាពខែដោយប្រើគ្រោងការណ៍ "Only category" ។

source: Use this color when drawing items without a category
km: ប្រើពណ៌នេះនៅពេលគូរធាតុដោយគ្មានប្រភេទ

# @option today
source: &Today
km: ថ្ងៃនេះ

# @option tomorrow
source: To&morrow
km: ថ្ងៃស្អែក

# @option next week
source: Next &Week
km: ស​ប្តា​ហ៍​ក្រោយ

# @option next month
source: Next M&onth
km: ខែក្រោយ

# @option do not specify a date
source: No Date
km: គ្មានកាលបរិច្ឆេទ

# @title:window
source: Create Note
km: បង្កើតកំណត់ចំណាំ

# @action:button
source: Cancel
km: បោះបង់

# @action:button
source: Save
km: រក្សាទុក

# @info:tooltip
source: Calendar where the new note will be stored.
km: ប្រតិទិនដែលចំណាំថ្មីនឹងត្រូវរក្សាទុក។

# @label specify the title for this note
source: Title:
km: ចំណងជើង៖

# @label specify the text for this note
source: Text:
km: អត្ថបទ៖

source: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Print day options:</span></p></body></html>
km: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> ទំ, លី {ស - ដកឃ្លា៖ រុំមុន; } </style></head><body style=" font-family​ ៖'Sans Serif'; font-size​ ៖9pt; font-weight​ ៖400; font-style​ ៖normal;"> <p style=" margin-top​ ៖0px; margin-bottom​ ៖0px; margin-left​ ៖0px; margin-right​ ៖0px; -qt-block-indent​ ៖0; text-indent​ ៖0px;"><span style=" font-weight​ ៖600;"> ជម្រើសថ្ងៃបោះពុម្ព៖ </span></p></body></html>

source: Date && Time Range
km: ជួរពេលវេលាកាលបរិច្ឆេទ

source: If you want to print more days at once, you can define a range of dates with this option and the <i>End date</i> option. This option is used to define the start date.
km: ប្រសិនបើអ្នកចង់បោះពុម្ពថ្ងៃបន្ថែមទៀតក្នុងពេលតែមួយអ្នកអាចកំណត់ជួរកាលបរិច្ឆេទជាមួយនឹងជម្រើសនេះនិងលេខកូដ <i> កាលបរិច្ឆេទបញ្ចប់ </i> ជម្រើស។ ជម្រើសនេះត្រូវបានប្រើដើម្បីកំណត់កាលបរិច្ឆេទចាប់ផ្តើម។

source: &Start date:
km: ថ្ងៃ​ចាប់ផ្តើម​ ៖

source: It is possible to print only those events which are inside a given timerange. With this time selection box you can define the start of this time range. The end time should be defined with the <i>End time</i> option. Note you can automatically modify these settings if you check <i>Extend time range to include all events</i>.
km: អ្នកអាចបោះពុម្ពបានតែព្រឹត្តិការណ៍ទាំងនោះដែលមាននៅក្នុងពេលវេលាកំណត់មួយ។ ជាមួយនឹងប្រអប់ជ្រើសរើសពេលវេលានេះអ្នកអាចកំណត់ការចាប់ផ្តើមនៃជួរពេលវេលានេះ។ ពេលវេលាបញ្ចប់គួរតែត្រូវបានកំណត់ជាមួយឯកសារ <i> ពេលវេលាបញ្ចប់ </i> ជម្រើស។ ចំណាំអ្នកអាចកែប្រែការកំណត់ទាំងនេះដោយស្វ័យប្រវត្តិប្រសិនបើអ្នកពិនិត្យ <i> ពង្រីកជួរពេលវេលាដើម្បីរួមបញ្ចូលព្រឹត្តិការណ៍ទាំងអស់ </i>

source: Start &time:
km: ពេលវេលាចាប់ផ្តើម៖

source: hh:mm
km: hh​ ៖ ម

source: If you want to print more days at once, you can define a range of dates with this option and the <i>Start date</i> option. This option is used to define the end date.
km: ប្រសិនបើអ្នកចង់បោះពុម្ពថ្ងៃបន្ថែមទៀតក្នុងពេលតែមួយអ្នកអាចកំណត់ជួរកាលបរិច្ឆេទជាមួយនឹងជម្រើសនេះនិងលេខកូដ <i> ថ្ងៃ​ចាប់ផ្តើម </i> ជម្រើស។ ជម្រើសនេះត្រូវបានប្រើដើម្បីកំណត់កាលបរិច្ឆេទបញ្ចប់។

source: &End date:
km: កាលបរិច្ឆេទបញ្ចប់៖

source: It is possible to print only those events which are inside a given timerange. With this time selection box you can define the end of this time range. The start time should be defined with the <i>Start time</i> option. Note you can automatically modify these settings if you check <i>Extend time range to include all events</i>.
km: អ្នកអាចបោះពុម្ពបានតែព្រឹត្តិការណ៍ទាំងនោះដែលមាននៅក្នុងពេលវេលាកំណត់មួយ។ ជាមួយប្រអប់ជ្រើសរើសពេលវេលានេះអ្នកអាចកំណត់ចុងបញ្ចប់នៃចន្លោះពេលវេលានេះ។ ពេលវេលាចាប់ផ្តើមគួរតែត្រូវបានកំណត់ដោយឯកសារ <i> ពេលវេលាចាប់ផ្តើម </i> ជម្រើស។ ចំណាំអ្នកអាចកែប្រែការកំណត់ទាំងនេះដោយស្វ័យប្រវត្តិប្រសិនបើអ្នកពិនិត្យ <i> ពង្រីកជួរពេលវេលាដើម្បីរួមបញ្ចូលព្រឹត្តិការណ៍ទាំងអស់ </i>

source: End ti&me:
km: ពេលវេលាបញ្ចប់៖

source: Check this option to automatically determine the required time range, so all events will be shown.
km: ធីកជម្រើសនេះដើម្បីកំណត់ជួរពេលវេលាដែលត្រូវការដោយស្វ័យប្រវត្តិដូច្នេះព្រឹត្តិការណ៍ទាំងអស់នឹងត្រូវបានបង្ហាញ។

source: E&xtend time range to include all events
km: ពង្រីកជួរពេលវេលាដើម្បីរួមបញ្ចូលព្រឹត្តិការណ៍ទាំងអស់

source: Print Layout
km: ប្លង់បោះពុម្ព

source: The Filofax format prints the information for the days selected without a timeline.
km: ទ្រង់ទ្រាយ Filofax បោះពុម្ពព័ត៌មានសម្រាប់ថ្ងៃដែលបានជ្រើសរើសដោយគ្មានការកំណត់ពេលវេលា។

source: Print date &range as Filofax format, all on one page
km: បោះពុម្ពជួរកាលបរិច្ឆេទជាទ្រង់ទ្រាយ Filofax ទាំងអស់នៅលើមួយទំព័រ

source: The timetable print view has the times to the left of the page
km: ការមើលតារាងពេលវេលាមានពេលវេលានៅខាងឆ្វេងទំព័រ

source: Print as timeta&ble view, one page per day
km: ព្រីនជាទិដ្ឋភាពកំណត់ពេលវេលាមួយទំព័រក្នុងមួយថ្ងៃ

source: The timetable print view has the times to the left of the page, all days are printed as columns in one big timetable.
km: ការមើលតារាងពេលវេលាមានពេលវេលានៅខាងឆ្វេងទំព័រទាំងអស់ថ្ងៃត្រូវបានបោះពុម្ពជាជួរឈរក្នុងតារាងពេលវេលាធំមួយ។

source: Print as timetable view, all da&ys on a single page
km: ព្រីនជាទិដ្ឋិភាពកំណត់ពេលវេលាពេញមួយថ្ងៃនៅលើទំព័រតែមួយ

source: Security Exclusions
km: ការលើកលែងសុវត្ថិភាព

source: Check this option to exclude confidential events.
km: ធីកជម្រើសនេះដើម្បីមិនរាប់បញ្ចូលព្រឹត្តិការណ៍សំងាត់។

source: Exclude c&onfidential
km: មិនរាប់បញ្ចូលការសម្ងាត់

source: Check this option to exclude private events
km: ធីកជម្រើសនេះដើម្បីមិនរាប់បញ្ចូលព្រឹត្តិការណ៍ឯកជន

source: Exclude pri&vate
km: មិនរាប់បញ្ចូលឯកជន

source: Include Information
km: រួមបញ្ចូលព័ត៌មាន

source: You should check this option if you want to print to-dos which are due on one of the dates which are in the supplied date range.
km: អ្នកគួរតែពិនិត្យជម្រើសនេះប្រសិនបើអ្នកចង់បោះពុម្ពការងារត្រូវធ្វើដែលត្រូវនឹងកាលបរិច្ឆេទមួយដែលមាននៅក្នុងចន្លោះកាលបរិច្ឆេទដែលបានផ្គត់ផ្គង់។

source: Include to-&dos that are due on the printed day(s)
km: រាប់បញ្ចូលការងារត្រូវធ្វើដែលត្រូវដល់ថ្ងៃបោះពុម្ភ

source: Check this option to exclude the time in description box
km: ធីកជម្រើសនេះដើម្បីមិនរាប់បញ្ចូលពេលវេលានៅក្នុងប្រអប់ពិពណ៌នា

source: Exclude t&ime from timetable detail display items
km: មិនរាប់បញ្ចូលពេលវេលាពីធាតុបង្ហាញលំអិតដែលបានកំណត់ពេលវេលា

source: Print item descriptions
km: បោះពុម្ពការពិពណ៌នាធាតុ

source: Check this option if you want to see the item descriptions printed.
km: ធីកជម្រើសនេះប្រសិនបើអ្នកចង់ឃើញការពិពណ៌នាធាតុត្រូវបានបោះពុម្ព។

source: Include &descriptions
km: រួមបញ្ចូលការពិពណ៌នា
