Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/calendarsupport/calendarsupport.po
Languages: km

# not blocking any reminder types for this calendar
source: none
km: គ្មាន

source: Blocked Reminders:
km: កម្មវិធីរំលឹកដែលបានរារាំង៖
