Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/calendarsupport/calendarsupport.po
Languages: km

source: Print items on one line
km: បោះពុម្ពធាតុនៅលើបន្ទាត់តែមួយ

source: Check this option to limit events to a single line, truncating as necessary to save space.
km: ធីកជម្រើសនេះដើម្បីកំណត់ព្រឹត្តិការណ៍ទៅជាខ្សែតែមួយកាត់ជាចាំបាច់ដើម្បីសន្សំទំហំផ្ទុក។

source: Limit events in each day to a &single line
km: កំណត់ព្រឹត្តិការណ៍ក្នុងមួយថ្ងៃទៅបន្ទាត់តែមួយ

source: Check this option to draw note lines
km: ធីកជម្រើសនេះដើម្បីគូរបន្ទាត់ចំណាំ

source: Show note &lines
km: បង្ហាញបន្ទាត់ចំណាំ

source: Print a datetime footer on each page
km: បោះពុម្ពបាតកថាពេលនៅលើទំព័រនីមួយៗ

source: Check this box if you want to print a small footer on each page that contains the date of the print.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់បោះពុម្ពបាតកថាតូចនៅលើទំព័រនីមួយៗដែលមានកាលបរិច្ឆេទនៃការបោះពុម្ព។

source: Print &Footer
km: បោះពុម្ពបាតកថា

source: Print in color
km: បោះពុម្ពជាពណ៌

source: If you want to use colors to distinguish certain categories on the print, check this option.
km: ប្រសិនបើអ្នកចង់ប្រើពណ៌ដើម្បីបែងចែកប្រភេទជាក់លាក់នៅលើបោះពុម្ពធីកជម្រើសនេះ។

source: &Use colors
km: ប្រើពណ៌

source: Start date:
km: ថ្ងៃ​ចាប់ផ្តើម​ ៖

source: No start date
km: គ្មានកាលបរិច្ឆេទចាប់ផ្តើម

source: End date:
km: កាលបរិច្ឆេទបញ្ចប់៖

source: Duration:
km: រយៈពេល៖

source: 1 hour
km: 1 ម៉ោង

source: 1 minute
km: 1 នាទី

source: No end date
km: គ្មានកាលបរិច្ឆេទបញ្ចប់ទេ

source: Due date:
km: កាលបរិច្ឆេទ​កំណត់​ ៖

source: No due date
km: គ្មានកាលបរិច្ឆេទកំណត់

# except for listed dates
source: except
km: លើកលែងតែ

source: Repeats:
km: ធ្វើឡើងវិញ៖

source: No reminders
km: គ្មានការរំ.ក

source: Reminder:
km: ការ​រំលឹក​ ៖

# N days/hours/minutes before/after the start/end
source: %1 before the start
km: %1 មុនពេលចាប់ផ្តើម

# N days/hours/minutes before/after the start/end
source: %1 after the start
km: %1 បន្ទាប់ពីចាប់ផ្តើម

# N days/hours/minutes before/after the start/end
source: %1 before the end
km: %1 មុនចប់

# N days/hours/minutes before/after the start/end
source: %1 after the end
km: %1 បន្ទាប់ពីចប់

source: 1 day
km: ១ ថ្ងៃ

source: 1 hour
km: 1 ម៉ោង

source: 1 minute
km: 1 នាទី

source: Organizer:
km: អ្នករៀបចំ៖

source: Location:
km: ទីតាំង៖

source: Description:
km: ការពិពណ៌នាសង្ខេប​ ៖

source: Notes:
km: កំណត់សំគាល់ៈ

source: No Subitems
km: មិនមានធាតុរង

source: 1 Subitem:
km: ១ ចំណងជើងរង៖

# subitem start date
source: Start Date: %1
km: កាលបរិច្ឆេទចាប់ផ្តើម៖ %1

# subitem start time
source: Start Time: %1
km: ពេលវេលាចាប់ផ្តើម៖ %1

# subitem due date
source: Due Date: %1
km: កាលបរិច្ឆេទដល់កំណត់៖ %1

# subitem due time
source: Due Time: %1
km: ពេលវេលាដល់កំណត់៖ %1

# subitem Status: statusString
source: Status: %1
km: ស្ថានភាព៖ %1

# subitem Priority: N
source: Priority: %1
km: អាទិភាព៖ %1

# subitem Secrecy: secrecyString
source: Secrecy: %1
km: អាថ៌កំបាំង​ ៖ %1

source: No Attachments
km: គ្មានឯកសារភ្ជាប់

source: 1 Attachment:
km: ឯកសារភ្ជាប់ ១៖

source: No Attendees
km: គ្មានអ្នកចូលរួម

source: 1 Attendee:
km: អ្នកចូលរួម ១ នាក់ ៖

source: Status: %1
km: ស្ថានភាព​ ៖ %1

source: Secrecy: %1
km: អាថ៌កំបាំង​ ៖ %1

source: Show as: Busy
km: បង្ហាញដូចជាៈរវល់

source: Show as: Free
km: បង្ហាញជា៖ ឥតគិតថ្លៃ

source: This task is overdue!
km: កិច្ចការនេះហួសពេលហើយ!

source: Settings:
km: ការកំណត់៖

source: Categories:
km: ប្រភេទ​ ៖

source: Today's Events
km: ព្រឹត្តិការណ៍ថ្ងៃនេះ

# date from - to (week number)
source: %1 - %2 (Week %3)
km: %1 - %2 (សប្តាហ៍ %3)

# date from - to (week number)
source: %1 - %2 (Week %3)
km: %1 - %2 (សប្តាហ៍ %3)

# @option sort by start date/time
source: Start Date
km: ថ្ងៃ​ចាប់ផ្តើម

# @option sort by due date/time
source: Due Date
km: កាលបរិច្ឆេទ​កំណត់

# @option sort by percent completed
source: Percent Complete
km: ភាគរយបានបញ្ចប់

# @option sort in increasing order
source: Ascending
km: ឡើង

# @option sort in descreasing order
source: Descending
km: ចុះ

source: To-do list
km: បញ្ជីការងារត្រូវធ្វើ

source: Priority
km: អាទិភាព

# @label to-do summary
source: Title
km: ចំណងជើង

# @label to-do percentage complete
source: Complete
km: បញ្ចប់

# @label to-do due date
source: Due
km: ដោយសារ

source: Print &incidence
km: ឧប្បត្តិហេតុបោះពុម្ព

source: Prints an incidence on one page
km: បោះពុម្ពឧប្បត្តិហេតុនៅលើទំព័រមួយ

source: Print da&y
km: បោះពុម្ពថ្ងៃ

source: Prints all events of a single day on one page
km: បោះពុម្ពព្រឹត្តិការណ៍ទាំងអស់នៃថ្ងៃតែមួយនៅលើទំព័រមួយ

source: Print &week
km: បោះពុម្ពសប្តាហ៍

source: Prints all events of one week on one page
km: បោះពុម្ពព្រឹត្តិការណ៍ទាំងអស់នៃមួយសប្តាហ៍នៅលើទំព័រមួយ

source: Print mont&h
km: បោះពុម្ពខែ

source: Prints all events of one month on one page
km: បោះពុម្ពព្រឹត្តិការណ៍ទាំងអស់នៃខែមួយនៅលើទំព័រមួយ

source: Print to-&dos
km: បោះពុម្ពការងារត្រូវធ្វើ

source: Prints all to-dos in a (tree-like) list
km: បោះពុម្ពការងារត្រូវធ្វើទាំងអស់នៅក្នុងបញ្ជី (ដូចមែកធាង)

# @info
source: Unable to print, an invalid print style was specified.
km: មិនអាចបោះពុម្ពបានទេរចនាប័ទ្មបោះពុម្ពមិនត្រឹមត្រូវត្រូវបានបញ្ជាក់។

# @title:window
source: Printing error
km: កំហុសក្នុងការបោះពុម្ព

# @title:window
source: Print
km: បោះពុម្ព

# @title:group
source: Print Style
km: ស្ទីលបោះពុម្ព

# @label
source: Page &orientation:
km: ការតំរង់ទិសទំព័រ៖

# @info:tooltip
source: Set the print orientation
km: កំណត់ទិសបោះពុម្ព

# @info:whatsthis
source: Choose if you want your output to be printed in "portrait" or "landscape". You can also default to the orientation best suited to the selected style or to your printer's default setting.
km: ជ្រើសរើសប្រសិនបើអ្នកចង់បោះពុម្ពលទ្ធផលជា "portrait" ឬ "landscape" ។ អ្នកក៏អាចកំណត់ទិសដៅដែលសមស្របបំផុតទៅនឹងរចនាប័ទ្មដែលបានជ្រើសរើសឬការកំណត់លំនាំដើមរបស់ម៉ាស៊ីនបោះពុម្ពរបស់អ្នក។

# @item:inlistbox
source: Use Default Orientation of Selected Style
km: ប្រើការតំរង់ទិសលំនាំដើមនៃរចនាប័ទ្មដែលបានជ្រើសរើស

# @item:inlistbox
source: Use Printer Default
km: ប្រើលំនាំព្រីនធ័រ

# @item:inlistbox
source: Portrait
km: បញ្ឈរ

# @item:inlistbox
source: Landscape
km: ទេសភាព

# @info:tooltip
source: Select the type of print
km: ជ្រើសរើសប្រភេទនៃការបោះពុម្ព

# @info:whatsthis
source: Select one of the following types of prints you want to make. You may want to print an individual item, or all the items for a specific time range (like a day, week or month), or you may want to print your to-do list.
km: ជ្រើសរើសព្រីនមួយក្នុងចំណោមប្រភេទខាងក្រោមដែលអ្នកចង់ធ្វើ។ អ្នកប្រហែលជាចង់បោះពុម្ពធាតុនីមួយៗឬធាតុទាំងអស់សម្រាប់ចន្លោះពេលវេលាជាក់លាក់មួយ (ដូចជាថ្ងៃមួយសប្តាហ៍ឬខែ) ឬអ្នកប្រហែលជាចង់បោះពុម្ពបញ្ជីការងារត្រូវធ្វើ។

# @action:button
source: &Preview
km: មើលជាមុន

source: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Print incidence options:</span></p></body></html>
km: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> ទំ, លី {ស - ដកឃ្លា៖ រុំមុន; } </style></head><body style=" font-family​ ៖'Sans Serif'; font-size​ ៖9pt; font-weight​ ៖400; font-style​ ៖normal;"> <p style=" margin-top​ ៖0px; margin-bottom​ ៖0px; margin-left​ ៖0px; margin-right​ ៖0px; -qt-block-indent​ ៖0; text-indent​ ៖0px;"><span style=" font-weight​ ៖600;"> ជម្រើសបោះពុម្ពព្រិត្តិការណ៍៖ </span></p></body></html>

source: Print incidence details
km: បោះពុម្ពព័ត៌មានលំអិតអំពីឧប្បត្តិហេតុ

source: Check this box if you want to print more details for the incidence, including the visibility and secrecy properties.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់បោះពុម្ពព័ត៌មានលម្អិតបន្ថែមសម្រាប់ឧប្បត្តិហេតុរួមទាំងភាពមើលឃើញនិងលក្ខណៈសំងាត់។

source: Detai&ls (visiblility, secrecy, etc.)
km: ព័ត៌មានលម្អិត (ភាពមើលឃើញភាពសម្ងាត់។ ល។ )

source: Print the attendees
km: បោះពុម្ពអ្នកចូលរួម

source: Check this box if you want the attendees list included on the print-out.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់អោយបញ្ជីឈ្មោះអ្នកចូលរួមដែលមានបញ្ចូលនៅលើការបោះពុម្ព។

source: &Attendees
km: អ្នកចូលរួម

source: Print the notes
km: បោះពុម្ពកំណត់ចំណាំ

source: Check this box if you want the incidence notes included on the print-out.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់បានកំណត់ត្រាឧប្បត្តិហេតុដែលបានរួមបញ្ចូលនៅលើការបោះពុម្ព។

source: &Notes, subitems
km: កំណត់ចំណាំ, ធាតុរង

source: Print the attachments
km: បោះពុម្ពឯកសារភ្ជាប់

source: Check this box if you want the attachment information included on the print-out. The attachments themselves are not printed.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់បានព័ត៌មានឯកសារភ្ជាប់ដែលបានបញ្ចូលក្នុងការបោះពុម្ព។ ឯកសារភ្ជាប់ដោយខ្លួនឯងមិនត្រូវបានបោះពុម្ពទេ។

source: Attach&ments
km: ឯកសារភ្ជាប់

source: Draw note lines in empty area
km: គូរបន្ទាត់ចំណាំនៅក្នុងកន្លែងទំនេរ

source: Check this box if you want to draw note lines in the empty area of the print. This is useful if you want to hand-write notes on this print-out.
km: ធីកប្រអប់នេះប្រសិនបើអ្នកចង់គូសបន្ទាត់បន្ទាត់នៅត្រង់កន្លែងទទេនៃការបោះពុម្ព។ វាមានប្រយោជន៍ប្រសិនបើអ្នកចង់សរសេរកំណត់ចំណាំដោយដៃនៅលើការបោះពុម្ពនេះ។

source: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Print journal options:</span></p></body></html>
km: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> ទំ, លី {ស - ដកឃ្លា៖ រុំមុន; } </style></head><body style=" font-family​ ៖'Sans Serif'; font-size​ ៖9pt; font-weight​ ៖400; font-style​ ៖normal;"> <p style=" margin-top​ ៖0px; margin-bottom​ ៖0px; margin-left​ ៖0px; margin-right​ ៖0px; -qt-block-indent​ ៖0; text-indent​ ៖0px;"><span style=" font-weight​ ៖600;"> ជម្រើសបោះពុម្ពទិនានុប្បវត្តិ៖ </span></p></body></html>

source: &All journal entries
km: រាល់ទិនានុប្បវត្តិទិនានុប្បវត្តិ

source: Date &range:
km: ចន្លោះកាលបរិច្ឆេទ៖

source: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Print month options:</span></p></body></html>
km: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> ទំ, លី {ស - ដកឃ្លា៖ រុំមុន; } </style></head><body style=" font-family​ ៖'Sans Serif'; font-size​ ៖9pt; font-weight​ ៖400; font-style​ ៖normal;"> <p style=" margin-top​ ៖0px; margin-bottom​ ៖0px; margin-left​ ៖0px; margin-right​ ៖0px; -qt-block-indent​ ៖0; text-indent​ ៖0px;"><span style=" font-weight​ ៖600;"> បោះពុម្ពជម្រើសខែ៖ </span></p></body></html>

source: When you want to print more months at once, you can define a month range. This option defines the first month to be printed. Use the option <i>End month</i> to define the last month in this range.
km: នៅពេលអ្នកចង់បោះពុម្ពច្រើនខែក្នុងពេលតែមួយអ្នកអាចកំណត់ជួរខែ។ ជម្រើសនេះកំណត់ខែដំបូងដែលត្រូវបោះពុម្ព។ ប្រើជម្រើស <i> ខែបញ្ចប់ </i> ដើម្បីកំណត់ខែចុងក្រោយនៅក្នុងជួរនេះ។

source: Sta&rt month:
km: ខែចាប់ផ្តើម៖

source: Starting month for printing
km: ខែចាប់ផ្តើមសម្រាប់ការបោះពុម្ព

source: Starting year for printing
km: ឆ្នាំចាប់ផ្តើមសម្រាប់ការបោះពុម្ព

source: When you want to print more years at once, you can define a year range. This option defines the first year to be printed. Use the option <i>End year</i> to define the last year in this range.
km: នៅពេលអ្នកចង់បោះពុម្ពច្រើនឆ្នាំក្នុងពេលតែមួយអ្នកអាចកំណត់ជួរមួយឆ្នាំ។ ជម្រើសនេះកំណត់ឆ្នាំដំបូងដែលត្រូវបោះពុម្ព។ ប្រើជម្រើស <i> ឆ្នាំបញ្ចប់ </i> ដើម្បីកំណត់ឆ្នាំចុងក្រោយនៅក្នុងជួរនេះ។

source: When you want to print more months at once, you can define a month range. This option defines the last month to be printed. Use the option <i>Start month</i> to define the first month in this range.
km: នៅពេលអ្នកចង់បោះពុម្ពច្រើនខែក្នុងពេលតែមួយអ្នកអាចកំណត់ជួរខែ។ ជម្រើសនេះកំណត់ខែចុងក្រោយដែលត្រូវបោះពុម្ព។ ប្រើជម្រើស <i> ខែចាប់ផ្តើម </i> ដើម្បីកំណត់ខែដំបូងក្នុងជួរនេះ។

source: &End month:
km: ខែបញ្ចប់៖

source: Ending month for the print
km: បញ្ចប់ខែសម្រាប់ការបោះពុម្ព

source: Ending year for the print
km: បញ្ចប់ឆ្នាំសម្រាប់ការបោះពុម្ព

source: When you want to print more years at once, you can define a year range. This option defines the last year to be printed. Use the option <i>Start year</i> to define the first year in this range.
km: នៅពេលអ្នកចង់បោះពុម្ពច្រើនឆ្នាំក្នុងពេលតែមួយអ្នកអាចកំណត់ជួរមួយឆ្នាំ។ ជម្រើសនេះកំណត់ឆ្នាំចុងក្រោយដែលត្រូវបោះពុម្ព។ ប្រើជម្រើស <i> ឆ្នាំចាប់ផ្តើម </i> ដើម្បីកំណត់ឆ្នាំដំបូងនៅក្នុងជួរនេះ។

source: Exclude confidential items
km: មិនរាប់បញ្ចូលធាតុសំងាត់

source: Exclude private items
km: មិនរាប់បញ្ចូលរបស់របរឯកជន

source: Print to-dos due within the specified date range
km: បោះពុម្ពការងារត្រូវធ្វើតាមចន្លោះកាលបរិច្ឆេទដែលបានបញ្ជាក់

source: Check this option if you want to have to-dos on the print, placed by their due date.
km: ធីកជំរើសនេះប្រសិនបើអ្នកចង់មានការងារត្រូវធ្វើនៅលើព្រីនដែលបានដាក់តាមកាលបរិច្ឆេទកំណត់។

source: Print daily recurring items
km: បោះពុម្ពធាតុដែលកើតឡើងដដែលៗប្រចាំថ្ងៃ

source: With this option it is possible to leave out the daily recurring to-dos and events in the print. They take a lot of space and make the month view needlessly complicated.
km: ជាមួយនឹងជម្រើសនេះវាអាចទៅរួចក្នុងការចាកចេញពីការងារត្រូវធ្វើប្រចាំថ្ងៃនិងព្រឹត្តិការណ៍ដែលត្រូវធ្វើក្នុងព្រីន។ ពួកគេចំណាយពេលច្រើនហើយធ្វើឱ្យទិដ្ឋភាពខែមិនស្មុគស្មាញ។

source: Include daily re&curring to-dos and events
km: រាប់បញ្ចូលរាល់ការងារត្រូវធ្វើប្រចាំថ្ងៃនិងព្រឹត្តិការណ៍ដែលត្រូវធ្វើ

source: Print weekly recurring items
km: បោះពុម្ពធាតុកើតឡើងរៀងរាល់សប្តាហ៍

source: Similar to "Print daily recurring to-dos and events". Weekly to-dos and events will be omitted when making a print of the selected month.
km: ប្រហាក់ប្រហែលនឹង "Print ដែលកើតឡើងដដែលៗនូវការងារត្រូវធ្វើប្រចាំថ្ងៃនិងព្រឹត្តិការណ៍"។ ការងារត្រូវធ្វើនិងព្រឹត្តិការណ៍ប្រចាំសប្តាហ៍នឹងត្រូវបានលុបចោលនៅពេលធ្វើការបោះពុម្ពខែដែលបានជ្រើសរើស។

source: Include weekl&y recurring to-dos and events
km: រួមបញ្ចូលរាល់ការងារត្រូវធ្វើនិងព្រឹត្តិការណ៍ដែលកើតឡើងដដែលៗប្រចាំសប្តាហ៍

source: Print week numbers
km: បោះពុម្ពលេខសប្តាហ៍

source: Enable this to print week numbers at the left of each row.
km: បើកដំណើរការវាដើម្បីបោះពុម្ពលេខសប្តាហ៍នៅខាងឆ្វេងជួរនីមួយៗ។

source: Print week &numbers
km: បោះពុម្ពលេខសប្តាហ៍

source: Check this option to show note lines.
km: ធីកជម្រើសនេះដើម្បីបង្ហាញបន្ទាត់ចំណាំ។

source: If you want to make use of colors you should check this option. The category colors will be used.
km: ប្រសិនបើអ្នកចង់ប្រើពណ៌អ្នកគួរតែពិនិត្យមើលជម្រើសនេះ។ ប្រភេទពណ៌នឹងត្រូវបានប្រើ។

source: This printing style does not have any configuration options.
km: រចនាប័ទ្មបោះពុម្ពនេះមិនមានជម្រើសកំណត់រចនាសម្ព័ន្ធទេ។

source: Holiday
km: ថ្ងៃឈប់សម្រាក

# print date: formatted-datetime
source: printed: %1
km: បានបោះពុម្ព៖ %1

# to-do summary (Due: date)
source: %1 (Due: %2)
km: %1 (ដល់កំណត់៖ %2)

source: To-do: %1
km: ការងារត្រូវធ្វើ​ ៖ %1

source: Person: %1
km: បុគ្គល​ ៖ %1

source: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Print to-dos options:</span></p></body></html>
km: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> ទំ, លី {ស - ដកឃ្លា៖ រុំមុន; } </style></head><body style=" font-family​ ៖'Sans Serif'; font-size​ ៖9pt; font-weight​ ៖400; font-style​ ៖normal;"> <p style=" margin-top​ ៖0px; margin-bottom​ ៖0px; margin-left​ ៖0px; margin-right​ ៖0px; -qt-block-indent​ ៖0; text-indent​ ៖0px;"><span style=" font-weight​ ៖600;"> បោះពុម្ពជម្រើសការងារត្រូវធ្វើ៖ </span></p></body></html>

source: &Title:
km: ចំណងជើង៖

source: Name for this to-do list
km: ឈ្មោះសម្រាប់បញ្ជីការងារត្រូវធ្វើនេះ

source: Enter a name for this to-do list that will be put at the top of the print-out
km: បញ្ចូលឈ្មោះសម្រាប់បញ្ជីការងារត្រូវធ្វើដែលនឹងត្រូវដាក់នៅផ្នែកខាងលើនៃការបោះពុម្ព

source: To-do List
km: បញ្ជីការងារត្រូវធ្វើ

source: To-dos to Print
km: ការងារត្រូវធ្វើដើម្បីបោះពុម្ព

source: Print &all to-dos
km: បោះពុម្ពការងារត្រូវធ្វើទាំងអស់

source: Print unfinished to-dos onl&y
km: បោះពុម្ពតែការងារត្រូវធ្វើមិនទាន់ចប់

source: Print only to-dos due in the &range:
km: បោះពុម្ពតែការងារត្រូវធ្វើដែលត្រូវធ្វើនៅក្នុងជួរ៖

source: &Priority
km: អាទិភាព

source: Due date
km: កាលបរិច្ឆេទ​កំណត់

source: Per&centage completed
km: ភាគរយបានបញ្ចប់

source: Sorting Options
km: ជម្រើសតម្រៀប

source: Sort field:
km: តម្រៀបវាល៖

source: Sort direction:
km: តម្រៀបទិសដៅ៖

source: Co&nnect sub-to-dos with its parent
km: ភ្ជាប់អនុការងារត្រូវធ្វើជាមួយមេរបស់វា

source: Strike &out completed to-do summaries
km: ធ្វើកូដកម្មសង្ខេបការងារដែលត្រូវធ្វើ

source: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Print week options:</span></p></body></html>
km: <html><head><meta name="qrichtext" content="1" /><style type="text/css"> ទំ, លី {ស - ដកឃ្លា៖ រុំមុន; } </style></head><body style=" font-family​ ៖'Sans Serif'; font-size​ ៖9pt; font-weight​ ៖400; font-style​ ៖normal;"> <p style=" margin-top​ ៖0px; margin-bottom​ ៖0px; margin-left​ ៖0px; margin-right​ ៖0px; -qt-block-indent​ ៖0; text-indent​ ៖0px;"><span style=" font-weight​ ៖600;"> បោះពុម្ពជម្រើសសប្ដាហ៍៖ </span></p></body></html>

source: Starting date for the print
km: កាលបរិច្ឆេទចាប់ផ្តើមសម្រាប់ការបោះពុម្ព

source: Here you can choose which events should be printed based on their date. This check enables you to enter the start date of the date range. Use the <i>End date</i> to enter the end date of the daterange.
km: នៅទីនេះអ្នកអាចជ្រើសរើសព្រឹត្តិការណ៍ណាមួយដែលគួរតែត្រូវបានបោះពុម្ពដោយផ្អែកលើកាលបរិច្ឆេទរបស់ពួកគេ។ ការត្រួតពិនិត្យនេះអនុញ្ញាតឱ្យអ្នកបញ្ចូលកាលបរិច្ឆេទចាប់ផ្តើមនៃចន្លោះកាលបរិច្ឆេទ។ ប្រើ <i> កាលបរិច្ឆេទបញ្ចប់ </i> ដើម្បីបញ្ចូលកាលបរិច្ឆេទបញ្ចប់នៃកាលបរិច្ឆេទកាលបរិច្ឆេទ។

source: All events which start later than the given time will not be printed.
km: ព្រឹត្តិការណ៍ទាំងអស់ដែលចាប់ផ្តើមយឺតជាងពេលវេលាដែលបានផ្តល់នឹងមិនត្រូវបានបោះពុម្ពទេ។

source: All events which start earlier than the given time will not be printed.
km: ព្រឹត្តិការណ៍ទាំងអស់ដែលចាប់ផ្តើមមុនពេលកំណត់នឹងមិនត្រូវបានបោះពុម្ពទេ។

source: Here you can choose which events should be printed based on their date. This check enables you to enter the end date of the date range. Use the <i>Start date</i> to enter the start date of the daterange.
km: នៅទីនេះអ្នកអាចជ្រើសរើសព្រឹត្តិការណ៍ណាមួយដែលគួរតែត្រូវបានបោះពុម្ពដោយផ្អែកលើកាលបរិច្ឆេទរបស់ពួកគេ។ ការត្រួតពិនិត្យនេះអនុញ្ញាតឱ្យអ្នកបញ្ចូលកាលបរិច្ឆេទបញ្ចប់នៃចន្លោះកាលបរិច្ឆេទ។ ប្រើ <i> ថ្ងៃ​ចាប់ផ្តើម </i> ដើម្បីបញ្ចូលកាលបរិច្ឆេទចាប់ផ្តើមនៃកាលបរិច្ឆេទកំណត់ពេលវេលា។

source: The Filofax view prints one week per page, so all days have a large surface.
km: ទិដ្ឋភាព Filofax បោះពុម្ពមួយសប្តាហ៍ក្នុងមួយទំព័រដូច្នេះរាល់ថ្ងៃមានផ្ទៃធំ។

source: P&rint as Filofax page
km: បោះពុម្ពជាទំព័រ Filofax

source: This view is similar to the weekview. The week is printed in landscape layout. You can even use the same colors for the items if you check <i>Use Colors</i>.
km: ទស្សនៈនេះគឺស្រដៀងនឹងទិដ្ឋភាពប្រចាំសប្តាហ៍។ សប្តាហ៍ត្រូវបានបោះពុម្ពនៅក្នុងប្លង់ទេសភាព។ អ្នកក៏អាចប្រើពណ៌ដូចគ្នាសម្រាប់របស់របរដែរប្រសិនបើអ្នកពិនិត្យ <i> ប្រើពណ៌ </i>

source: Print as timeta&ble view
km: បោះពុម្ពជាទិដ្ឋភាពកំណត់ពេលវេលា

source: This view is similar to the week view. The only difference with the timetable view is the page layout. Timetables are printed in landscape, the split week view in portrait.
km: ទស្សនៈនេះស្រដៀងនឹងទិដ្ឋភាពសប្តាហ៍។ ភាពខុសគ្នាតែមួយជាមួយនឹងការមើលកាលវិភាគគឺប្លង់ទំព័រ។ តារាងពេលវេលាត្រូវបានបោះពុម្ពជារូបភាពទេសភាពទិដ្ឋភាពសប្តាហ៍ដែលបំបែកជាបញ្ឈរ។

source: Print as split wee&k view
km: បោះពុម្ពជាទិដ្ឋភាពមួយសប្តាហ៍ដែលបំបែក

source: Check this option to draw note lines.
km: ធីកជម្រើសនេះដើម្បីគូរបន្ទាត់ចំណាំ។

source: Show note &lines in Filofax layout
km: បង្ហាញបន្ទាត់ចំណាំនៅក្នុងប្លង់ហ្វីលហ្វីល

source: The timetable view supports colors. If you want to make use of colors you should check this option. The category colors will be used.
km: ទិដ្ឋភាពកាលវិភាគគាំទ្រពណ៌។ ប្រសិនបើអ្នកចង់ប្រើពណ៌អ្នកគួរតែពិនិត្យមើលជម្រើសនេះ។ ប្រភេទពណ៌នឹងត្រូវបានប្រើ។

source: <html><head/><body><p><span style=" font-size:9pt; font-weight:600;">Print year options:</span></p></body></html>
km: <html><head/><body><p><span style=" font-size​ ៖9pt; font-weight​ ៖600;"> ជម្រើសបោះពុម្ពឆ្នាំ៖ </span></p></body></html>

source: Date Range
km: ជួរកាលបរិច្ឆេទ

source: &Year:
km: ឆ្នាំ៖

source: Num&ber of pages:
km: ចំនួនទំព័រ៖

source: Show sub-day events as:
km: បង្ហាញព្រឹត្តិការណ៍រងដូចជា៖

source: Text
km: អត្ថបទ

source: Time Boxes
km: ប្រអប់ពេលវេលា

source: Show holidays as:
km: បង្ហាញថ្ងៃឈប់សម្រាកជា៖

source: Print Incidences of Type
km: បោះពុម្ពព្រឹត្តិការណ៍នៃប្រភេទ

source: &Events
km: ព្រឹត្តិការណ៍

source: &To-dos
km: ការងារត្រូវធ្វើ

source: &Journals
km: ទិនានុប្បវត្តិ

source: Print Item list
km: បោះពុម្ពបញ្ជីធាតុ

source: Prints a list of events and to-dos
km: បោះពុម្ពបញ្ជីព្រឹត្តិការណ៍និងការងារត្រូវធ្វើ

source: Journal entries
km: ធាតុទិនានុប្បវត្តិ

source: Print &journal
km: បោះពុម្ពទិនានុប្បវត្តិ

source: Prints all journals for a given date range
km: បោះពុម្ពទិនានុប្បវត្តិទាំងអស់សម្រាប់ចន្លោះកាលបរិច្ឆេទដែលបានផ្តល់ឱ្យ

source: Print What's Next
km: បោះពុម្ពអ្វីបន្ទាប់

source: Prints a list of all upcoming events and todos.
km: បោះពុម្ពបញ្ជីព្រឹត្តិការណ៍និងការងារដែលជិតមកដល់ទាំងអស់។

source: Print &year
km: បោះពុម្ពឆ្នាំ

source: Prints a calendar for an entire year
km: បោះពុម្ពប្រតិទិនពេញមួយឆ្នាំ

# @title:window
source: Select Calendar
km: ជ្រើសប្រតិទិន

source: Select the calendar where this item will be stored.
km: ជ្រើសរើសប្រតិទិនដែលធាតុនេះនឹងត្រូវរក្សាទុក។

source: Tasks
km: ភារកិច្ច

source: Journal
km: ទិនានុប្បវត្តិ

source: Notes
km: កំណត់ចំណាំ

# %1 is folder contents
source: My Kolab %1
km: Kolab %1 របស់ខ្ញុំ

# %1 is folder name, %2 is folder contents
source: Shared Kolab %1 %2
km: ចែករំលែកកូឡាប %1 %2

# %1 is folder owner name, %2 is folder name, %3 is folder contents
source: %1's %2 Kolab %3
km: %1's %2 កូឡាប %3

# %1 is folder contents
source: Kolab %1
km: កូឡាប %1

# %1 is the folder name
source: %1 in %2
km: %1 ក្នុង %2

# %1 is folder owner name, %2 is folder contents
source: %1's Google %2
km: ហ្គូហ្គោលរបស់ %2 របស់ %1

# %1 is folder contents
source: Google %1
km: ហ្គូហ្គល %1

source: My %1
km: %1 របស់ខ្ញុំ

# unknown resource
source: Unknown
km: មិនស្គាល់

# this is the default calendar
source: %1 (Default Calendar)
km: %1 (ប្រតិទិនលំនាំដើម)

# a virtual folder type
source: Virtual
km: និម្មិត

source: Folder type:
km: ប្រភេទថតឯកសារ៖

source: Content type:
km: ប្រភេទមាតិកា៖

source: Rights:
km: សិទ្ធិ​ ៖

# the calendar is read-only
source: read-only
km: អាច​បាន​តែ​អាន

# the calendar is read and write
source: read+write
km: អាន + សរសេរ

# blocking all reminders for this calendar
source: all
km: ទាំងអស់

# blocking audio reminders for this calendar
source: audio
km: សំលេង

# blocking display pop-up dialog reminders for this calendar
source: display
km: បង្ហាញ

# blocking email reminders for this calendar
source: email
km: អ៊ីមែល

# blocking run a command reminders for this calendar
source: procedure
km: នីតិវិធី

# blocking unknown type reminders for this calendar
source: other
km: ផ្សេងទៀត
