Repository: koompi/kde-khmer-translation
Catalog: Documentation in stable KF5-based/docmessages/calligra/stage_menus.po
Languages: km

source: The Menu and Toolbar Items
km: ធាតុម៉ឺនុយនិងរបារឧបករណ៍

source: &stage; presents different types of interfaces for you to interact with the program. Perhaps the most familiar type of interface is the menu which appears on the top of the &stage; window.
km: ឆាក; បង្ហាញនូវចំណុចប្រទាក់ផ្សេងៗគ្នាសម្រាប់អ្នកដើម្បីធ្វើអន្តរកម្មជាមួយកម្មវិធី។ ប្រហែលជាប្រភេទនៃចំណុចប្រទាក់ដែលធ្លាប់ស្គាល់បំផុតគឺម៉ឺនុយដែលលេចឡើងនៅលើកំពូលនៃឆាក; ផ្ទាំងកម្មវិធី

source: Clicking on the menu items gives you a list of commands from which you can choose the one you want. Many of the commands can also be accessed directly by holding down &Ctrl; or &Alt; and pressing another key on your keyboard. In the next section, each of the menu commands is described in brief.
km: ចុចលើធាតុម៉ឺនុយផ្តល់ឱ្យអ្នកនូវបញ្ជីពាក្យបញ្ជាដែលអ្នកអាចជ្រើសរើសមួយដែលអ្នកចង់បាន។ ពាក្យបញ្ជាជាច្រើនក៏អាចចូលប្រើដោយផ្ទាល់ផងដែរដោយចុចបញ្ជា (Ctrl) ។ ឬជំនួស; ហើយចុចគ្រាប់ចុចផ្សេងទៀតនៅលើក្តារចុចរបស់អ្នក។ នៅក្នុងផ្នែកបន្ទាប់ពាក្យបញ្ជាម៉ឺនុយនីមួយៗត្រូវបានពិពណ៌នាដោយសង្ខេប។

source: The Toolbars
km: របារឧបករណ៍

source: Manipulating the Toolbars
km: រៀបចំរបារឧបករណ៍

source: In addition to the menus, &stage; also has a toolbar. The toolbar consists of a collection of icons. A toolbar icon often presents a convenient shortcut to a command that is found in one of the menus.
km: បន្ថែមលើម៉ឺនុយ, ឆាក; ក៏មានរបាឧបករណ៍ផងដែរ។ របារឧបករណ៍មានបណ្តុំរូបតំណាង។ រូបតំណាងរបារឧបករណ៍ជារឿយៗបង្ហាញផ្លូវកាត់ងាយស្រួលដល់ពាក្យបញ្ជាដែលមាននៅក្នុងមឺនុយមួយ។

source: You can move the unlocked toolbar around by dragging the handle at the left. The unlocked toolbar can be <quote>docked</quote> or attached to any side of the &stage; window. If you like, you can also have the toolbar <quote>float</quote> in its own window, separated from the main &stage; window.
km: អ្នកអាចផ្លាស់ទីរបារឧបករណ៍ដោះសោជុំវិញដោយអូសចំណុចទាញនៅខាងឆ្វេង។ របារឧបករណ៍ដោះសោអាចមាន <quote> ចត </quote> ឬភ្ជាប់ទៅផ្នែកណាមួយនៃឆាក ផ្ទាំងកម្មវិធី ប្រសិនបើអ្នកចូលចិត្តអ្នកក៏អាចមានរបារឧបករណ៍ដែរ <quote> អណ្តែត </quote> នៅក្នុងផ្ទាំងកម្មវិធីផ្ទាល់ខ្លួនរបស់វា, បំបែកពីដំណាក់កាលសំខាន់; ផ្ទាំងកម្មវិធី

source: If you don't like dragging toolbars around, <mousebutton>right</mousebutton> click on the handle and a menu pops up.
km: ប្រសិនបើអ្នកមិនចូលចិត្តអូសរបារឧបករណ៍នៅជុំវិញ, <mousebutton> ត្រឹមត្រូវ </mousebutton> ចុចលើចំណុចទាញហើយម៉ឺនុយនឹងលេចចេញមក។

source: Choosing the item <guisubmenu>Text Position</guisubmenu> leads to an additional menu which lets you control the appearance of the items in toolbar. This additional cascading menu is shown in the screenshot below:
km: ការជ្រើសរើសធាផ្ទៃ Desktop<guisubmenu> ទីតាំងអត្ថបទ </guisubmenu> នាំឱ្យមានម៉ឺនុយបន្ថែមដែលអនុញ្ញាតឱ្យអ្នកត្រួតពិនិត្យរូបរាងនៃធាតុនៅក្នុងរបាឧបករណ៍។ ម៉ឺនុយល្បាក់បន្ថែមនេះត្រូវបានបង្ហាញនៅក្នុងរូបថតអេក្រង់ខាងក្រោម៖

source: <screeninfo>Text Position</screeninfo>
km: <screeninfo> ទីតាំងអត្ថបទ </screeninfo>

source: <phrase>Text Position</phrase>
km: <phrase> ទីតាំងអត្ថបទ </phrase>

source: You can choose to display the toolbar items as text instead of icons, or even to combine both icons and text. If you want both text and icons, the cascading menu allows you to select whether the text appears beside the icons or below them.
km: អ្នកអាចជ្រើសរើសបង្ហាញធាតុរបារឧបករណ៍ជាអត្ថបទជំនួសឱ្យរូបតំណាងឬបញ្ចូលទាំងរូបតំណាងនិងអត្ថបទ។ ប្រសិនបើអ្នកចង់បានទាំងអត្ថបទនិងរូបតំណាងម៉ឺនុយល្បាក់អនុញ្ញាតឱ្យអ្នកជ្រើសរើសថាតើអត្ថបទលេចឡើងនៅក្បែររូបតំណាងឬនៅពីក្រោមពួកវា។

source: In icons only view, if you don't know what a particular icon means, you can hold the mouse over the icon, and after a second or so, a little hint pops up in a highlighted text box.
km: ក្នុងរូបតំណាងបានត្រឹមតែមើលប្រសិនបើអ្នកមិនដឹងថារូបតំណាងជាក់លាក់មួយមានន័យយ៉ាងដូចម្តេចទេអ្នកអាចសង្កត់កណ្តុរលើរូបតំណាងហើយបន្ទាប់ពីមួយវិនាទីក្រោយមកគន្លឹះតូចមួយលេចឡើងនៅក្នុងប្រអប់អត្ថបទដែលបានបន្លិច។

source: The <guilabel>Orientation</guilabel> item in the popup menu has to do with the placement of the toolbar. You can choose any of the four sides of the &stage; window.
km: នេះ <guilabel> ការតំរង់ទិស </guilabel> ធាតុនៅក្នុងម៉ឺនុយលេចឡើងត្រូវធ្វើជាមួយការដាក់របារឧបករណ៍។ អ្នកអាចជ្រើសរើសផ្នែកណាមួយនៃផ្នែកទាំងបួននៃឆាក។ ផ្ទាំងកម្មវិធី

source: The &stage; menus are discussed in the following sections.
km: ដំណាក់កាល; ម៉ឺនុយត្រូវបានពិភាក្សានៅក្នុងផ្នែកដូចខាងក្រោម។

source: File Menu
km: ម៉ឺនុយឯកសារ

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> អិន </keycap></keycombo></shortcut><guimenu> ឯកសារ </guimenu><guimenuitem> ថ្មី </guimenuitem>

source: <action>Begins a new presentation.</action> The startup dialog will open, allowing you to choose a template for your presentation.
km: <action> ចាប់ផ្តើមបទបង្ហាញថ្មី។ </action> ប្រអប់ចាប់ផ្តើមនឹងបើកដែលអនុញ្ញាតឱ្យអ្នកជ្រើសរើសគំរូសម្រាប់បទបង្ហាញរបស់អ្នក។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> ឱ </keycap></keycombo></shortcut><guimenu> ឯកសារ </guimenu><guimenuitem> បើក ... </guimenuitem>

source: <action>Opens an existing presentation.</action> A standard &kde; file open dialog will appear, allowing you to choose a file to open.
km: <action> បើកបទបង្ហាញដែលមានស្រាប់។ </action> KDE ស្តង់ដារមួយ; ប្រអប់បើកឯកសារនឹងលេចឡើងដែលអនុញ្ញាត ឲ្យ អ្នកជ្រើសឯកសារបើក។

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
km: <guimenu> ឯកសារ </guimenu><guisubmenu> បើកថ្មីៗ </guisubmenu>

source: Displays a list of recently opened files for you to choose from.
km: បង្ហាញបញ្ជីឯកសារដែលទើបនឹងបើកឱ្យអ្នកជ្រើសរើស។

source: <shortcut><keycombo action="simul"> &Ctrl;<keycap>S</keycap> </keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> ស </keycap></keycombo></shortcut><guimenu> ឯកសារ </guimenu><guimenuitem> រក្សាទុក </guimenuitem>

source: <action>Saves the currently open presentation.</action> If you have not previously saved it, you will be asked to name the file. If you have previously saved the presentation, it will be resaved with the same name.
km: <action> រក្សាទុកបទបង្ហាញបើកបច្ចុប្បន្ន។ </action> ប្រសិនបើអ្នកមិនបានរក្សាទុកវាពីមុនទេអ្នកនឹងត្រូវបានស្នើសុំឱ្យដាក់ឈ្មោះឯកសារ។ ប្រសិនបើអ្នកបានរក្សាទុកបទបង្ហាញពីមុនវានឹងត្រូវបានរក្សាទុកជាមួយឈ្មោះដដែល។

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
km: <guimenu> ឯកសារ </guimenu><guimenuitem> រក្សាទុក​ជា... </guimenuitem>

source: Saves the currently open presentation with a new name.
km: រក្សាទុកបទបង្ហាញបើកថ្មីដែលមានឈ្មោះថ្មី។

source: <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
km: <guimenu> ឯកសារ </guimenu><guimenuitem> ផ្ទុកឡើងវិញ </guimenuitem>

source: Reload the currently active file.
km: ផ្ទុកឯកសារសកម្មបច្ចុប្បន្នឡើងវិញ។

source: <guimenu>File</guimenu> <guimenuitem>Import...</guimenuitem>
km: <guimenu> ឯកសារ </guimenu><guimenuitem> នាំចូល ... </guimenuitem>

source: Import a presentation that was previously created in one of several common formats.
km: នាំចូលបទបង្ហាញដែលត្រូវបានបង្កើតពីមុនក្នុងទម្រង់មួយក្នុងចំណោមទម្រង់ទូទៅជាច្រើន។

source: <guimenu>File</guimenu> <guimenuitem>Export...</guimenuitem>
km: <guimenu> ឯកសារ </guimenu><guimenuitem> នាំចេញ ... </guimenuitem>

source: Export the currently open presentation to one of several common formats for use in another application, or for exchange with someone who does not have access to &stage;.
km: នាំចេញបទបង្ហាញដែលបើកចំហរជាទម្រង់សាមញ្ញមួយក្នុងចំណោមទំរង់ទូទៅជាច្រើនសំរាប់ប្រើក្នុងកម្មវិធីមួយផ្សេងទៀតរឺសំរាប់ផ្លាស់ប្តូរជាមួយអ្នកដែលមិនមានលទ្ធភាពចូលឆាក។

source: <guimenu>File</guimenu> <guimenuitem>Mail...</guimenuitem>
km: <guimenu> ឯកសារ </guimenu><guimenuitem> អ៊ីមែល ... </guimenuitem>

source: <action>Open</action> a new email message in your selected email client with the current &stage; document attached.
km: <action> បើក </action> សារអ៊ីមែលថ្មីនៅក្នុងកម្មវិធីអ៊ីមែលដែលអ្នកបានជ្រើសរើសជាមួយនឹងដំណាក់កាលបច្ចុប្បន្ន។ ឯកសារភ្ជាប់

source: <guimenu>File</guimenu> <guimenuitem>Export as HTML...</guimenuitem>
km: <guimenu> ឯកសារ </guimenu><guimenuitem> នាំចេញជា HTML ... </guimenuitem>

source: <action>Starts the HTML wizard</action>, which is described in the section <xref linkend="html-wizard"/>.
km: <action> ចាប់ផ្តើមអ្នកជំនួយការ HTML </action> ដែលត្រូវបានពិពណ៌នានៅក្នុងផ្នែក <xref linkend="html-wizard"/>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> ទំ </keycap></keycombo></shortcut><guimenu> ឯកសារ </guimenu><guimenuitem> បោះពុម្ព ... </guimenuitem>

source: <action>Prints the presentation</action>. More precisely, it opens the print settings dialog, where you can adjust the settings before printing your presentation.
km: <action> បោះពុម្ពបទបង្ហាញ </action> ។ ច្បាស់ជាងនេះទៅទៀតវាបើកប្រអប់កំណត់ការបោះពុម្ពដែលអ្នកអាចកែសម្រួលការកំណត់មុនពេលបោះពុម្ពបទបង្ហាញរបស់អ្នក។

source: <guimenu>File</guimenu> <guimenuitem>Print Preview...</guimenuitem>
km: <guimenu> ឯកសារ </guimenu><guimenuitem> មើលការបោះពុម្ព ... </guimenuitem>

source: <action>Displays the presentation</action> with a viewer, exactly as it would look if printed.
km: <action> បង្ហាញបទបង្ហាញ </action> ជាមួយនឹងអ្នកមើលពិតប្រាកដដូចដែលវានឹងមើលទៅប្រសិនបើបានបោះពុម្ព។

source: <guimenu>File</guimenu> <guimenuitem>Document Information</guimenuitem>
km: <guimenu> ឯកសារ </guimenu><guimenuitem> ព័ត៌មានឯកសារ </guimenuitem>

source: <action>Allows you to enter information about the document.</action> This includes information about the author, and an abstract on the documents contents.
km: <action> អនុញ្ញាតឱ្យអ្នកបញ្ចូលព័ត៌មានអំពីឯកសារ។ </action> នេះរួមបញ្ចូលទាំងព័ត៌មានអំពីអ្នកនិពន្ធនិងការអរូបីលើមាតិកាឯកសារ។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Close</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> វ </keycap></keycombo></shortcut><guimenu> ឯកសារ </guimenu><guimenuitem> បិទ </guimenuitem>

source: <action>Close the current presentation.</action> You will be given an opportunity to save any changes first.
km: <action> បិទបទបង្ហាញបច្ចុប្បន្ន។ </action> អ្នកនឹងត្រូវបានផ្តល់ឱកាសដើម្បីរក្សាទុកការផ្លាស់ប្តូរណាមួយជាមុន។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> សំណួរ </keycap></keycombo></shortcut><guimenu> ឯកសារ </guimenu><guimenuitem> ឈប់ </guimenuitem>

source: <action>Close</action> &stage;. You will be given an opportunity to save all changes in all open presentations first.
km: <action> បិទ </action> ដំណាក់កាល; ។ អ្នកនឹងត្រូវបានផ្តល់ឱកាសដើម្បីរក្សាទុកការផ្លាស់ប្តូរទាំងអស់នៅក្នុងបទបង្ហាញបើកចំហទាំងអស់ជាមុន។

source: Edit Menu
km: កែសម្រួលម៉ឺនុយ

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo: <replaceable>Last task</replaceable></guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> Z </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> មិនធ្វើវិញ៖ <replaceable> កិច្ចការចុងក្រោយ </replaceable></guimenuitem>

source: Undo the last action you performed.
km: មិនធ្វើសកម្មភាពចុងក្រោយដែលអ្នកបានធ្វើ។

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo: <replaceable>Last undone task</replaceable></guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) ប្ដូរ; <keycap> Z </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> ធ្វើវិញ៖ <replaceable> កិច្ចការដែលមិនធ្វើវិញចុងក្រោយ </replaceable></guimenuitem>

source: <action>Redo the last action you undid.</action> If you have not undone any actions, or the last undo action is not reversible, this menu item is disabled.
km: <action> ធ្វើសកម្មភាពចុងក្រោយដែលអ្នកមិនធ្វើ។ </action> ប្រសិនបើអ្នកមិនធ្វើវិញសកម្មភាពណាមួយឬសកម្មភាពមិនធ្វើវិញចុងក្រោយមិនអាចត្រឡប់វិញបានទេធាតុម៉ឺនុយនេះត្រូវបានបិទ។

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> X </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> កាត់ </guimenuitem>

source: Copy the selected item to the clipboard, and remove it from the document.
km: ចម្លងធាតុដែលបានជ្រើសរើសទៅក្តារតម្បៀតខ្ទាស់ហើយយកវាចេញពីឯកសារ។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> គ </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> ចម្លង </guimenuitem>

source: Copy the selected item to the clipboard, while leaving it intact in your presentation.
km: ចម្លងធាតុដែលបានជ្រើសរើសទៅក្តារតម្បៀតខ្ទាស់ខណៈពេលដែលទុកវានៅដដែលនៅក្នុងបទបង្ហាញរបស់អ្នក។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> វី </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> បិទភ្ជាប់ </guimenuitem>

source: Insert the contents of the clipboard into your presentation.
km: បញ្ចូលមាតិកាក្តារតម្បៀតខ្ទាស់ទៅក្នុងបទបង្ហាញរបស់អ្នក។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Del</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> ដេល </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> លុប </guimenuitem>

source: Remove the currently selected item from your presentation.
km: យកធាតុដែលបានជ្រើសចេញពីបទបង្ហាញរបស់អ្នក។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> ក </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> ជ្រើស​យក​ទាំងអស់ </guimenuitem>

source: Select all the objects and text on the current slide.
km: ជ្រើសវត្ថុនិងអត្ថបទទាំងអស់នៅលើស្លាយបច្ចុប្បន្ន។

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Deselect</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) ប្ដូរ; <keycap> ក </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> ដោះការជ្រើសរើស </guimenuitem>

source: Deselect any currently selected objects.
km: មិនជ្រើសវត្ថុដែលបានជ្រើសបច្ចុប្បន្ន។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> ច </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> ស្វែងរក ... </guimenuitem>

source: Search for text within the presentation.
km: ស្វែងរកអត្ថបទនៅក្នុងបទបង្ហាញ។

source: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem>
km: <shortcut><keycap> F3 </keycap></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> រកបន្ទាប់ </guimenuitem>

source: Find the next occurrence of a piece of text within a presentation.
km: ស្វែងរកការកើតឡើងនៃអត្ថបទបន្ទាប់នៅក្នុងបទបង្ហាញ។

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Previous</guimenuitem>
km: <shortcut><keycombo action="simul"> ការផ្លាស់ប្តូរ; <keycap> F3 </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> ស្វែងរកមុន </guimenuitem>

source: Find the previous occurrence of a piece of text within a presentation.
km: ស្វែងរកការកើតឡើងនៃអត្ថបទពីមុននៅក្នុងបទបង្ហាញ។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Replace...</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> R </keycap></keycombo></shortcut><guimenu> កែសម្រួល </guimenu><guimenuitem> ជំនួស ... </guimenuitem>

source: Replace one or more occurrences of a piece of text in your presentation with a different piece of text.
km: ជំនួសការកើតឡើងនៃអត្ថបទមួយឬច្រើននៅក្នុងបទបង្ហាញរបស់អ្នកជាមួយនឹងបំណែកនៃអត្ថបទខុសគ្នា។

source: View Menu
km: មើលម៉ឺនុយ

source: <guimenu>View</guimenu> <guimenuitem>New View</guimenuitem>
km: <guimenu> មើល </guimenu><guimenuitem> ទិដ្ឋភាពថ្មី </guimenuitem>

source: <action>Opens another window with the same presentation loaded</action> so you can work on more than one slide at a time.
km: <action> បើកផ្ទាំងកម្មវិធីផ្សេងទៀតដែលមានផ្ទុកបទបង្ហាញដូចគ្នា </action> ដូច្នេះអ្នកអាចធ្វើការលើស្លាយច្រើនជាងមួយក្នុងពេលតែមួយ។

source: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Normal</guimenuitem> </menuchoice> <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F6</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Notes</guimenuitem> </menuchoice> <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F7</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Slides Sorter</guimenuitem> </menuchoice>
km: <menuchoice><shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> F5 </keycap></keycombo></shortcut><guimenu> មើល </guimenu><guimenuitem> ធម្មតា </guimenuitem></menuchoice><menuchoice><shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> F6 </keycap></keycombo></shortcut><guimenu> មើល </guimenu><guimenuitem> កំណត់ចំណាំ </guimenuitem></menuchoice><menuchoice><shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> F7 </keycap></keycombo></shortcut><guimenu> មើល </guimenu><guimenuitem> ឧបករណ៍តម្រៀបស្លាយ </guimenuitem></menuchoice>

source: Switch with these actions between the view modes Normal, where you edit slides, Notes, which shows a slide preview with a textbox for your annotations for the actual slide and the Slides Sorter view, where you can rename, cut, copy and paste slides and arrange them for your presentation.
km: ផ្លាស់ប្តូរជាមួយសកម្មភាពទាំងនេះរវាងទម្រង់ទិដ្ឋភាពធម្មតាដែលអ្នកកែសម្រួលស្លាយចំណាំដែលបង្ហាញការមើលស្លាយជាមុនជាមួយប្រអប់អត្ថបទសម្រាប់ចំណារពន្យល់របស់អ្នកសម្រាប់ស្លាយពិតនិងទិដ្ឋភាពស្លាយ Sorter ដែលអ្នកអាចប្តូរឈ្មោះកាត់ចម្លងនិងបិទភ្ជាប់ស្លាយនិង រៀបចំឱ្យពួកគេសម្រាប់បទបង្ហាញរបស់អ្នក។

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F8</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Show Master Slides</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> F8 </keycap></keycombo></shortcut><guimenu> មើល </guimenu><guimenuitem> បង្ហាញស្លាយមេ </guimenuitem>

source: <action>Toggle the display of the slide master</action> where you can put objects that you want to appear on each slide in your presentation.
km: <action> បិទបើកការបង្ហាញរបស់មេស្លាយ </action> កន្លែងដែលអ្នកអាចដាក់វត្ថុដែលអ្នកចង់បង្ហាញនៅលើស្លាយនីមួយៗក្នុងបទបង្ហាញរបស់អ្នក។

source: <guimenu>View</guimenu> <guimenuitem>Show Grid</guimenuitem>
km: <guimenu> មើល </guimenu><guimenuitem> បង្ហាញក្រឡាចត្រង្គ </guimenuitem>

source: If enabled, &stage; will display a grid of dots representing the intersections of imaginary horizontal and vertical lines. You can use these dots to precisely position objects on the slide.
km: ប្រសិនបើបានបើកដំណើរការ; នឹងបង្ហាញក្រឡាចត្រង្គនៃចំនុចតំណាងអោយចំនុចប្រសព្វនៃបន្ទាត់ផ្តេកនិងបញ្ឈរ។ អ្នកអាចប្រើចំណុចទាំងនេះដើម្បីកំណត់ទីតាំងវត្ថុនៅលើស្លាយ។

source: <guimenu>View</guimenu><guimenuitem> Snap to Grid</guimenuitem>
km: <guimenu> មើល </guimenu><guimenuitem> ខ្ទាស់ទៅក្រឡាចត្រង្គ </guimenuitem>

source: If this is enabled, when dropping or moving objects on the slide the top left corner of the object will <quote>snap</quote> or move, to the nearest grid point.
km: ប្រសិនបើបើកដំណើរការនៅពេលទម្លាក់ឬផ្លាស់ទីវត្ថុលើស្លាយជ្រុងខាងឆ្វេងខាងលើនៃវត្ថុនឹង <quote> ខ្ទាស់ </quote> ឬផ្លាស់ទីទៅចំណុចក្រឡាចត្រង្គដែលនៅជិតបំផុត។

source: This does reduce your freedom to freely position objects on the slide, however it also helps to line up objects precisely. It is easily disabled or enabled with this menu entry, allowing you the best of both worlds.
km: នេះពិតជាកាត់បន្ថយសេរីភាពរបស់អ្នកក្នុងការដាក់វត្ថុនៅលើស្លាយដោយសេរីទោះយ៉ាងណាវាក៏ជួយតម្រង់ជួរវត្ថុយ៉ាងជាក់លាក់ដែរ។ វាត្រូវបានបិទឬបើកដំណើរការយ៉ាងងាយស្រួលជាមួយធាតុម៉ឺនុយនេះដែលអនុញ្ញាតឱ្យអ្នកល្អបំផុតនៃពិភពលោកទាំងពីរ។

source: <guimenu>View</guimenu> <guimenuitem>Show Guides</guimenuitem>
km: <guimenu> មើល </guimenu><guimenuitem> បង្ហាញមគ្គុទេសក៍ </guimenuitem>

source: When working in &stage; you can drag a <quote>guide line</quote> from either the horizontal or vertical ruler onto your document. This guide-line will not print or display in the finished presentation, it is simply to help you align objects on screen. If this item is enabled, these guide lines will be visible. If this is disabled, they will not be visible.
km: នៅពេលធ្វើការនៅក្នុងដំណាក់កាល; អ្នកអាចអូសមួយ <quote> បន្ទាត់ណែនាំ </quote> ពីបន្ទាត់ផ្តេកឬបញ្ឈរលើឯកសាររបស់អ្នក។ មគ្គុទ្ទេសក៍នេះនឹងមិនបោះពុម្ពឬបង្ហាញនៅក្នុងបទបង្ហាញចប់ទេវាគ្រាន់តែជួយអ្នកតម្រឹមវត្ថុនៅលើអេក្រង់ប៉ុណ្ណោះ។ ប្រសិនបើធាតុនេះត្រូវបានបើកបន្ទាត់ណែនាំទាំងនេះនឹងអាចមើលឃើញ។ ប្រសិនបើវាត្រូវបានបិទពួកវានឹងមិនអាចមើលឃើញទេ។

source: Guide lines work across slides, allowing you to align objects the same way across multiple slides.
km: បន្ទាត់មគ្គុទេសក៍ធ្វើការនៅលើស្លាយដែលអនុញ្ញាតឱ្យអ្នកតម្រឹមវត្ថុតាមវិធីដូចគ្នាកាត់ស្លាយជាច្រើន។

source: Disabling (hiding) guide lines does not delete them. If you have created guide lines, and then disabled this item, enabling it again will retain the guide lines you created.
km: ការបិទ (លាក់) បន្ទាត់ណែនាំមិនលុបពួកវាទេ។ ប្រសិនបើអ្នកបានបង្កើតបន្ទាត់ណែនាំហើយបន្ទាប់មកបិទធាតុនេះការបើកវាម្តងទៀតនឹងរក្សាបន្ទាត់ណែនាំដែលអ្នកបានបង្កើត។

source: <guimenu>View</guimenu> <guisubmenu>Zoom</guisubmenu>
km: <guimenu> មើល </guimenu><guisubmenu> ពង្រីក </guisubmenu>

source: This submenu allows you to zoom in or out of the slide. Several predefined zoom levels are available, including <guimenuitem>Fit Page</guimenuitem> to scale the entire slide so as to be visible in the size window you have open, and <guimenuitem>Fit Page Width</guimenuitem> to scale the slide so it fills the entire width of the window, although you may now have to scroll vertically. There are also several other scaling choices, from <guimenuitem>33%</guimenuitem> up to <guimenuitem>500%</guimenuitem>.
km: ម៉ឺនុយរងនេះអនុញ្ញាតឱ្យអ្នកពង្រីកឬបង្រួមស្លាយ។ កម្រិតពង្រីកដែលបានកំណត់ជាមុនអាចរកបានរួមទាំង <guimenuitem> សមទំព័រ </guimenuitem> ដើម្បីធ្វើមាត្រដ្ឋានស្លាយទាំងមូលដើម្បីឱ្យមើលឃើញនៅក្នុងផ្ទាំងកម្មវិធីទំហំដែលអ្នកបានបើកនិង <guimenuitem> សមទំព័រទទឹង </guimenuitem> ដើម្បីធ្វើមាត្រដ្ឋានស្លាយដូច្នេះវាបំពេញទទឹងផ្ទាំងកម្មវិធីទាំងមូលទោះបីជាអ្នកត្រូវរមូរបញ្ឈរក៏ដោយ។ ក៏មានជម្រើសធ្វើមាត្រដ្ឋានផ្សេងទៀតជាច្រើនពី <guimenuitem> 33 % </guimenuitem> រហូតដល់ <guimenuitem> 500 % </guimenuitem>

source: Insert Menu
km: បញ្ចូលម៉ឺនុយ

source: <guimenu>Insert</guimenu> <guisubmenu>Variable</guisubmenu>
km: <guimenu> បញ្ចូល </guimenu><guisubmenu> អថេរ </guisubmenu>

source: Here you can insert a variable that is filled in with a value that may be updated as you update the document.
km: នៅទីនេះអ្នកអាចបញ្ចូលអថេរមួយដែលត្រូវបានបំពេញដោយតម្លៃដែលអាចត្រូវបានធ្វើបច្ចុប្បន្នភាពនៅពេលអ្នកធ្វើបច្ចុប្បន្នភាពឯកសារ។

source: <guimenu>Insert</guimenu><guimenuitem>Import Slideshow...</guimenuitem>
km: <guimenu> បញ្ចូល </guimenu><guimenuitem> នាំចូលការបញ្ចាំងស្លាយ ... </guimenuitem>
