Repository: koompi/kde-khmer-translation
Catalog: Documentation in stable KF5-based/docmessages/calligra/stage_menus.po
Languages: km

source: <action>Insert an already existing presentation.</action> A standard &kde; file open dialog will appear, allowing you to choose a <guilabel>OpenDocument Presentation</guilabel> (.odp), which will be inserted after the last slide in your current presentation.
km: <action> បញ្ចូលបទបង្ហាញដែលមានស្រាប់។ </action> KDE ស្តង់ដារមួយ; ប្រអប់បើកឯកសារនឹងលេចឡើងដែលអនុញ្ញាត ឲ្យ អ្នកជ្រើសរើស <guilabel> បទបង្ហាញ OpenDocument </guilabel> (.odp) ដែលនឹងត្រូវបានបញ្ចូលបន្ទាប់ពីស្លាយចុងក្រោយនៅក្នុងបទបង្ហាញបច្ចុប្បន្នរបស់អ្នក។

source: <guimenu>Insert</guimenu> <guimenuitem>Insert Pictures as Slides...</guimenuitem>
km: <guimenu> បញ្ចូល </guimenu><guimenuitem> បញ្ចូលរូបភាពជាស្លាយ ... </guimenuitem>

source: Use this menu item to insert one or more pictures, each is inserted on a new slide. This is useful for the people who want to use &stage; to make a slide show.
km: ប្រើធាតុម៉ឺនុយនេះដើម្បីបញ្ចូលរូបភាពមួយឬច្រើនដែលនីមួយៗត្រូវបានបញ្ចូលនៅលើស្លាយថ្មី។ នេះមានប្រយោជន៍សម្រាប់មនុស្សដែលចង់ប្រើដំណាក់កាល; ដើម្បីបញ្ចាំងស្លាយ។

source: <guimenu>Insert</guimenu> <guimenuitem>Scan Image...</guimenuitem>
km: <guimenu> បញ្ចូល </guimenu><guimenuitem> ស្កេនរូបភាព ... </guimenuitem>

source: <action>Scan an image with a scanner.</action> This requires you have a scanner installed. It opens a scan dialog to allow the use of the scanner.
km: <action> ស្កេនរូបភាពជាមួយម៉ាស៊ីនស្កេន។ </action> នេះតម្រូវឱ្យអ្នកតំឡើងម៉ាស៊ីនស្កេន។ វាបើកប្រអប់ស្កេនដើម្បីអនុញ្ញាតឱ្យប្រើម៉ាស៊ីនស្កេន។

source: Format Menu
km: ម៉ឺនុយទ្រង់ទ្រាយ

source: <guimenu>Format</guimenu> <guimenuitem>Font...</guimenuitem>
km: <guimenu> ទ្រង់ទ្រាយ </guimenu><guimenuitem> ពុម្ពអក្សរ ... </guimenuitem>

source: The <guilabel>Select Font</guilabel> dialog contains options for selected segments of text.
km: នេះ <guilabel> ជ្រើសរើសពុម្ពអក្សរ </guilabel> ប្រអប់មានជម្រើសសម្រាប់ផ្នែកអត្ថបទដែលបានជ្រើសរើស។

source: With this dialog, you can <action>change the font, style and size of selected text</action>. The <interface>preview box</interface> at the bottom allows you to <action>approximate changes before you make them</action>.
km: ជាមួយប្រអប់នេះអ្នកអាចធ្វើបាន <action> ផ្លាស់ប្តូរពុម្ពអក្សរ, រចនាប័ទ្មនិងទំហំនៃអត្ថបទដែលបានជ្រើស </action> ។ នេះ <interface> ប្រអប់មើលជាមុន </interface> នៅខាងក្រោមអនុញ្ញាតឱ្យអ្នកធ្វើ <action> ការផ្លាស់ប្តូរប្រហាក់ប្រហែលមុនពេលអ្នកធ្វើវា </action>

source: <shortcut> <keycombo action="simul"> &Ctrl;&Alt;<keycap>P</keycap> </keycombo> </shortcut> <guimenu>Format</guimenu> <guimenuitem>Paragraph...</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) ជំនួស (Alt); <keycap> ទំ </keycap></keycombo></shortcut><guimenu> ទ្រង់ទ្រាយ </guimenu><guimenuitem> កថាខណ្ឌ ... </guimenuitem>

source: The <guilabel>Paragraph Format</guilabel> dialog contains settings for larger blocks of text, such as paragraphs. Using this dialog, you can set indenting, line spacing, bullet/numbered list and border settings.
km: នេះ <guilabel> ទ្រង់ទ្រាយកថាខណ្ឌ </guilabel> ប្រអប់មានការកំណត់សម្រាប់អត្ថបទធំ ៗ ដូចជាកថាខណ្ឌ។ ដោយប្រើប្រអប់នេះអ្នកអាចកំណត់ការចូលបន្ទាត់គម្លាតបន្ទាត់បញ្ជីចំណុច / លេខរៀងនិងការកំណត់ព្រំដែន។

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Format</guimenu> <guimenuitem>Style Manager</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) ជំនួស (Alt); <keycap> ស </keycap></keycombo></shortcut><guimenu> ទ្រង់ទ្រាយ </guimenu><guimenuitem> កម្មវិធីគ្រប់គ្រងស្ទីល </guimenuitem>

source: The <guilabel>Style Manager</guilabel> allows you to create an entire set of attributes that will be applied to selected text all at once.
km: នេះ <guilabel> កម្មវិធីគ្រប់គ្រងស្ទីល </guilabel> អនុញ្ញាតឱ្យអ្នកបង្កើតសំណុំគុណលក្ខណៈទាំងមូលដែលនឹងត្រូវបានអនុវត្តចំពោះអត្ថបទដែលបានជ្រើសរើសក្នុងពេលតែមួយ។

source: <guimenu>Format</guimenu> <guimenuitem>Page Layout...</guimenuitem>
km: <guimenu> ទ្រង់ទ្រាយ </guimenu><guimenuitem> ប្លង់ទំព័រ ... </guimenuitem>

source: Allows you to set the page details. You can specify the margins, the orientation, either portrait (higher than wide) or Landscape (wider than high) formats. There are many templates, such as screen, A4, US legal.
km: អនុញ្ញាតឱ្យអ្នកកំណត់ពត៌មានលំអិតទំព័រ។ អ្នកអាចបញ្ជាក់រឹម, ទិស, ទាំងបញ្ឈរ (ខ្ពស់ជាងទទឹង) ឬទ្រង់ទ្រាយផ្ដេក (ធំជាងខ្ពស់) ។ មានគំរូជាច្រើនដូចជាស្គ្រីនអេ ៤ អាមេរិចស្របច្បាប់។

source: Slide Menu
km: ម៉ឺនុយស្លាយ

source: <guimenu>Slide</guimenu> <guimenuitem>Insert Slide</guimenuitem>
km: <guimenu> រុញ </guimenu><guimenuitem> បញ្ចូលស្លាយ </guimenuitem>

source: Insert a new slide after the current one.
km: បញ្ចូលស្លាយថ្មីបន្ទាប់ពីស្លាយបច្ចុប្បន្ន។

source: <guimenu>Slide</guimenu> <guimenuitem>Copy Slide</guimenuitem>
km: <guimenu> រុញ </guimenu><guimenuitem> ចម្លងស្លាយ </guimenuitem>

source: Copy the current slide to the clipboard.
km: ចម្លងស្លាយបច្ចុប្បន្នទៅក្ដារតម្បៀតខ្ទាស់។

source: <guimenu>Slide</guimenu> <guimenuitem>Delete Slide</guimenuitem>
km: <guimenu> រុញ </guimenu><guimenuitem> លុបស្លាយ </guimenuitem>

source: <action>Delete the current page from the presentation.</action> You will be asked to confirm this action.
km: <action> លុបទំព័របច្ចុប្បន្នចេញពីបទបង្ហាញ។ </action> អ្នកនឹងត្រូវបានស្នើសុំឱ្យបញ្ជាក់ពីសកម្មភាពនេះ។

source: <shortcut><keycap>PageUp</keycap></shortcut> <guimenu>Slide</guimenu> <guimenuitem>Previous Slide</guimenuitem>
km: <shortcut><keycap> គេហទំព័រ </keycap></shortcut><guimenu> រុញ </guimenu><guimenuitem> ស្លាយមុន </guimenuitem>

source: Go back to the previous slide in the slide show.
km: ត្រលប់ទៅស្លាយមុននៅក្នុងការបញ្ចាំងស្លាយ។

source: <shortcut><keycap>PageDown</keycap></shortcut> <guimenu>Slide</guimenu> <guimenuitem>Next Slide</guimenuitem>
km: <shortcut><keycap> ទំព័រ </keycap></shortcut><guimenu> រុញ </guimenu><guimenuitem> ស្លាយបន្ទាប់ </guimenuitem>

source: Go to the next slide in the slide show.
km: ទៅកាន់ស្លាយបន្ទាប់នៅក្នុងការបញ្ចាំងស្លាយ។

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Home</keycap></keycombo></shortcut> <guimenu>Slide</guimenu> <guimenuitem>First Slide</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> ផ្ទះ </keycap></keycombo></shortcut><guimenu> រុញ </guimenu><guimenuitem> ស្លាយដំបូង </guimenuitem>

source: Go directly to the first slide in the slide show.
km: ចូលដោយផ្ទាល់ទៅស្លាយទីមួយនៅក្នុងការបញ្ចាំងស្លាយ។

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo></shortcut> <guimenu>Slide</guimenu> <guimenuitem>Last Slide</guimenuitem>
km: <shortcut><keycombo action="simul"> បញ្ជា (Ctrl) <keycap> បញ្ចប់ </keycap></keycombo></shortcut><guimenu> រុញ </guimenu><guimenuitem> ស្លាយចុងក្រោយ </guimenuitem>

source: Go immediately to the final slide in the slide show.
km: ទៅភ្លាមៗទៅស្លាយចុងក្រោយនៅក្នុងការបញ្ចាំងស្លាយ។

source: Slide Show Menu
km: ម៉ឺនុយបញ្ចាំងស្លាយ

source: <shortcut><keycombo action="simul">&Shift;<keycap>F5</keycap></keycombo></shortcut> <guimenu>Slide Show</guimenu> <guisubmenu>Start Presentation</guisubmenu> <guimenuitem>From Current Slide</guimenuitem>
km: <shortcut><keycombo action="simul"> ការផ្លាស់ប្តូរ; <keycap> F5 </keycap></keycombo></shortcut><guimenu> បញ្ចាំងស្លាយ </guimenu><guisubmenu> ចាប់ផ្តើមបទបង្ហាញ </guisubmenu><guimenuitem> ពីស្លាយបច្ចុប្បន្ន </guimenuitem>

source: Begin the slideshow from the current slide.
km: ចាប់ផ្តើមការបញ្ចាំងស្លាយពីស្លាយបច្ចុប្បន្ន។

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Slide Show</guimenu> <guisubmenu>Start Presentation</guisubmenu> <guimenuitem>From First Slide</guimenuitem>
km: <shortcut><keycap> F5 </keycap></shortcut><guimenu> បញ្ចាំងស្លាយ </guimenu><guisubmenu> ចាប់ផ្តើមបទបង្ហាញ </guisubmenu><guimenuitem> ពីស្លាយទីមួយ </guimenuitem>

source: Begin the slideshow from the first slide.
km: ចាប់ផ្តើមការបញ្ចាំងស្លាយពីស្លាយទីមួយ។

source: <guimenu>Slide Show</guimenu> <guimenuitem>Configure Slide Show...</guimenuitem>
km: <guimenu> បញ្ចាំងស្លាយ </guimenu><guimenuitem> កំណត់រចនាសម្ព័ន្ធបញ្ចាំងស្លាយ ... </guimenuitem>

source: You can set up the properties for the entire slide show here, including whether to show the duration on screen, which of the slides in a presentation to include, and several other global settings.
km: អ្នកអាចតំឡើងលក្ខណសម្បត្តិសម្រាប់ការបញ្ចាំងស្លាយទាំងមូលនៅទីនេះរួមទាំងថាតើត្រូវបង្ហាញថិរវេលានៅលើអេក្រង់ដែលស្លាយមួយនៅក្នុងបទបង្ហាញដែលត្រូវដាក់បញ្ចូលនិងការកំណត់សកលផ្សេងទៀត។

source: Settings Menu
km: ការកំណត់ម៉ឺនុយ

source: The <guimenu>Settings</guimenu> menu allows you to customize &stage;.
km: នេះ <guimenu> ការកំណត់ </guimenu> ម៉ឺនុយអនុញ្ញាតឱ្យអ្នកប្ដូរតាមបំណងដំណាក់កាល;

source: <guimenu>Settings</guimenu> <guisubmenu>Show Toolbar</guisubmenu>
km: <guimenu> ការកំណត់ </guimenu><guisubmenu> បង្ហាញរបារឧបករណ៍ </guisubmenu>

source: In this menu you can both enable and disable the display of toolbar.
km: នៅក្នុងម៉ឺនុយនេះអ្នកអាចបើកនិងបិទការបង្ហាញរបារឧបករណ៍បាន។

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
km: <guimenu> ការកំណត់ </guimenu><guimenuitem> កំណត់រចនាសម្ព័ន្ធផ្លូវកាត់ ... </guimenuitem>

source: <guimenuitem>Configure Shortcuts</guimenuitem> allows you to assign a keyboard shortcut to actions that &stage; menus or icons contain.
km: <guimenuitem> កំណត់រចនាសម្ព័ន្ធផ្លូវកាត់ </guimenuitem> អនុញ្ញាតឱ្យអ្នកកំណត់ផ្លូវកាត់ក្តារចុចទៅសកម្មភាពដែលដំណាក់កាល; ម៉ឺនុយឬរូបតំណាងមាន។

source: Customize Shortcuts
km: ប្ដូរផ្លូវកាត់តាមបំណង

source: Customizing the shortcuts
km: ប្ដូរផ្លូវកាត់តាមបំណង

source: If you try to assign a shortcut that is already used, it will give you a warning message. Highlight what you want to do (in the picture, I have chosen to make a keyboard shortcut to <guilabel>About KDE</guilabel>).
km: ប្រសិនបើអ្នកព្យាយាមកំណត់ផ្លូវកាត់ដែលត្រូវបានប្រើរួចហើយវានឹងផ្តល់ឱ្យអ្នកនូវសារព្រមាន។ រំលេចអ្វីដែលអ្នកចង់ធ្វើ (ក្នុងរូបភាពខ្ញុំបានជ្រើសរើសធ្វើផ្លូវកាត់ក្តារចុច <guilabel> អំពី KDE </guilabel> ) ។

source: Click the radio button to the <guilabel>Custom</guilabel> key setting and type the key you want to use. I assigned <keycap>Control</keycap> key and <keycap>Y</keycap> to bring up the <quote>About KDE</quote> dialog box.
km: ចុចប៊ូតុងវិទ្យុទៅឯកសារ <guilabel> ផ្ទាល់ខ្លួន </guilabel> ការកំណត់និងវាយបញ្ចូលកូនសោដែលអ្នកចង់ប្រើ។ ខ្ញុំបានចាត់តាំង <keycap> ការត្រួតពិនិត្យ </keycap> គន្លឹះនិង <keycap> អ៊ី </keycap> ដើម្បីនាំយកឡើង <quote> អំពី KDE </quote> ប្រអប់។

source: The button shows what has been assigned. Click <guibutton>OK</guibutton> to make the changes, click <guibutton>Default</guibutton> to restore whatever was assigned as default, click <guibutton>Cancel</guibutton> to do nothing and leave the dialog.
km: ប៊ូតុងបង្ហាញពីអ្វីដែលបានកំណត់។ ចុច <guibutton> យល់ព្រម </guibutton> ដើម្បីធ្វើការផ្លាស់ប្តូរសូមចុច <guibutton> លំនាំដើម </guibutton> ដើម្បីស្តារអ្វីៗដែលបានកំណត់ជាលំនាំដើមចុច <guibutton> បោះបង់ </guibutton> កុំធ្វើអ្វីទាំងអស់ហើយទុកឱ្យប្រអប់។

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
km: <guimenu> ការកំណត់ </guimenu><guimenuitem> កំណត់រចនាសម្ព័ន្ធរបារឧបករណ៍ ... </guimenuitem>

source: Configure Toolbars allows you to add or delete icons on each of the toolbars.
km: កំណត់រចនាសម្ព័ន្ធរបារឧបករណ៍អនុញ្ញាតឱ្យអ្នកបន្ថែមឬលុបរូបតំណាងនៅលើរបារឧបករណ៍នីមួយៗ។

source: <screeninfo>Configuring &stage; toolbars</screeninfo>
km: <screeninfo> កំណត់រចនាសម្ព័ន្ធដំណាក់កាល; របារឧបករណ៍ </screeninfo>

source: <phrase>Configuring &stage; toolbars</phrase>
km: <phrase> កំណត់រចនាសម្ព័ន្ធដំណាក់កាល; របារឧបករណ៍ </phrase>

source: At the top is a drop down box to enable you to choose which toolbar you want to modify. In the picture the <guilabel>File</guilabel> toolbar is selected. If I want to add the <guiicon>Dockers</guiicon> icon to that toolbar, I click the entry in the left window. The arrow pointing right becomes available, if I click the arrow the <guiicon>Dockers</guiicon> entry is added to the selected toolbar. The left arrow is available when you click in the right side window. It allows you to remove an icon from a toolbar. The up and down arrows become active when an item on the right side is selected. You can also move the highlight in the right side window up and down with the keyboard arrow keys. By clicking on the arrows with the mouse you can change the order of the entries in the menu.
km: នៅផ្នែកខាងលើគឺជាប្រអប់ធ្លាក់ចុះដើម្បីឱ្យអ្នកជ្រើសរើសរបារឧបករណ៍ណាមួយដែលអ្នកចង់កែប្រែ។ នៅក្នុងរូបភាពនេះ <guilabel> ឯកសារ </guilabel> របារឧបករណ៍ត្រូវបានជ្រើសរើស។ ប្រសិនបើខ្ញុំចង់បន្ថែមឯកសារ <guiicon> អ្នកចត </guiicon> រូបតំណាងនៅលើរបារឧបករណ៍នោះខ្ញុំចុចលើធាតុនៅខាងឆ្វេង។ ព្រួញចង្អុលខាងស្តាំអាចប្រើបានប្រសិនបើខ្ញុំចុចព្រួញ <guiicon> អ្នកចត </guiicon> ធាតុត្រូវបានបន្ថែមទៅរបារឧបករណ៍ដែលបានជ្រើស។ ព្រួញខាងឆ្វេងអាចប្រើបាននៅពេលអ្នកចុចលើផ្ទាំងកម្មវិធីខាងស្តាំ។ វាអនុញ្ញាតឱ្យអ្នកដករូបតំណាងចេញពីរបារឧបករណ៍។ ព្រួញឡើងលើនិងចុះក្រោមក្លាយជាសកម្មនៅពេលដែលធាតុនៅផ្នែកខាងស្តាំត្រូវបានជ្រើសរើស។ អ្នកក៏អាចផ្លាស់ទីបន្លិចនៅក្នុងផ្ទាំងកម្មវិធីផ្នែកខាងស្តាំឡើងលើនិងចុះក្រោមដោយប្រើគ្រាប់ចុចព្រួញក្តារចុច។ ដោយចុចលើព្រួញដោយប្រើកណ្តុរអ្នកអាចផ្លាស់ប្តូរលំដាប់នៃធាតុនៅក្នុងម៉ឺនុយ។

source: <guimenu>Settings</guimenu> <guimenuitem>Themes</guimenuitem>
km: <guimenu> ការកំណត់ </guimenu><guimenuitem> ស្បែក </guimenuitem>

source: <action>Choose the color theme for &stage; window.</action> You can choose one of the predefined color schemes or select <guimenuitem>Configuration...</guimenuitem> to open <ulink url="help:/kcontrol/colors">&systemsettings; color selection module</ulink>.
km: <action> ជ្រើសរើសប្រធានបទពណ៌សម្រាប់ឆាក; ផ្ទាំងកម្មវិធី </action> អ្នកអាចជ្រើសរើសពណ៌ចម្រុះដែលបានកំណត់ជាមុនឬជ្រើសរើស <guimenuitem> ការកំណត់​រចនាសម្ព័ន្ធ... </guimenuitem> បើក <ulink url="help:/kcontrol/colors"> systemsettings; ម៉ូឌុលជ្រើសរើសពណ៌ </ulink>

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Stage...</guimenuitem>
km: <guimenu> ការកំណត់ </guimenu><guimenuitem> តំឡើងតំណាក់កាល ... </guimenuitem>

source: See the <link linkend="configure-dialog">Configure &stage;</link> section for a complete explanation of all &stage; settings.
km: សូមមើលឯកសារ <link linkend="configure-dialog"> កំណត់រចនាសម្ព័ន្ធដំណាក់កាល; </link> ផ្នែកសម្រាប់ការពន្យល់ពេញលេញនៃដំណាក់កាលទាំងអស់; ការកំណត់។

source: Help Menu
km: បញ្ជីជំនួយ

source: &help.menu.documentation;
km: ជំនួយ។ មីនុយ។​ អត្ធបទ;
