Repository: koompi/kde-khmer-translation
Catalog: Documentation in stable KF5-based/docmessages/calligra/stage_options.po
Languages: km

source: Configuring &stage;
km: កំណត់រចនាសម្ព័ន្ធដំណាក់កាល;

source: The Configure - Stage Dialog
km: កំណត់រចនាសម្ព័ន្ធ - ប្រអប់ដំណាក់កាល

source: <title>Misc</title>
km: <title> ផ្សេងៗ </title>

source: <screeninfo>Misc</screeninfo>
km: <screeninfo> ផ្សេងៗ </screeninfo>

source: <phrase>Misc</phrase>
km: <phrase> ផ្សេងៗ </phrase>

source: Units
km: ឯកតា

source: Choose the default unit that will be used in your slides.
km: ជ្រើសរើសឯកតាលំនាំដើមដែលនឹងត្រូវប្រើក្នុងស្លាយរបស់អ្នក។

source: Handle radius
km: ដោះស្រាយកាំ

source: If you select a shape with the default tool (arrow) you see the yellow and red rectangles. These are called handles (used for resizing, rotation, ...). The handle radius changes the size of the handles. If you make them bigger it is easier to hit them.
km: ប្រសិនបើអ្នកជ្រើសរើសរូបរាងដោយប្រើឧបករណ៍ព្រួញ (ព្រួញ) អ្នកនឹងឃើញចតុកោណកែងពណ៌លឿងនិងក្រហម។ ទាំងនេះត្រូវបានគេហៅថាចំណុចទាញ (ប្រើសម្រាប់ប្តូរទំហំ, បង្វិល, ... ) ។ កាំចំណុចទាញផ្លាស់ប្តូរទំហំនៃចំណុចទាញ។ ប្រសិនបើអ្នកធ្វើឱ្យពួកគេធំជាងមុនវាងាយស្រួលក្នុងការវាយពួកគេ។

source: Grab sensitivity
km: ចាប់យកអារម្មណ៍

source: This option defines how exactly you need to hit a handle to select it.
km: ជម្រើសនេះកំណត់ថាតើអ្នកត្រូវការវាយចំណុចទាញដើម្បីជ្រើសរើសវាយ៉ាងដូចម្តេច។

source: Paste offset
km: បិទភ្ជាប់អុហ្វសិត

source: This is only active if <guilabel>Paste at Cursor</guilabel> is disabled. If you copy a shape with the shortcut <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> and paste it with <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo>, and do that at a place where already a shape is this offset is used to paste the new shape to the bottom/right.
km: នេះសកម្មតែក្នុងករណី <guilabel> បិទភ្ជាប់នៅទស្សន៍ទ្រនិច </guilabel> ត្រូវបានបិទ។ ប្រសិនបើអ្នកចម្លងរូបរាងដោយប្រើផ្លូវកាត់ <keycombo action="simul"> បញ្ជា (Ctrl) <keycap> គ </keycap></keycombo> ហើយបិទភ្ជាប់វាជាមួយ <keycombo action="simul"> បញ្ជា (Ctrl) <keycap> វី </keycap></keycombo> ហើយធ្វើនៅកន្លែងដែលមានរូបរាងរួចហើយអុហ្វសិតនេះត្រូវបានប្រើដើម្បីបិទភ្ជាប់រាងថ្មីទៅខាងក្រោម / ខាងស្ដាំ។

source: Paste at Cursor
km: បិទភ្ជាប់នៅទស្សន៍ទ្រនិច

source: Disables the paste offset and insert a pasted shape at the mouse cursor position.
km: បិទអុហ្វសិតបិទភ្ជាប់និងបញ្ចូលរាងបិទភ្ជាប់នៅទីតាំងទស្សន៍ទ្រនិចកណ្តុរ។

source: <title>Grid</title>
km: <title> ក្រឡាចត្រង្គ </title>

source: <screeninfo>Grid</screeninfo>
km: <screeninfo> ក្រឡាចត្រង្គ </screeninfo>

source: <phrase>Grid</phrase>
km: <phrase> ក្រឡាចត្រង្គ </phrase>

source: <guilabel>Grid</guilabel>
km: <guilabel> ក្រឡាចត្រង្គ </guilabel>

source: Show grid
km: បង្ហាញក្រឡាចត្រង្គ

source: If enabled, &stage; will display a grid of dots representing the intersections of imaginary horizontal and vertical lines. You can use these dots to precisely position objects on the slide.
km: ប្រសិនបើបានបើកដំណើរការ; នឹងបង្ហាញក្រឡាចត្រង្គនៃចំនុចតំណាងអោយចំនុចប្រសព្វនៃបន្ទាត់ផ្តេកនិងបញ្ឈរ។ អ្នកអាចប្រើចំណុចទាំងនេះដើម្បីកំណត់ទីតាំងវត្ថុនៅលើស្លាយ។

source: Snap to grid
km: ខ្ទាស់ទៅក្រឡាចត្រង្គ

source: If this is enabled, when dropping or moving objects on the slide the top left corner of the object will <quote>snap</quote> or move, to the nearest grid point.
km: ប្រសិនបើបើកដំណើរការនៅពេលទម្លាក់ឬផ្លាស់ទីវត្ថុលើស្លាយជ្រុងខាងឆ្វេងខាងលើនៃវត្ថុនឹង <quote> ខ្ទាស់ </quote> ឬផ្លាស់ទីទៅចំណុចក្រឡាចត្រង្គដែលនៅជិតបំផុត។

source: This does reduce your freedom to freely position objects on the slide, however it also helps to line up objects precisely. It is easily disabled or enabled with this option, allowing you the best of both worlds.
km: នេះពិតជាកាត់បន្ថយសេរីភាពរបស់អ្នកក្នុងការដាក់វត្ថុនៅលើស្លាយដោយសេរីទោះយ៉ាងណាវាក៏ជួយតម្រង់ជួរវត្ថុយ៉ាងជាក់លាក់ដែរ។ វាត្រូវបានបិទឬបើកដំណើរការបានយ៉ាងងាយស្រួលជាមួយជម្រើសនេះដែលអនុញ្ញាតឱ្យអ្នកមានភាពល្អបំផុតនៃពិភពលោកទាំងពីរ។

source: Grid color:
km: ពណ៌ក្រឡាចត្រង្គ៖

source: You can change here the grid color which is black as default.
km: អ្នកអាចប្តូរពណ៌ក្រឡាចត្រង្គដែលមានពណ៌ខ្មៅជាលំនាំដើម។

source: Spacing
km: គម្លាត

source: You can choose to keep the same ratio for the two settings below by having the <inlinemediaobject><imageobject> <imagedata fileref="link.png" format="PNG"/></imageobject></inlinemediaobject> icon or to separate the two settings by using the <inlinemediaobject><imageobject> <imagedata fileref="break.png" format="PNG"/></imageobject></inlinemediaobject> icon.
km: អ្នកអាចជ្រើសដើម្បីរក្សាសមាមាត្រដូចគ្នាសម្រាប់ការកំណត់ពីរខាងក្រោមដោយមានលេខកូដ <inlinemediaobject><imageobject><imagedata fileref="link.png" format="PNG"/></imageobject></inlinemediaobject> រូបតំណាងឬដើម្បីបំបែកការកំណត់ទាំងពីរដោយប្រើប៊ូតុង <inlinemediaobject><imageobject><imagedata fileref="break.png" format="PNG"/></imageobject></inlinemediaobject> រូបតំណាង។

source: Horizontal:
km: ផ្តេក៖

source: Set the space in centimeters between two points on an horizontal line on the grid. Default is 0.5 centimeter.
km: កំណត់ចន្លោះគិតជាសង់ទីម៉ែត្ររវាងពីរចំនុចនៅលើបន្ទាត់ផ្តេកនៅលើក្រឡាចត្រង្គ។ លំនាំដើមគឺ 0,5 សង់ទីម៉ែត្រ។

source: Vertical:
km: បញ្ឈរ៖

source: Set the space in centimeters between two points on a vertical line on the grid. Default is 0.5 centimeter.
km: កំណត់ចន្លោះគិតជាសង់ទីម៉ែត្ររវាងពីរចំនុចនៅលើបន្ទាត់បញ្ឈរនៅលើក្រឡាចត្រង្គ។ លំនាំដើមគឺ 0,5 សង់ទីម៉ែត្រ។

source: <title>Document</title>
km: <title> ឯកសារ </title>

source: <screeninfo>Document</screeninfo>
km: <screeninfo> ឯកសារ </screeninfo>

source: <phrase>Document</phrase>
km: <phrase> ឯកសារ </phrase>

source: Document Settings
km: ការកំណត់ឯកសារ

source: Autosave interval:
km: ចន្លោះពេលរក្សាទុកស្វ័យប្រវត្តិ៖

source: You can use this to adjust how often &stage; saves a temporary file. If you set this value to <guilabel>No autosave</guilabel>, &stage; will not autosave. You can adjust the autosave from 1 minute to 60 minutes.
km: អ្នកអាចប្រើវាដើម្បីកែតម្រូវដំណាក់កាលដែលបានញឹកញាប់។ រក្សាទុកឯកសារបណ្តោះអាសន្ន។ ប្រសិនបើអ្នកកំណត់តម្លៃនេះទៅ <guilabel> មិនរក្សាទុកដោយស្វ័យប្រវត្តិទេ </guilabel> , ដំណាក់កាល; នឹងមិនរក្សាទុកដោយស្វ័យប្រវត្តិទេ។ អ្នកអាចកែសំរួលស្វ័យប្រវត្តិពី ១ នាទីទៅ ៦០ នាទី។

source: Create backup file:
km: បង្កើតឯកសារបម្រុងទុក៖

source: If checked, this will create a <filename>.&lt;name&gt;.odp.autosave.odp</filename> in the folder where your file is. This backup file can then be used in case of a problem. The backup file is updated everytime you save your document or everytime there is an autosave.
km: បើធីកវានឹងបង្កើតឯកសារ <filename> .lt; namegt; .odp.autosave.odp </filename> នៅក្នុងសឺមីដែលឯកសាររបស់អ្នកស្ថិតនៅ។ ឯកសារបម្រុងទុកនេះអាចត្រូវបានប្រើក្នុងករណីមានបញ្ហា។ ឯកសារបម្រុងទុកត្រូវបានធ្វើបច្ចុប្បន្នភាពរៀងរាល់ពេលដែលអ្នករក្សាទុកឯកសាររបស់អ្នកឬរាល់ពេលដែលមានរក្សាទុកដោយស្វ័យប្រវត្តិ។

source: <title>Author</title>
km: <title> អ្នកនិពន្ធ </title>

source: <screeninfo>Author</screeninfo>
km: <screeninfo> អ្នកនិពន្ធ </screeninfo>

source: Choose an author profile for your document.
km: ជ្រើសរើសទម្រង់អ្នកនិពន្ធសម្រាប់ឯកសាររបស់អ្នក។

source: You can add a new profile or delete the current profile using the buttons to the right of the profiles drop-down list.
km: អ្នកអាចបន្ថែមទម្រង់ថ្មីឬលុបទម្រង់បច្ចុប្បន្នដោយប្រើប៊ូតុងនៅខាងស្តាំនៃបញ្ជីទម្លាក់ចុះទម្រង់។
