Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/alkimia/alkimia.po
Languages: km

source: Source <placeholder>%1</placeholder> does not exist.
km: ប្រភព <placeholder> %1 </placeholder> មិន​មាន។

source: Unable to fetch url for %1
km: មិនអាចទៅយក url សម្រាប់ %1

source: Symbol found: '%1'
km: បានរកឃើញនិមិត្តសញ្ញា៖ '%1'

source: Unable to parse symbol for %1
km: មិនអាចញែកនិមិត្តសញ្ញាសម្រាប់ %1

source: Fetching URL %1...
km: កំពុងទៅយក URL %1 ...

# The process x is executing
source: Executing %1...
km: ប្រតិបត្តិ %1 ...

source: Unable to launch: %1
km: មិនអាចដំណើរការបានទេ៖ %1

source: URL found: %1...
km: រកឃើញ URL៖ %1 ...

source: Failed to open downloaded file
km: បានបរាជ័យក្នុងការបើកឯកសារដែលបានទាញយក

# Executing 'script' 'online source' 'investment symbol'
source: Executing %1 %2 %3...
km: ប្រតិបត្តិ %1 %2 %3 ...

source: Price found: '%1' (%2)
km: តម្លៃបានរកឃើញ៖ '%1' (%2)

source: Unable to parse price for '%1'
km: មិនអាចញែកតម្លៃសម្រាប់ '%1'

source: Date found: '%1'
km: កាលបរិច្ឆេទបានរកឃើញ៖ '%1'

source: Date format found: '%1' -> '%2'
km: បានរកឃើញទ្រង់ទ្រាយកាលបរិច្ឆេទ៖ '%1' -> '%2'

source: Unable to parse date '%1' using format '%2': %3
km: មិនអាចញែកកាលបរិច្ឆេទ '%1' ដោយប្រើទ្រង់ទ្រាយ '%2'៖ %3

source: Using current date for '%1'
km: ប្រើកាលបរិច្ឆេទបច្ចុប្បន្នសម្រាប់ '%1'

source: Parsing date is disabled for '%1'
km: កាលបរិច្ឆេទនៃការញាស់ត្រូវបានបិទសម្រាប់ '%1'

source: Unable to parse date for '%1'
km: មិនអាចញែកកាលបរិច្ឆេទសម្រាប់ '%1'

source: Unable to update price for %1 (empty quote data)
km: មិនអាចធ្វើបច្ចុប្បន្នភាពតម្លៃសម្រាប់ %1 (ទិន្នន័យសម្រង់ទទេ)

# Accepts the entered data and stores it
source: &Accept
km: ព្រមទទួល

source: Accepts the entered data and stores it
km: ទទួលយកទិន្នន័យដែលបានបញ្ចូលហើយរក្សាទុកវា

source: Use this to accept the modified data.
km: ប្រើវាដើម្បីទទួលយកទិន្នន័យដែលបានកែប្រែ។

source: &Delete
km: លុប

source: Delete the selected source entry
km: លុបធាតុប្រភពដែលបានជ្រើសរើស

source: Use this to delete the selected online source entry
km: ប្រើវាដើម្បីលុបធាតុប្រភពលើអ៊ីនធឺណិតដែលបានជ្រើសរើស

# Check the selected source entry
source: &Check Source
km: ពិនិត្យប្រភព

source: Check the selected source entry
km: ពិនិត្យមើលធាតុដែលបានជ្រើសរើស

source: Use this to check the selected online source entry
km: ប្រើវាដើម្បីពិនិត្យមើលធាតុប្រភពដែលបានជ្រើសរើសតាមអ៊ីនធឺណិត

# Show the selected source entry in a web browser
source: &Show page
km: បង្ហាញទំព័រ

source: Show the selected source entry in a web browser
km: បង្ហាញធាតុបញ្ចូលដែលបានជ្រើសរើសនៅក្នុងកម្មវិធីអ៊ីនធឺណិត

source: Use this to show the selected online source entry
km: ប្រើវាដើម្បីបង្ហាញធាតុបញ្ចូលលើអ៊ីនធឺណិតដែលបានជ្រើសរើស

# Create a new source entry for online quotes
source: &New...
km: ថ្មី ...

source: Create a new source entry for online quotes
km: បង្កើតធាតុប្រភពថ្មីសម្រាប់សម្រង់តាមអ៊ីនធឺណិត

source: Use this to create a new entry for online quotes
km: ប្រើវាដើម្បីបង្កើតធាតុថ្មីសម្រាប់សម្រង់តាមអ៊ីនធឺណិត

source: Name
km: ឈ្មោះ

source: Source
km: ប្រភព

source: GHNS Source
km: ប្រភព GHNS

source: Finance::Quote
km: ហិរញ្ញវត្ថុ ៖៖ ដកស្រង់

source: local
km: ក្នុងស្រុក

source: New Quote Source
km: ប្រភពដកស្រង់ថ្មី

source: Are you sure to delete this online quote ?
km: តើអ្នកប្រាកដជាចង់លុបសម្រង់តាមអ៊ីនធឺណិតនេះឬ?

source: Delete online quote
km: លុបសម្រង់តាមអ៊ីនធឺណិត

source: .copy
km: .ចម្លង

source: Online Quote HTML Result Window
km: ផ្ទាំងលទ្ធផល HTML លើអ៊ីនធឺណិត

source: Online Quotes
km: សម្រង់តាមអ៊ីនធឺណិត

source: <html><head/><body><p>Select, add or delete an application profile, where to load profiles from and save into eg. kmymoney or skrooge.</p></body></html>
km: <html><head/><body><p> ជ្រើសបន្ថែមឬលុបទម្រង់កម្មវិធីដែលត្រូវផ្ទុកប្រវត្តិរូបពីនិងរក្សាទុកទៅក្នុងឧ។ kmymoney ឬ skrooge ។ </p></body></html>

source: Application Profiles
km: ទម្រង់ពាក្យសុំ

source: New
km: ថ្មី

source: Delete
km: លុប

source: Profile details
km: ព័ត៌មានលម្អិតអំពីប្រវត្តិរូប

source: GHNS config file
km: ឯកសារកំណត់រចនាសម្ព័ន្ធ GHNS

source: Config file
km: កំណត់រចនាសម្ព័ន្ធឯកសារ

source: GHNS data path
km: ផ្លូវទិន្នន័យរបស់ GHNS

source: <html><head/><body><p>online price quotes</p></body></html>
km: <html><head/><body><p> សម្រង់តម្លៃតាមអ៊ីនធឺណិត </p></body></html>

# @action create new quote source
source: New
km: ថ្មី

source: Create a duplicate of the currently selected source entry under a different name.
km: បង្កើតស្ទួននៃធាតុប្រភពដែលបានជ្រើសរើសបច្ចុប្បន្នក្រោមឈ្មោះផ្សេង។

source: Use this to create a duplicate of an entry for an online source
km: ប្រើវាដើម្បីបង្កើតធាតុស្ទួននៃប្រភពលើអ៊ីនធឺណិត

source: Duplicate
km: ស្ទួន

source: Install
km: ដំឡើង

source: Upload
km: ផ្ទុកឡើង

source: <html><head/><body><p><span style=" font-style:italic;">Enter regular expressions which can be used to parse the data returned from the URL entered above. The symbol, price, and date must be found in the quote data to be usable. You may also try the KMyMoney forum at </span><a href="https://forum.kde.org/viewforum.php?f=69"><span style=" text-decoration: underline; color:#2980b9;">https://forum.kde.org/viewforum.php?f=69</span></a> or the <span style=" font-style:italic;">user's mailinglist at </span><a href="mailto:kmymoney@kde.org"><span style=" font-style:italic; text-decoration: underline; color:#2980b9;">kmymoney@kde.org</span></a><span style=" font-style:italic;"> to find what settings work for other users in your country.</span></p></body></html>
km: <html><head/><body><p><span style=" font-style៖italic;"> បញ្ចូលកន្សោមធម្មតាដែលអាចត្រូវបានប្រើដើម្បីញែកទិន្នន័យដែលបានត្រឡប់ពី URL ដែលបានបញ្ចូលខាងលើ។ និមិត្តសញ្ញាតម្លៃនិងកាលបរិច្ឆេទត្រូវតែរកឃើញនៅក្នុងទិន្នន័យសម្រង់ដើម្បីអាចប្រើប្រាស់បាន។ អ្នកក៏អាចសាកល្បងប្រើវេទិកាគីមីមីនីនៅ </span><a href="https៖//forum.kde.org/viewforum.php?f=69"><span style=" text-decoration៖ underline; color៖#2980b9;"> https៖//forum.kde.org/viewforum.php?f=69 </span></a> ឬ <span style=" font-style៖italic;"> បញ្ជីសំបុត្ររួមរបស់អ្នកប្រើនៅ </span><a href="mailto៖kmymoney@kde.org"><span style=" font-style៖italic; text-decoration៖ underline; color៖#2980b9;"> kmymoney@kde.org </span></a><span style=" font-style៖italic;"> ដើម្បីរកមើលថាតើការកំណត់អ្វីដំណើរការសម្រាប់អ្នកប្រើប្រាស់ផ្សេងទៀតនៅក្នុងប្រទេសរបស់អ្នក។ </span></p></body></html>

source: Details
km: ព័ត៌មានលម្អិត

source: Regular Expression to extract the date from the downloaded data
km: កន្សោមធម្មតាដើម្បីដកស្រង់កាលបរិច្ឆេទពីទិន្នន័យដែលបានទាញយក

source: Date Format
km: ទ្រង់ទ្រាយកាលបរិច្ឆេទ

source: Regular Expression to extract the symbol from the downloaded data
km: កន្សោមធម្មតាដើម្បីទាញយកនិមិត្តសញ្ញាចេញពីទិន្នន័យដែលបានទាញយក

source: Date
km: កាលបរិច្ឆេទ

source: <p>For easier processing of the data returned by the online source, KMyMoney usually strips unused parts before it is parsed with the regular expressions. If matching of the fields relies on those items, then use this option to turn stripping off.</p> <p>The following items are usually removed by stripping: <ul> <li>HTML tags such as <b>&lt;tag&gt;</b></li> <li>& encoded characters such as <b>&amp;nbsp;</b></li> <li>duplicate whitespace</li> </ul> </p>
km: <p> ដើម្បីដំណើរការទិន្នន័យកាន់តែងាយស្រួលត្រឡប់មកវិញដោយប្រភពតាមអ៊ិនធរណេត KMyMoney ជាធម្មតាច្រូតផ្នែកដែលមិនប្រើមុនពេលវាត្រូវបានញែកជាមួយកន្សោមធម្មតា។ ប្រសិនបើការផ្គូផ្គងវាលពឹងផ្អែកលើធាតុទាំងនោះបន្ទាប់មកប្រើជម្រើសនេះដើម្បីបិទ។ </p> <p> ធាតុខាងក្រោមជាធម្មតាត្រូវបានលុបដោយដក៖ <ul> <li> ស្លាក HTML ដូចជា <b> lt; taggt; </b></li> <li> តួអក្សរដែលបានអ៊ិនកូដដូចជា <b> &amp; nbsp; </b></li> <li> ចន្លោះស្ទួន </li> </ul> </p>

source: Skip HTML stripping
km: រំលងការដក HTML

source: Regular Expression to extract the price from the downloaded data
km: កន្សោមធម្មតាដើម្បីទាញយកតម្លៃពីទិន្នន័យដែលបានទាញយក

source: Options
km: ជម្រើស

source: Price
km: តម្លៃ

source: Symbol
km: និមិត្តសញ្ញា

source: URL to be used to download the quote
km: URL ដែលត្រូវប្រើដើម្បីទាញយកអត្ថបទដកស្រង់

source: Enter the URL from which stock quotes will be fetched. <b>%1</b> will be replaced with the symbol for the security being quoted. For currency conversions, <b>%2</b> will be replaced with the currency to be quoted and <b>%1</b> with the currency the quote is based on.
km: បញ្ចូល URL ដែលនឹងដកស្រង់សម្រង់ភាគហ៊ុន។ <b> %1 </b> នឹងត្រូវបានជំនួសដោយនិមិត្តសញ្ញាសម្រាប់សុវត្ថិភាពដែលបានដកស្រង់។ សម្រាប់ការប្តូររូបិយប័ណ្ណ <b> %2 </b> នឹងត្រូវបានជំនួសដោយរូបិយប័ណ្ណដែលត្រូវដកស្រង់និង <b> %1 </b> ជាមួយរូបិយប័ណ្ណការដកស្រង់ផ្អែកលើ

# @action update quotes from online quote source
source: Accept
km: ព្រមទទួល

source: Debugging
km: ការបំបាត់កំហុស

source: One Symbol
km: និមិត្តសញ្ញាមួយ

source: Two Symbols
km: និមិត្តសញ្ញាពីរ

source: Check Source
km: ពិនិត្យប្រភព

source: Show Page
km: បង្ហាញទំព័រ
