Repository: koompi/kde-khmer-translation
Catalog: Applications in stable KF5-based/messages/akregator/akregator.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: Feed readers provide a convenient way to browse different kinds of content, including news, blogs, and other content from online sites. Instead of checking all your favorite web sites manually for updates, Akregator collects the content for you.
km: អ្នកអានមតិព័ត៌មានផ្តល់នូវមធ្យោបាយងាយស្រួលក្នុងការរកមើលមាតិកាប្រភេទផ្សេងៗគ្នារួមមានព័ត៌មានប្លុកនិងមាតិកាផ្សេងទៀតពីគេហទំព័រលើអ៊ីនធឺណិត។ ជំនួសឱ្យការពិនិត្យមើលគេហទំព័រដែលអ្នកចូលចិត្តទាំងអស់ដោយដៃសម្រាប់ការធ្វើបច្ចុប្បន្នភាព Akregator ប្រមូលមាតិកាសម្រាប់អ្នក។

source: For more information about using Akregator, check the <a href='https://kontact.kde.org/components/akregator.html'>Akregator website</a>. If you do not want to see this page anymore, <a href='config:/disable_introduction'>click here</a>.
km: សម្រាប់ព័ត៌មានបន្ថែមអំពីការប្រើ Akregator សូមពិនិត្យមើលឯកសារ <a href='https៖//kontact.kde.org/components/akregator.html'> គេហទំព័រ Akregator </a> ។ ប្រសិនបើអ្នកមិនចង់មើលទំព័រនេះទៀតទេ <a href='config៖/disable_introduction'> ចុច​ទីនេះ </a>

source: We hope that you will enjoy Akregator.
km: យើងសង្ឃឹមថាអ្នកនឹងរីករាយជាមួយ Akregator ។

source: Thank you, The Akregator Team
km: សូមអរគុណក្រុម Akregator

source: Mark as Read
km: សម្គាល់ថាអានរួច

source: Mark as Unread
km: សម្គាល់ថាមិនទាន់អាន

source: Remove Important Status
km: យកស្ថានភាពសំខាន់ចេញ

source: Mark as Important
km: សម្គាល់ថាសំខាន់

source: Open Link in External Browser
km: បើកតំណនៅក្នុងកម្មវិធីរុករកខាងក្រៅ

source: Open In Background Tab
km: បើកផ្ទាំងខាងក្រោយ

source: Send File Address
km: ផ្ញើអាស័យដ្ឋានឯកសារ

source: Send Link Address
km: ផ្ញើអាស័យដ្ឋានតំណ

source: Delete Article
km: លុបអត្ថបទ

source: Advanced Feed Reader Settings
km: ការកំណត់ឧបករណ៍អានព័ត៌មានកម្រិតខ្ពស់

source: (c), 2004 - 2008 Frank Osterfeld
km: (c), ២០០៤ - ២០០៨ ហ្វ្រង់អូស្ទឺហ្វែល

source: Frank Osterfeld
km: ហ្វ្រេនអូស្ទឺហ្វែល

source: Configure Feed Reader Appearance
km: កំណត់រចនាសម្ព័ន្ធរូបរាងអ្នកអានមតិព័ត៌មាន

# Limit feed archive size to:
source: article
km: អត្ថបទ

# Delete articles older than:
source: day
km: ថ្ងៃ

source: Configure Feed Reader Archive
km: កំណត់រចនាសម្ព័ន្ធប័ណ្ណសារអ្នកអានព័ត៌មាន

source: Configure Feed Reader Browser
km: កំណត់រចនាសម្ព័ន្ធកម្មវិធីរុករកមតិអ្នកអានមតិព័ត៌មាន

source: minute
km: នាទី

source: Configure Feeds
km: កំណត់រចនាសម្ព័ន្ធមតិព័ត៌មាន

source: Configure Plugins
km: កំណត់រចនាសម្ព័ន្ធកម្មវិធីជំនួយ

source: (c), 2016-2020 Laurent Montel
km: (c) ឆ្នាំ ២០១៦-២០២០ លោកឡូរ៉ង់ម៉ុងតេល

source: Configure User Feedback
km: កំណត់រចនាសម្ព័ន្ធមតិអ្នកប្រើ

source: (c), 2020 Laurent Montel
km: (c) ឆ្នាំ ២០២០ លោកឡូរ៉ង់ម៉ុងតេល

# Mark selected article read after
source: second
km: វិនាទី

source: Archive
km: ប័ណ្ណសារ

source: Archive backend:
km: ប័ណ្ណសារផ្នែកខាងក្រោយ៖

source: &Configure...
km: កំណត់រចនាសម្ព័ន្ធ ...

source: Article List
km: បញ្ជីអត្ថបទ

source: Mar&k selected article read after
km: សម្គាល់អត្ថបទដែលបានជ្រើសរើសអានបន្ទាប់ពី

source: Reset search bar when changing feeds
km: កំណត់របារស្វែងរកឡើងវិញនៅពេលផ្លាស់ប្តូរមតិព័ត៌មាន

source: Article List Colors
km: ពណ៌បញ្ជីអត្ថបទ

source: Unread articles:
km: អត្ថបទមិនទាន់អាន៖

source: New articles:
km: អត្ថបទថ្មីៈ

source: Use custom colors
km: ប្រើពណ៌ផ្ទាល់ខ្លួន

source: Font Size
km: ទំហំ​អក្សរ

source: Minimum font size:
km: ទំហំពុម្ពអក្សរអប្បបរមា៖

source: Medium font size:
km: ទំហំពុម្ពអក្សរមធ្យម៖

source: Fonts
km: ពុម្ពអក្សរ

source: Standard font:
km: ពុម្ពអក្សរស្តង់ដារ៖

source: Fixed font:
km: ពុម្ពអក្សរថេរ៖

source: Serif font:
km: ពុម្ពអក្សរ Serif៖

source: Sans serif font:
km: ពុម្ពអក្សរសៀរៀល៖

source: Default Archive Settings
km: ការកំណត់ប័ណ្ណសារលំនាំដើម

source: Disa&ble archiving
km: បិទដំណើរការប័ណ្ណសារ

source: &Keep all articles
km: រក្សាអត្ថបទទាំងអស់

source: Limit feed archi&ve size to:
km: កំណត់ទំហំប័ណ្ណសារព័ត៌មានដល់៖

source: Delete articles older than:
km: លុបអត្ថបទចាស់ជាង៖

source: Do not expire important articles
km: កុំផុតកំណត់អត្ថបទសំខាន់ៗ

source: Left mouse click:
km: ចុចម៉ៅខាងឆ្វេង៖

source: Open in Tab
km: បើកក្នុងថេប

source: Open in Background Tab
km: បើកនៅក្នុងផ្ទាំងផ្ទៃខាងក្រោយ

source: Open in External Browser
km: បើកនៅក្នុងកម្មវិធីរុករកខាងក្រៅ

source: Middle mouse click:
km: ចុចម៉ៅកណ្តាល៖

source: External Browsing
km: ការរុករកខាងក្រៅ

source: Use &this command:
km: ប្រើពាក្យបញ្ជានេះ៖

source: Use default web &browser
km: ប្រើកម្មវិធីអ៊ីនធឺណិតលំនាំដើម

source: Tabs
km: ផ្ទាំង

source: Always show the tab bar
km: បង្ហាញរបារផ្ទាំងជានិច្ច

source: Show close button on each tab
km: បង្ហាញប៊ូតុងបិទនៅលើផ្ទាំងនីមួយៗ

source: Open links in new tab instead of in new window
km: បើកតំណនៅក្នុងផ្ទាំងថ្មីជំនួសឱ្យនៅក្នុងផ្ទាំងកម្មវិធីថ្មី

source: Security
km: សន្តិសុខ

source: Verify URLs using Google's Safe Browsing API
km: ផ្ទៀងផ្ទាត់ URLs ដោយប្រើកម្មវិធីរុករកសុវត្ថិភាពរបស់ហ្គូហ្គល

source: Enable Javascript
km: បើកដំណើរការ Javascript

source: Misc
km: ផ្សេងៗ

source: Access Key Enabled
km: បានបើកសោចូល

# global settings
source: Global
km: សកល

source: Show tra&y icon
km: បង្ហាញរូបតំណាងថាស

source: Show unread articles in Taskbar
km: បង្ហាញអត្ថបទដែលមិនទាន់អាននៅក្នុងរបារភារកិច្ច

source: Hide feeds with no unread articles
km: លាក់មតិព័ត៌មានដោយគ្មានអត្ថបទដែលមិនទាន់អាន

source: Auto-expand folders containing unread articles
km: ពង្រីកថតឯកសារដោយស្វ័យប្រវត្តិដែលមានអត្ថបទមិនទាន់អាន

source: Select this if you want to get notified when there are new articles.
km: ជ្រើសរើសវាប្រសិនបើអ្នកចង់ជូនដំណឹងនៅពេលមានអត្ថបទថ្មីៗ។

source: Use &notifications for all feeds
km: ប្រើការជូនដំណឹងសម្រាប់មតិព័ត៌មានទាំងអស់

source: &Use interval fetching
km: ប្រើការប្រមូលយកចន្លោះពេល

source: Fetch feeds every:
km: ទៅយកមតិព័ត៌មានរៀងរាល់៖

source: Startup
km: ចាប់ផ្តើម

source: Mark &all feeds as read on startup
km: សម្គាល់មតិព័ត៌មានទាំងអស់ដូចបានអានពេលចាប់ផ្តើម

source: Fetch all fee&ds on startup
km: ទៅយកមតិព័ត៌មានទាំងអស់ពេលចាប់ផ្តើម

source: Network
km: បណ្តាញ

source: Use the &browser cache (less network traffic)
km: ប្រើឃ្លាំងសម្ងាត់កម្មវិធីរុករក (ចរាចរណ៍បណ្តាញតិចជាង)

source: Akregator Export for %1
km: ក្រុមហ៊ុន Akregator នាំចេញសម្រាប់ %1

source: Hides feeds with no unread articles
km: លាក់មតិព័ត៌មានដោយគ្មានអត្ថបទដែលមិនទាន់អាន

source: Auto-Expand folders with unread articles
km: ពង្រីកថតឯកសារដោយស្វ័យប្រវត្តិជាមួយអត្ថបទដែលមិនទាន់អាន

source: Show Quick Filter
km: បង្ហាញតម្រងរហ័ស

source: Show Quick Filter Bar
km: បង្ហាញរបារតម្រងរហ័ស

source: Status Filter
km: តម្រងស្ថានភាព

source: Stores the last status filter setting
km: រក្សាទុកការកំណត់តម្រងស្ថានភាពចុងក្រោយ

source: Text Filter
km: តម្រងអត្ថបទ

source: Stores the last search line text
km: រក្សាទុកអត្ថបទស្វែងរកចុងក្រោយ

source: View Mode
km: របៀបមើល

source: Article display mode.
km: របៀបបង្ហាញអត្ថបទ។

source: Sizes for first splitter
km: ទំហំសម្រាប់អ្នកពុះដំបូង

source: First (usually vertical) splitter widget sizes.
km: ដំបូង (ជាធម្មតាបញ្ឈរ) ទំហំបំបែកធាតុក្រាហ្វិក។

source: Sizes for second splitter
km: ទំហំសម្រាប់ឧបករណ៍ពុះទីពីរ

source: Second (usually horizontal) splitter widget sizes.
km: ទំហំធាតុក្រាហ្វិកបំបែកទីពីរ (ជាទូទៅផ្ដេក) ។

source: Archive Mode
km: របៀបប័ណ្ណសារ

source: Keep All Articles
km: រក្សាអត្ថបទទាំងអស់

source: Save an unlimited number of articles.
km: រក្សាទុកចំនួនអត្ថបទដែលគ្មានដែនកំណត់។

source: Limit Number of Articles
km: កំណត់ចំនួនអត្ថបទ

source: Limit the number of articles in a feed
km: កំណត់ចំនួនអត្ថបទក្នុងអត្ថបទព័ត៌មាន

source: Delete Expired Articles
km: លុបអត្ថបទដែលផុតកំណត់

source: Delete expired articles
km: លុបអត្ថបទដែលផុតកំណត់

source: Disable Archiving
km: បិទដំណើរការប័ណ្ណសារ

source: Do not save any articles
km: កុំរក្សាទុកអត្ថបទណាមួយ

source: Expiry Age
km: អាយុផុតកំណត់

source: Default expiry age for articles in days.
km: អាយុកាលផុតកំណត់លំនាំដើមសម្រាប់អត្ថបទគិតជាថ្ងៃ។

source: Article Limit
km: ដែនកំណត់មាត្រា

source: Number of articles to keep per feed.
km: ចំនួនអត្ថបទត្រូវរក្សាទុកក្នុងមួយអត្ថបទ។

source: Do Not Expire Important Articles
km: កុំផុតកំណត់អត្ថបទសំខាន់ៗ

source: When this option is enabled, articles you marked as important will not be removed when limit the archive size by either age or number of the articles.
km: នៅពេលជម្រើសនេះត្រូវបានបើកអត្ថបទដែលអ្នកបានសម្គាល់ថាសំខាន់នឹងមិនត្រូវបានដកចេញទេនៅពេលកំណត់ទំហំប័ណ្ណសារតាមអាយុឬចំនួនអត្ថបទ។

source: Concurrent Fetches
km: បំពេញដំណាលគ្នា

source: Number of concurrent fetches
km: ចំនួននៃការប្រមូលដំណាលគ្នា

source: Use HTML Cache
km: ប្រើឃ្លាំងសម្ងាត់ HTML

source: Use the KDE-wide HTML cache settings when downloading feeds, to avoid unnecessary traffic. Disable only when necessary.
km: ប្រើការកំណត់ឃ្លាំងសម្ងាត់ HTML ទូទាំង KDE នៅពេលទាញយកព័ត៌មានដើម្បីជៀសវាងចរាចរណ៍ដែលមិនចាំបាច់។ បិទតែនៅពេលចាំបាច់។

source: This option allows user to specify custom user-agent string instead of using the default one. This is here because some proxies may interrupt the connection because of having "gator" in the name.
km: ជម្រើសនេះអនុញ្ញាតឱ្យអ្នកប្រើបញ្ជាក់ខ្សែភ្នាក់ងារភ្នាក់ងារអ្នកប្រើផ្ទាល់ខ្លួនជំនួសឱ្យការប្រើលំនាំដើម។ នេះគឺនៅទីនេះពីព្រោះប្រូកស៊ីខ្លះអាចបង្អាក់ការភ្ជាប់ព្រោះមាន "gator" ក្នុងនាម។

source: Fetch on startup
km: ទៅយកពេលចាប់ផ្តើម

source: Fetch feedlist on startup.
km: ទៅយកបញ្ជីព័ត៌មានពេលចាប់ផ្តើម។

source: Mark all feeds as read on startup
km: សម្គាល់មតិព័ត៌មានទាំងអស់ដូចបានអានពេលចាប់ផ្តើម

source: Mark all feeds as read on startup.
km: សម្គាល់មតិព័ត៌មានទាំងអស់ដូចបានអានពេលចាប់ផ្តើម។

source: Use interval fetching
km: ប្រើការប្រមូលយកចន្លោះពេល

source: Fetch all feeds every %1 minutes.
km: ទៅយកចំណីទាំងអស់រៀងរាល់ %1 នាទី។

source: Interval for autofetching
km: ចន្លោះពេលសម្រាប់ការបញ្ចូលដោយស្វ័យប្រវត្តិ

source: Interval for autofetching in minutes.
km: ចន្លោះពេលសម្រាប់ការបញ្ចូលដោយស្វ័យប្រវត្តិក្នុងរយៈពេលប៉ុន្មាននាទី។

source: Use notifications
km: ប្រើការជូនដំណឹង

source: Specifies if the balloon notifications are used or not.
km: បញ្ជាក់ប្រសិនបើការជូនដំណឹងអំពីបាឡុងត្រូវបានប្រើឬអត់។

source: Show tray icon
km: បង្ហាញរូបតំណាងថាស

source: Specifies if the tray icon is shown or not.
km: បញ្ជាក់ថាតើរូបតំណាងថាសត្រូវបានបង្ហាញឬអត់។

source: Show Unread In Taskbar
km: បង្ហាញមិនទាន់អាននៅក្នុងរបារភារកិច្ច

source: Specifies if we show unread article in taskbar.
km: បញ្ជាក់ប្រសិនបើយើងបង្ហាញអត្ថបទដែលមិនទាន់អាននៅក្នុងរបារភារកិច្ច។

source: Always show the tab bar, even when only one tab is open
km: បង្ហាញរបារផ្ទាំងជានិច្ចទោះបីនៅពេលបើកផ្ទាំងតែមួយក៏ដោយ

source: Show close buttons on tabs
km: បង្ហាញប៊ូតុងបិទនៅលើផ្ទាំង

source: Show close buttons on tabs instead of icons
km: បង្ហាញប៊ូតុងបិទនៅលើផ្ទាំងជំនួសឱ្យរូបតំណាង

source: Open a link which would normally open in a new window (external browser) in a new tab instead
km: បើកតំណដែលជាធម្មតាបើកនៅក្នុងផ្ទាំងកម្មវិធីថ្មី (កម្មវិធីរុករកខាងក្រៅ) នៅក្នុងផ្ទាំងថ្មីជំនួសវិញ

source: Use default KDE web browser
km: ប្រើកម្មវិធីរុករកគេហទំព័ររបស់ KDE លំនាំដើម

source: Use KDE web browser when opening in external browser.
km: ប្រើកម្មវិធីរុករកអ៊ីនធឺណិតរបស់ KDE ពេលបើកក្នុងកម្មវិធីរុករកខាងក្រៅ។

source: Use this command:
km: ប្រើពាក្យបញ្ជានេះ៖

source: Use the specified command when opening in external browser.
km: ប្រើពាក្យបញ្ជាដែលបានបញ្ជាក់នៅពេលបើកនៅក្នុងកម្មវិធីរុករកខាងក្រៅ។

source: Command to launch external browser. URL will substitute for %u.
km: បញ្ជាដើម្បីបើកដំណើរការកម្មវិធីរុករកខាងក្រៅ។ URL នឹងជំនួស %u ។

source: What the click with left mouse button should do.
km: អ្វីដែលការចុចប៊ូតុងកណ្ដុរខាងឆ្វេងគួរធ្វើ។

source: What the click with middle mouse button should do.
km: អ្វីដែលការចុចប៊ូតុងម៉ៅកណ្តាលគួរតែធ្វើ។

source: Archive Backend
km: ប័ណ្ណសារ backend

source: Whether to delay before marking an article as read upon selecting it.
km: ថាតើត្រូវពន្យាពេលមុនពេលសម្គាល់អត្ថបទដែលបានអាននៅពេលជ្រើសរើសយកវា។

source: Configurable delay between selecting an article and it being marked as read.
km: ការពន្យាពេលដែលអាចកំណត់បានរវាងការជ្រើសរើសអត្ថបទហើយវាត្រូវបានសម្គាល់ថាអាន។

source: Resets the quick filter when changing feeds.
km: កំណត់តម្រងរហ័សនៅពេលផ្លាស់ប្តូរមតិព័ត៌មាន។

# @action:inmenu
source: New Feed...
km: ចំណីថ្មី ...

# @info:status
source: Create a new feed
km: បង្កើតចំណីថ្មី

# @info:whatsthis
source: You will be presented with a dialog where you can add a new feed.
km: អ្នកនឹងត្រូវបានបង្ហាញជាមួយប្រអប់ដែលអ្នកអាចបន្ថែមចំណីថ្មី។

source: Metakit
km: មេត្តា

source: A KDE Feed Reader
km: កម្មវិធីអានមតិព័ត៌មានរបស់ KDE

source: Copyright © 2004–2020 Akregator authors
km: រក្សាសិទ្ធិ© ២០០៤-២០២០ អ្នកនិពន្ធអាកហ្គ័រ

source: Maintainer
km: អ្នកថែរក្សា

source: Former maintainer
km: អតីតអ្នកថែរក្សា

source: Developer
km: អ្នកអភិវឌ្ឍន៍

source: Contributor
km: អ្នកចូលរួមវិភាគទាន

source: Handbook
km: សៀវភៅណែនាំ

source: Author of librss
km: អ្នកនិពន្ធសេរីភាព

source: Bug tracker management, Usability improvements
km: ការគ្រប់គ្រងកម្មវិធីតាមដានកំហុសការកែលម្អការប្រើប្រាស់

source: Tons of bug fixes
km: ការជួសជុលកំហុសរាប់តោន

source: 'Delayed mark as read' feature
km: លក្ខណៈពិសេស 'បានពន្យារពេលដូចបានអាន'

source: Icons
km: រូបតំណាង

source: &Fetch Feed
km: ទៅយមតិព័ត៌មាន

source: &Delete Feed
km: លុបមតិព័ត៌មាន

source: &Edit Feed...
km: កែសម្រួលមតិព័ត៌មាន ...

source: &Mark Feed as Read
km: សម្គាល់មតិព័ត៌មានថាអានរួច

source: &Fetch Feeds
km: ទៅយកចំណី

source: &Delete Folder
km: លុបថតឯកសារ

source: &Rename Folder
km: ប្តូរឈ្មោះថតឯកសារ

source: &Mark Feeds as Read
km: សម្គាល់មតិព័ត៌មានថាអានរួច

source: &Import Feeds...
km: នាំចូលមតិព័ត៌មាន ...

source: &Export Feeds...
km: នាំចេញមតិព័ត៌មាន ...

source: &Configure Akregator...
km: តំឡើង Akregator ...

source: &Open Homepage
km: បើកគេហទំព័រ

source: Reload All Tabs
km: ផ្ទុកផ្ទាំងទាំងអស់ឡើងវិញ

source: &Add Feed...
km: បន្ថែមមតិព័ត៌មាន ...

source: Ne&w Folder...
km: ប្រអប់​ឯកសារ​ថ្មី...

source: &Normal View
km: ទិដ្ឋភាពធម្មតា

source: &Widescreen View
km: មើលអេក្រង់ធំទូលាយ

source: C&ombined View
km: ទិដ្ឋភាពរួមបញ្ចូលគ្នា

source: Fe&tch All Feeds
km: ទៅយកចំណីទាំងអស់

source: C&ancel Feed Fetches
km: បោះបង់ការប្រមូលចំណី

source: Ma&rk All Feeds as Read
km: សម្គាល់មតិព័ត៌មានទាំងអស់ថាអានរួច

source: Copy Link Address
km: ចម្លងអាសយដ្ឋានតំណ

source: Pre&vious Unread Article
km: អត្ថបទមិនទាន់អានពីមុន

source: Ne&xt Unread Article
km: អត្ថបទមិនទាន់អានបន្ទាប់

source: &Delete
km: លុប

source: &Mark As
km: សម្គាល់ជា

# as in: mark as read
source: &Read
km: អាន

source: Mark selected article as read
km: សម្គាល់អត្ថបទដែលបានជ្រើសរើសថាអានរួច

# as in: mark as new
source: &New
km: ថ្មី

source: Mark selected article as new
km: សម្គាល់អត្ថបទដែលបានជ្រើសរើសជាអត្ថបទថ្មី

# as in: mark as unread
source: &Unread
km: មិនទាន់អាន

source: Mark selected article as unread
km: សម្គាល់អត្ថបទដែលបានជ្រើសរើសថាមិនទាន់អាន

source: &Mark as Important
km: សម្គាល់ថាសំខាន់

source: Remove &Important Mark
km: ដកម៉ាកសំខាន់ចេញ

source: Move Node Up
km: ផ្លាស់ទីថ្នាំងឡើងលើ

source: Move Node Down
km: ផ្លាស់ទីថ្នាំងចុះក្រោម

source: Move Node Left
km: ផ្លាស់ទីថ្នាំងខាងឆ្វេង

source: Move Node Right
km: ផ្លាស់ទីថ្នាំងខាងស្តាំ

source: Send &Link Address...
km: ផ្ញើអាស័យដ្ឋានតំណ ...

source: Send &File...
km: ផ្ញើឯកសារ ...

source: Set Focus to Quick Search
km: កំណត់ការផ្តោតអារម្មណ៍ដើម្បីស្វែងរករហ័ស

source: &Previous Article
km: អត្ថបទមុន

source: &Next Article
km: អត្ថបទបន្ទាប់

source: &Previous Feed
km: មតិព័ត៌មានមុន

source: &Next Feed
km: ព័ត៌មានបន្ទាប់

source: N&ext Unread Feed
km: មតិព័ត៌មានមិនទាន់អានបន្ទាប់

source: Prev&ious Unread Feed
km: មតិព័ត៌មានមិនទាន់អានពីមុន

source: Go to Top of Tree
km: ចូលទៅកាន់កំពូលដើមឈើ

source: Go to Bottom of Tree
km: ចូលទៅកាន់ផ្នែកខាងក្រោមនៃមែកធាង

source: Go Left in Tree
km: ទៅឆ្វេងនៅក្នុងមែកធាង

source: Go Right in Tree
km: ទៅខាងស្ដាំនៅក្នុងមែកធាង

source: Go Up in Tree
km: ឡើងលើដើមឈើ

source: Go Down in Tree
km: ទៅក្រោមនៅក្នុងមែកធាង

source: Hide Read Feeds
km: លាក់មតិព័ត៌មានអាន

source: Auto-expand folders with unread articles
km: ពង្រីកថតឯកសារដោយស្វ័យប្រវត្តិជាមួយអត្ថបទដែលមិនទាន់អាន

source: Select Next Tab
km: ជ្រើសផ្ទាំងបន្ទាប់

source: Select Previous Tab
km: ជ្រើសផ្ទាំងមុន

source: Detach Tab
km: ផ្ដាច់ផ្ទាំង

source: Mute
km: ស្ងាត់

source: Unmute
km: បើកសំឡេង

source: Speak Text
km: និយាយអត្ថបទ

source: &Find in Message...
km: ស្វែងរកនៅក្នុងសារ ...

source: Close Tab
km: បិទផ្ទាំង

source: Activate Tab %1
km: ធ្វើសកម្មភាពផ្ទាំង %1

source: &Save Link As...
km: រក្សា​តំណ​លីង​ទុក...

source: Copy &Link Address
km: ចម្លងអាសយដ្ឋានតំណ

source: Copy Image Location
km: ចម្លងទីតាំងរូបភាព

source: Save Image On Disk...
km: រក្សាទុករូបភាពនៅលើថាស ...

source: Open Link in New &Tab
km: បើកតំណក្នុងផ្ទាំងថ្មី

source: Open Link in External &Browser
km: បើកតំណនៅក្នុងកម្មវិធីរុករកខាងក្រៅ

source: Downloading %1
km: ទាញយក %1

source: Feed not found from %1.
km: រកមិនឃើញចំណីពី %1 ។

source: Feed found, downloading...
km: បានរកឃើញព័ត៌មានទាញយក ...

source: Add a feed with the given URL
km: បន្ថែមមតិព័ត៌មានជាមួយ URL ដែលបានផ្តល់

source: When adding feeds, place them in this group
km: នៅពេលបន្ថែមមតិព័ត៌មានសូមដាក់វានៅក្នុងក្រុមនេះ

source: Hide main window on startup
km: លាក់ផ្ទាំងកម្មវិធីមេនៅពេលចាប់ផ្តើម

source: Lists the available options for user feedback
km: រាយជម្រើសដែលមានសម្រាប់មតិអ្នកប្រើ

source: Feeds
km: មតិព័ត៌មាន

source: Planet KDE
km: ភព KDE

source: KDE Apps
km: កម្មវិធីរបស់ KDE

source: Spanish feeds
km: មតិព័ត៌មានអេស្ប៉ាញ

source: Planet KDE España
km: ភពខេអេសអេសអេសអេស

source: Unable to load storage backend plugin "%1". No feeds are archived.
km: មិនអាចដំណើរការកម្មវិធីជំនួយ backend ផ្ទុក " %1" ។ គ្មានប័ណ្ណសារត្រូវបានទុកក្នុងប័ណ្ណសារ។

source: Plugin error
km: កំហុសកម្មវិធីជំនួយ

source: Access denied: Cannot save feed list to <b>%1</b>. Please check your permissions.
km: ការចូលដំណើរការត្រូវបានបដិសេធ៖ មិនអាចរក្សាទុកបញ្ជីចំណីទៅ <b> %1 </b> ។ សូមពិនិត្យមើលសិទ្ធិរបស់អ្នក។

source: Write Error
km: កំហុសសរសេរ

source: OPML Parsing Error
km: កំហុសក្នុងការញែក OPML

source: Could not import the file %1 (no valid OPML)
km: មិនអាចនាំចូលឯកសារ %1 (គ្មាន OPML ត្រឹមត្រូវ)

source: Read Error
km: កំហុសក្នុងការអាន

source: The file %1 could not be read, check if it exists or if it is readable for the current user.
km: មិនអាចអានឯកសារ %1 បានទេពិនិត្យមើលថាតើវាមានឬប្រសិនបើអាចអានបានសម្រាប់អ្នកប្រើប្រាស់បច្ចុប្បន្ន។

source: Access denied: cannot write to file %1. Please check your permissions.
km: ការចូលដំណើរការត្រូវបានបដិសេធ៖ មិនអាចសរសេរទៅឯកសារ %1 ។ សូមពិនិត្យមើលសិទ្ធិរបស់អ្នក។

source: OPML Outlines (%1);;All Files (*)
km: គ្រោង OPML (%1); ឯកសារទាំងអស់ (*)

source: Imported Folder
km: ថតឯកសារដែលបាននាំចូល

source: The feed to be listed was already removed.
km: មតិព័ត៌មានដែលត្រូវចុះបញ្ជីត្រូវបានដកចេញរួចហើយ។

source: Columns
km: ជួរឈរ

source: No result found
km: រកមិនឃើញលទ្ធផល

source: <h2>Article list</h2>Here you can browse articles from the currently selected feed. You can also manage articles, as marking them as persistent ("Mark as Important") or delete them, using the right mouse button menu. To view the web page of the article, you can open the article internally in a tab or in an external browser window.
km: <h2> បញ្ជីអត្ថបទ </h2> នៅទីនេះអ្នកអាចរកមើលអត្ថបទពីអត្ថបទដែលបានជ្រើសរើសបច្ចុប្បន្ន។ អ្នកក៏អាចគ្រប់គ្រងអត្ថបទផងដែរដោយសម្គាល់ពួកវាថា ("Mark ជាស៊ីនហ្សិតប៊ីឃូតហ្សិច) ឬលុបវាចោលដោយប្រើប៊ូតុងប៊ូតុងម៉ៅខាងស្តាំ។ ដើម្បីមើលទំព័រគេហទំព័រនៃអត្ថបទអ្នកអាចបើកអត្ថបទនៅខាងក្នុងផ្ទាំងឬនៅក្នុងផ្ទាំងវិនដូរុករកខាងក្រៅ។

# Articlelist's column header
source: Title
km: ចំណងជើង

# Articlelist's column header
source: Feed
km: ចិញ្ចឹម

# Articlelist's column header
source: Date
km: កាលបរិច្ឆេទ

# Articlelist's column header
source: Author
km: អ្នកនិពន្ធ

# Articlelist's column header
source: Description
km: ការពិពណ៌នា

# Articlelist's column header
source: Content
km: ខ្លឹមសារ

source: Akregator is a KDE news feed reader.
km: Akregator គឺជាកម្មវិធីអានព័ត៌មានរបស់ KDE ។

source: Save As
km: រក្សាទុក​ជា

source: Disable
km: បិទ

source: Keep Enabled
km: ទុកឱ្យដំណើរការ

source: Are you sure you want to disable this introduction page?
km: តើអ្នកពិតជាចង់បិទទំព័រណែនាំនេះមែនទេ?

source: Disable Introduction Page
km: បិទទំព័រណែនាំ

source: This web site is a malware, do you want to continue to show it?
km: គេហទំព័រនេះគឺជាមេរោគតើអ្នកចង់បន្តបង្ហាញវាទេ?

source: Malware
km: មេរោគ

source: The network is broken.
km: បណ្តាញត្រូវបានខូច។

source: Check Phishing Url
km: សូមពិនិត្យមើលការបន្លំ Url

source: The url %1 is not valid.
km: មិនត្រឹមត្រូវ url %1។

# @title:window
source: Print Document
km: បោះពុម្ពឯកសារ

source: Add Folder
km: បន្ថែមថតឯកសារ

source: Folder name:
km: ឈ្មោះថតឯកសារ៖

source: <qt>Are you sure you want to delete this folder and its feeds and subfolders?</qt>
km: <qt> តើអ្នកពិតជាចង់លុបថតឯកសារនេះនិងមតិព័ត៌មាននិងថតរងរបស់វាឬ? </qt>

source: <qt>Are you sure you want to delete folder <b>%1</b> and its feeds and subfolders?</qt>
km: <qt> តើអ្នកពិតជាចង់លុបថតឯកសារមែនឬ? <b> %1 </b> និងមតិព័ត៌មាននិងថតរងរបស់វា? </qt>

source: Delete Folder
km: លុបថតឯកសារ

source: <qt>Are you sure you want to delete this feed?</qt>
km: <qt> តើអ្នកពិតជាចង់លុបមតិព័ត៌មាននេះមែនទេ? </qt>

source: <qt>Are you sure you want to delete feed <b>%1</b>?</qt>
km: <qt> តើអ្នកប្រាកដជាចង់លុបមតិព័ត៌មាន <b> %1 </b> ? </qt>

source: Delete Feed
km: លុបមតិព័ត៌មាន

source: Imported Feeds
km: មតិព័ត៌មានដែលបាននាំចូល

source: Add Imported Folder
km: បន្ថែមថតឯកសារដែលបាននាំចូល

source: Imported folder name:
km: ឈ្មោះថតឯកសារដែលបាននាំចូល៖

source: <qt>The standard feed list is corrupted (invalid OPML). A backup was created:<p><b>%1</b></p></qt>
km: <qt> បញ្ជីមតិព័ត៌មានស្តង់ដារខូច (OPML មិនត្រឹមត្រូវ) ។ ការបម្រុងទុកត្រូវបានបង្កើត៖ <p><b> %1 </b></p></qt>

source: <qt>The standard feed list is corrupted (invalid OPML). Could not create a backup.</qt>
km: <qt> បញ្ជីមតិព័ត៌មានស្តង់ដារខូច (OPML មិនត្រឹមត្រូវ) ។ មិនអាចបង្កើតការបម្រុងទុកទេ។ </qt>

source: Opening Feed List...
km: កំពុងបើកបញ្ជីមតិព័ត៌មាន ...

source: <qt>Could not open feed list (%1) for reading.</qt>
km: <qt> មិនអាចបើកបញ្ជីចំណី (%1) សម្រាប់ការអាន។ </qt>

# error message window caption
source: XML Parsing Error
km: កំហុសក្នុងការញែក XML

source: <qt><p>XML parsing error in line %1, column %2 of %3:</p><p>%4</p></qt>
km: <qt><p> កំហុសក្នុងការញែក XML នៅក្នុងបន្ទាត់ %1, ជួរឈរ %2 នៃ %3៖ </p><p> %4 </p></qt>

source: <qt>The standard feed list is corrupted (invalid XML). A backup was created:<p><b>%1</b></p></qt>
km: <qt> បញ្ជីមតិព័ត៌មានស្តង់ដារខូចហើយ (XML មិនត្រឹមត្រូវ) ។ ការបម្រុងទុកត្រូវបានបង្កើត៖ <p><b> %1 </b></p></qt>

source: <qt>The standard feed list is corrupted (invalid XML). Could not create a backup.</qt>
km: <qt> បញ្ជីមតិព័ត៌មានស្តង់ដារខូចហើយ (XML មិនត្រឹមត្រូវ) ។ មិនអាចបង្កើតការបម្រុងទុកទេ។ </qt>

source: Akregator did not close correctly. Would you like to restore the previous session?
km: Akregator មិនបានបិទត្រឹមត្រូវទេ។ តើអ្នកចង់ស្តារវេនមុនទេ?

source: Restore Session
km: ស្តារវេន

source: Do Not Restore Session
km: កុំស្តារវេន

source: Ask me later
km: សួរខ្ញុំពេលក្រោយ

source: &Edit
km: កែសម្រួល

source: &View
km: មើល

source: &Go
km: ទៅ

source: Fee&d
km: ចិញ្ចឹម

source: &Article
km: មាត្រា

source: &Settings
km: ការកំណត់

source: Main Toolbar
km: របារឧបករណ៍មេ

source: &File
km: ឯកសារ

source: No Archive
km: គ្មានប័ណ្ណសារ

source: All Feeds
km: មតិព័ត៌មានទាំងអស់

source: Minute
km: នាទី

source: Hour
km: ម៉ោង

source: Day
km: ថ្ងៃ

# @title:window
source: Feed Properties
km: លក្ខណៈសម្បត្តិ មតិព័ត៌មាន

# never fetch new articles
source: Never
km: មិនដែល

source: day
km: ថ្ងៃ

source: article
km: អត្ថបទ

source: Feed Properties
km: លក្ខណៈសម្បត្តិចំណី

source: Properties of %1
km: លក្ខណៈសម្បត្តិរបស់ %1

source: (no unread articles)
km: (មិនមានអត្ថបទមិនទាន់អាន)

source: (1 unread article)
km: (អត្ថបទមិនទាន់អាន ១

source: <b>Description:</b> %1<br />
km: <b> ការពិពណ៌នាសង្ខេប៖ </b> %1 <br />

source: <b>Homepage:</b> <a href="%1">%1</a>
km: <b> គេហទំព័រ៖ </b><a href="%1"> %1 </a>

source: <b>Copyright:</b> %1</a>
km: <b> រក្សាសិទ្ធិ៖ </b> %1 </a>

source: Date
km: កាលបរិច្ឆេទ

source: Comment
km: វិចារ

source: Complete Story
km: រឿងពេញលេញ

source: Author
km: អ្នកនិពន្ធ

source: Enclosure
km: ឯករភជប់

source: Untitled
km: គ្មានចំណងជើង
