Repository: koompi/kde-khmer-translation
Catalog: Applications in stable KF5-based/messages/akregator/akregator.po
Languages: km

source: Loading...
km: កំពុងផ្ទុក ...

source: Loading canceled
km: បានបោះបង់ការផ្ទុក

source: Loading completed
km: ការផ្ទុកបានបញ្ចប់

source: You can view multiple articles in several open tabs.
km: អ្នកអាចមើលអត្ថបទជាច្រើននៅក្នុងផ្ទាំងបើកជាច្រើន។

source: Articles list.
km: បញ្ជីអត្ថបទ។

source: Articles
km: អត្ថបទ

source: About
km: អំពី

source: Networking is not available.
km: បណ្តាញមិនមានទេ។

source: Fetching Feeds...
km: ទៅយកចំណី ...

source: <qt>Are you sure you want to delete article <b>%1</b>?</qt>
km: <qt> តើអ្នកប្រាកដជាចង់លុបអត្ថបទ <b> %1 </b> ? </qt>

source: <qt>Are you sure you want to delete the selected article?</qt>
km: <qt> តើអ្នកពិតជាចង់លុបអត្ថបទដែលបានជ្រើសរើសមែនទេ? </qt>

source: Networking is available now.
km: បណ្តាញគឺអាចប្រើបានឥឡូវនេះ។

source: Could not find the Akregator part; please check your installation. %1
km: មិនអាចរកផ្នែក Akregator បានឡើយ &&amp;;; ។ សូមពិនិត្យការដំឡើងរបស់អ្នក។ %1

source: Feed added: %1
km: មតិព័ត៌មានបន្ថែម៖ %1

source: Feeds added: %1
km: មតិព័ត៌មានបន្ថែម៖ %1

source: <i>and 1 other</i>
km: <i> និង ១ ផ្សេងទៀត </i>

# Name of the plugin
source: Name
km: ឈ្មោះ

# Library name
source: Library
km: បណ្ណាល័យ

# Plugin authors
source: Authors
km: អ្នកនិពន្ធ

# Plugin authors' emaila addresses
source: Email
km: អ៊ីមែល

# Plugin version
source: Version
km: កំណែ

# Framework version plugin requires
source: Framework Version
km: កំណែស៊ុម

source: Plugin Information
km: ព័ត៌មានកម្មវិធីជំនួយ

source: Fetch completed
km: ការប្រមូលយកបានបញ្ចប់

source: Fetch error
km: មានកំហុស

source: Fetch aborted
km: ទៅយកបានបោះបង់

source: Feed list was deleted
km: បញ្ជីមតិព័ត៌មានត្រូវបានលុបចោល

source: Node or destination folder not found
km: រកមិនឃើញថ្នាំងឬថតទិសដៅទេ

source: Cannot move folder %1 to its own subfolder %2
km: មិនអាចផ្លាស់ទីថត %1 ទៅកាន់ថតរងរបស់វា %2

source: Timeout on remote server
km: អស់ពេលនៅលើម៉ាស៊ីនមេពីចម្ងាយ

source: Unknown host
km: មិនស្គាល់ម៉ាស៊ីន

source: Feed file not found on remote server
km: រកមិនឃើញឯកសារមតិព័ត៌មាននៅលើម៉ាស៊ីនមេពីចម្ងាយ

source: Could not read feed (invalid XML)
km: មិនអាចអានអត្ថបទព័ត៌មាន (XML មិនត្រឹមត្រូវ)

source: Could not read feed (unknown format)
km: មិនអាចអានអត្ថបទព័ត៌មាន (ទ្រង់ទ្រាយមិនស្គាល់)

source: Could not read feed (invalid feed)
km: មិនអាចអានមតិព័ត៌មាន (មតិព័ត៌មានមិនត្រឹមត្រូវ)

source: Could not fetch feed: %1
km: មិនអាចទៅយកមតិព័ត៌មានបានទេ៖ %1

# Feedlist's column header
source: Feeds
km: មតិព័ត៌មាន

# Feedlist's column header
source: Unread
km: មិនទាន់អាន

# Feedlist's column header
source: Total
km: សរុប

source: Close the current tab
km: បិទផ្ទាំងបច្ចុប្បន្ន

source: Close tab
km: បិទផ្ទាំង

# @action:inmenu
source: Detach Tab
km: ផ្ដាច់ផ្ទាំង

# @action:inmenu
source: Close Tab
km: បិទផ្ទាំង

# @action:inmenu
source: Close All Other Tabs
km: បិទផ្ទាំងផ្សេងទៀតទាំងអស់

# @action:inmenu
source: Close All Tabs
km: បិទផ្ទាំងទាំងអស់

source: There are no unread articles
km: មិនមានអត្ថបទមិនទាន់អាន

source: 1 unread article
km: អត្ថបទមិនទាន់អាន ១

source: Add Feed
km: បន្ថែមមតិព័ត៌មាន

source: Add New Source
km: បន្ថែមប្រភពថ្មី

source: Feed &URL:
km: មតិព័ត៌មាន URL៖

source: &General
km: ទូទៅ

source: U&se a custom update interval
km: ប្រើចន្លោះពេលធ្វើបច្ចុប្បន្នភាពផ្ទាល់ខ្លួន

source: Update ever&y:
km: ធ្វើបច្ចុប្បន្នភាពរៀងរាល់៖

source: Notify when new articles arri&ve
km: ជូនដំណឹងនៅពេលអត្ថបទថ្មីមកដល់

source: &Name:
km: ឈ្មោះ៖

source: Display name of RSS column
km: បង្ហាញឈ្មោះជួរឈរអេសអេស

source: Comment:
km: វិចារណ៍

source: Ar&chive
km: ប័ណ្ណសារ

source: &Use default settings
km: ប្រើការកំណត់លំនាំដើម

source: Di&sable archiving
km: បិទដំណើរការប័ណ្ណសារ

source: Limit archi&ve to:
km: កំណត់ប័ណ្ណសារទៅ៖

source: &Delete articles older than:
km: លុបអត្ថបទចាស់ជាង៖

source: Adva&nced
km: កម្រិតខ្ពស់

source: Load the &full website when reading articles
km: ផ្ទុកគេហទំព័រពេញលេញនៅពេលអានអត្ថបទ

source: Mar&k articles as read when they arrive
km: សម្គាល់អត្ថបទថាបានអាននៅពេលពួកគេមកដល់

source: Disable Introduction
km: បិទការណែនាំ

source: &Copy Email Address
km: ចម្លងអាសយដ្ឋានអ៊ីមែល

source: Address copied to clipboard.
km: បានចម្លងអាសយដ្ឋានទៅក្ដារតម្បៀតខ្ទាស់។

source: Mark Article as Read
km: សម្គាល់អត្ថបទថាអានរួច

source: Mark Article as Unread
km: សម្គាល់អត្ថបទថាមិនទាន់អាន

source: Change Important Flag
km: ផ្លាស់ប្តូរទង់សំខាន់

source: Send the URL of the article
km: ផ្ញើ URL នៃអត្ថបទ

source: Send the Html Page of Article
km: ផ្ញើទំព័រអ៊ិនធឺណិតនៃអត្ថបទ

source: Open In External Browser
km: បើកនៅក្នុងកម្មវិធីរុករកខាងក្រៅ

source: Search articles...
km: ស្វែងរកអត្ថបទ ...

source: Search articles...<%1>
km: ស្វែងរកអត្ថបទ ... <%1>

source: All Articles
km: អត្ថបទទាំងអស់

# Unread articles filter
source: Unread
km: មិនទាន់អាន

# New articles filter
source: New
km: ថ្មី

# Important articles filter
source: Important
km: សំខាន់
