Repository: koompi/kde-khmer-translation
Catalog: Applications in stable KF5-based/messages/akonadi/akonadi_knut_resource.po
Languages: km

source: No data file selected.
km: គ្មានឯកសារទិន្នន័យត្រូវបានជ្រើសរើសទេ។

source: File '%1' loaded successfully.
km: ផ្ទុកឯកសារ '%1' ដោយជោគជ័យ។

source: Select Data File
km: ជ្រើសឯកសារទិន្នន័យ

# Filedialog filter for Akonadi data file
source: Akonadi Knut Data File
km: ឯកសារទិន្នន័យ Akonadi Knut

source: No item found for remoteid %1
km: រកមិនឃើញធាតុសម្រាប់ពីចម្ងាយ %1

source: Parent collection not found in DOM tree.
km: រកមិនឃើញការប្រមូលឪពុកម្តាយនៅក្នុងមែកធាង DOM ។

source: Unable to write collection.
km: មិនអាចសរសេរការប្រមូលបានទេ។

source: Modified collection not found in DOM tree.
km: រកមិនឃើញការប្រមូលដែលបានកែប្រែក្នុងមែកធាង DOM ។

source: Deleted collection not found in DOM tree.
km: ការប្រមូលបានលុបមិនបានរកឃើញនៅក្នុងមែកធាង DOM ។

source: Parent collection '%1' not found in DOM tree.
km: ការប្រមូលផ្តុំឪពុកម្តាយ '%1' រកមិនឃើញនៅក្នុងមែកធាង DOM ។

source: Unable to write item.
km: មិនអាចសរសេរធាតុបានទេ។

source: Modified item not found in DOM tree.
km: រកមិនឃើញធាតុដែលបានកែប្រែនៅក្នុងមែកធាង DOM ។

source: Deleted item not found in DOM tree.
km: រកមិនឃើញធាតុដែលបានលុបក្នុងមែកធាង DOM ។
