Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/atcore/atcore_qt.po
Languages: km

# AtCore|
source: plugins[%1]=%2
km: កម្មវិធីជំនួយ [%1] = %2

# QObject|
source: G0: Rapid linear move
km: G0៖ ចលនាលីនេអ៊ែរលឿន

# QObject|
source: G1: Linear move
km: G1៖ ចលនាលីនេអ៊ែរ

# QObject|
source: G2: Controlled Arc Move clockwise
km: G2៖ ធ្នូដែលគ្រប់គ្រងដោយចលនាស្របតាមទ្រនិចនាឡិកា

# QObject|
source: G3: Controlled Arc Move counterclockwise
km: G3៖ ធ្នូដែលបានត្រួតពិនិត្យច្រាសទ្រនិចនាឡិកា

# QObject|
source: G10: Retract
km: G10៖ ដកថយ

# QObject|
source: G11: Unretract
km: G11៖ មិនចុះសម្រុង

# QObject|
source: G20: Set units to inches
km: G20៖ កំណត់ឯកតាទៅអ៊ីញ

# QObject|
source: G21: Set units to millimeters
km: G21៖ កំណត់ឯកតាទៅមីល្លីម៉ែត្រ

# QObject|
source: G28: Move to Origin Home
km: G28៖ ប្តូរទៅផ្ទះដើម

# QObject|
source: G29: Detailed Z-Probe
km: G29៖ លម្អិត Z-Probe

# QObject|
source: G30: Single Z-Probe
km: G30៖ លីវ Z-Probe

# QObject|
source: G31: Set or report current probe status / Dock Z Probe sled for Marlin
km: G31៖ កំណត់ឬរាយការណ៍អំពីស្ថានភាពស៊ើបអង្កេតបច្ចុប្បន្ន / Dock Z Probe sled សម្រាប់ម៉ារីន

# QObject|
source: G32: Probe Z and calculate Z plane(Bed Leveling)/ UnDoc Z Probe sled for Marlin
km: G32៖ ការស៊ើបអង្កេត Z និងគណនាយន្ដហោះ Z (កំរិតគ្រែ) / UnDoc Z Probe បានត្រៀមសម្រាប់ម៉ាលីន

# QObject|
source: G33: Measure/List/Adjust Distortion Matrix
km: G33៖ វិធានការ / បញ្ជី / កែសម្រួលម៉ាទ្រីសបង្ខូចទ្រង់ទ្រាយ

# QObject|
source: G90: Set to absolute positioning
km: G90៖ កំណត់ទៅទីតាំងដាច់ខាត

# QObject|
source: G91: Set to relative positioning
km: G91៖ កំណត់ទៅទីតាំងដែលទាក់ទង

# QObject|
source: G92: Set position
km: G92៖ កំណត់ទីតាំង

# QObject|
source: G100: Calibrate floor or rod radius
km: G100៖ កំរាស់កំរាលរឺកាំដំបង

# QObject|
source: G130: Set digital potentiometer value
km: G130៖ កំណត់តម្លៃ potentiometer ឌីជីថល

# QObject|
source: G131: Recase Move offset
km: G131៖ អុហ្វសិតផ្លាស់ទីឡើងវិញ

# QObject|
source: G132: Calibrate endstops offsets
km: G132៖ ក្រិតតាមខ្នាតអុហ្វសិត

# QObject|
source: G133: Measure steps to top
km: G133៖ វាស់ពីលើចុះក្រោម

# QObject|
source: G161: Home axis to minimum
km: G161៖ អ័ក្សផ្ទះទៅអប្បបរមា

# QObject|
source: G162: Home axis to maximum
km: G162៖ អ័ក្សផ្ទះដល់អតិបរមា

# QObject|
source: GCommand not supported!
km: មិនគាំទ្រ GCommand!

# QObject|
source: Not implemented or not supported!
km: មិនបានអនុវត្តឬមិនគាំទ្រ!

# QObject|
source: M0: Stop or unconditional stop
km: M0៖ ឈប់រឺឈប់ដោយគ្មានល័ក្ខខ័ណ្ឌ

# QObject|
source: M1: Sleep or unconditional stop
km: M1៖ ការគេងឬឈប់ដោយគ្មានលក្ខខណ្ឌ

# QObject|
source: M2: Program End
km: M2៖ ការបញ្ចប់កម្មវិធី

# QObject|
source: M6: Tool Change
km: M6៖ ការផ្លាស់ប្តូរឧបករណ៍

# QObject|
source: M17: Enable/power all steppers motors
km: M17៖ បើក / ផ្តល់ថាមពលដល់ម៉ូទ័រ steppers ទាំងអស់

# QObject|
source: M18: Disable all steppers motors
km: M18៖ បិទម៉ូទ័រចំហាយទាំងអស់

# QObject|
source: M20: List SDCard
km: M20៖ រាយកាតអេសឌី

# QObject|
source: M21: Initialize SDCard
km: M21៖ ចាប់ផ្តើមអេសឌីធី

# QObject|
source: M22: Release SDCard
km: M22៖ ការចេញផ្សាយ SDCard

# QObject|
source: M23: Select SD file
km: M23៖ ជ្រើសរើសឯកសារអេសឌី

# QObject|
source: M24: Start/resume SD print
km: M24៖ ចាប់ផ្តើម / បន្តបោះពុម្ព SD

# QObject|
source: M25: Pause SD print
km: M25៖ ផ្អាកការបោះពុម្ព SD

# QObject|
source: M26: Set SD position
km: M26៖ កំណត់ទីតាំងអេសឌី

# QObject|
source: M27: Report SD print status
km: M27៖ រាយការណ៍ពីស្ថានភាពបោះពុម្ព SD

# QObject|
source: M28: Begin write to SD card
km: M28៖ ចាប់ផ្តើមសរសេរទៅកាតអេសឌី

# QObject|
source: M29: Stop writing to SD card
km: M29៖ ឈប់សរសេរទៅកាតអេសឌី

# QObject|
source: M30: Delete a file on the SD card
km: M30៖ លុបឯកសារនៅលើកាតអេសឌី

# QObject|
source: M31: Output time since last M109 or SD card start to serial
km: M31៖ ពេលវេលាចេញលទ្ធផលចាប់តាំងពីកាត M109 ឬកាតអេសឌីចាប់ផ្តើមឡើងជាស៊េរី

# QObject|
source: M32: Select file and start SD print
km: M32៖ ជ្រើសរើសឯកសារហើយចាប់ផ្តើមបោះពុម្ព SD

# QObject|
source: M33: Get the long name for an SD card file or folder
km: M33៖ ទទួលបានឈ្មោះវែងសម្រាប់ឯកសារឬថតឯកសារអេសឌី

# QObject|
source: M34: Set SD file sorting options
km: M34៖ កំណត់ជម្រើសតម្រៀបឯកសារប្រភេទ SD

# QObject|
source: M36: Return file information
km: M36៖ ប្រគល់ព័ត៌មានឯកសារ

# QObject|
source: M42: Switch I/O pin
km: M42៖ ប្តូរលេខកូដ I / O

# QObject|
source: M48: Measure Z-Probe repeatability
km: M48៖ វាស់សកម្មភាពម្តងទៀត Z-Probe

# QObject|
source: M70: Display message
km: M70៖ បង្ហាញសារ

# QObject|
source: M72: Play a tone or song
km: M72៖ ចាក់សម្លេងរឺបទចំរៀង

# QObject|
source: M73: Set build percentage
km: M73៖ កំណត់ភាគរយសាងសង់

# QObject|
source: M80: ATX Power On
km: M80៖ អេធីស៊ីថាមពលនៅលើ

# QObject|
source: M81: ATX Power Off
km: M81៖ អេធីស៊ីថាមពលបិទ

# QObject|
source: M82: Set extruder to absolute mode
km: M82៖ កំណត់ការបន្លំទៅរបៀបដាច់ខាត

# QObject|
source: M83: Set extruder to relative mode
km: M83៖ កំណត់ការបន្លំទៅរបៀបទាក់ទង

# QObject|
source: M84: Stop idle hold
km: M84៖ បញ្ឈប់ការទុកចោល

# QObject|
source: M85: Set Inactivity shutdown timer
km: M85៖ កំណត់កម្មវិធីបិទសកម្មភាពអសកម្ម

# QObject|
source: M92: Set axis steps per unit
km: M92៖ កំណត់ជំហានអ័ក្សក្នុងមួយឯកតា

# QObject|
source: M93: Send axis steps per unit
km: M93៖ បញ្ជូនជំហានអ័ក្សក្នុងមួយឯកតា

# QObject|
source: M98: Call Macro/Subprogram
km: M98៖ ហៅម៉ាក្រូ / Subprogram

# QObject|
source: M99: Return from Macro/Subprogram
km: M99៖ ត្រឡប់ពីម៉ាក្រូ / Subprogram

# QObject|
source: M101: Turn extruder 1 on Forward, Undo Retraction
km: M101៖ បង្វែរអ្នកបើកទី ១ បន្តទៅមុខនិងដកថយវិញ

# QObject|
source: M103: Turn all extruders off - Extruder Retraction
km: M103៖ បិទអ្នក extruders ទាំងអស់ - ការដកថយនៃការដកលុប

# QObject|
source: M104: Set Extruder Temperature
km: M104៖ កំណត់សីតុណ្ហភាព Extruder

# QObject|
source: M105: Get Extruder Temperature
km: M105៖ ទទួលសីតុណ្ហភាពកម្តៅ

# QObject|
source: M107: Fan Off
km: M107៖ កង្ហារបិទ

# QObject|
source: M108: Cancel Heating
km: M108៖ លុបចោលកំដៅ

# QObject|
source: M109: Set Extruder Temperature and Wait
km: M109៖ កំណត់សីតុណ្ហភាពបង្ហួតនិងរង់ចាំ

# QObject|
source: M110: Set Current Line Number
km: M110៖ កំណត់លេខខ្សែបច្ចុប្បន្ន

# QObject|
source: M111: Set Debug Level
km: M111៖ កំណត់កំរិតបំបាត់កំហុស

# QObject|
source: M112: Emergency Stop
km: M112៖ បញ្ឈប់បន្ទាន់

# QObject|
source: M114: Get Current Position
km: M114៖ ទទួលបានតំណែងបច្ចុប្បន្ន

# QObject|
source: M115: Get Firmware Version and Capabilities
km: M115៖ ទទួលបានកំណែកម្មវិធីនិងសមត្ថភាព

# QObject|
source: M116: Wait
km: M116៖ រង់ចាំ

# QObject|
source: M117: Display Message
km: M117៖ បង្ហាញសារ

# QObject|
source: M119: Get Endstop Status
km: M119៖ ទទួលបានស្ថានភាពបញ្ចប់

# QObject|
source: M120: Push for Smoothie and RepRap Firmware / Enable Endstop detection for Marlin
km: M120៖ ជម្រុញឱ្យកម្មវិធី Smoothie និង RepRap / បើកការរកឃើញ Endstop សម្រាប់ម៉ាលីន

# QObject|
source: M121: Pop for Smoothie and RepRap Firmware / Disable Endstop detection for Marlin
km: M121៖ ប៉ុបសម្រាប់ Smoothie និង RepRap កម្មវិធីបង្កប់ / បិទការរកឃើញ Endstop សម្រាប់ម៉ាលីន

# QObject|
source: M122: Diagnose
km: M122៖ ធ្វើរោគវិនិច្ឆ័យ

# QObject|
source: M126: Open valve
km: M126៖ សន្ទះបិទបើក

# QObject|
source: M127: Close valve
km: M127៖ បិទវ៉ាល់

# QObject|
source: M130: Set PID P value
km: M130៖ កំណត់តម្លៃ PID P

# QObject|
source: M131: Set PID I value
km: M131៖ កំណត់តម្លៃ PID I

# QObject|
source: M132: Set PID D value
km: M132៖ កំណត់តម្លៃ PID D

# QObject|
source: M133: Set PID I limit value
km: M133៖ កំណត់តម្លៃ PID I កំណត់តម្លៃ

# QObject|
source: M134: Write PID values to EEPROM
km: M134៖ សរសេរតម្លៃ PID ទៅ EEPROM

# QObject|
source: M135: Set PID sample interval
km: M135៖ កំណត់ចន្លោះគំរូគំរូ PID

# QObject|
source: M140: Set Bed Temperature - Fast
km: M140៖ កំណត់សីតុណ្ហភាពគ្រែ - លឿន

# QObject|
source: M141: Set Chamber Temperature - Fast
km: M141៖ កំណត់សីតុណ្ហភាពអង្គជំនុំជម្រះ - លឿន

# QObject|
source: M143: Maximum hot-end temperature
km: M143៖ សីតុណ្ហាភាពក្តៅអតិបរិមា

# QObject|
source: M144: Stand by your bed
km: M144៖ ឈរក្បែរគ្រែរបស់អ្នក

# QObject|
source: M150: Set display color
km: M150៖ កំណត់ពណ៌បង្ហាញ

# QObject|
source: M163: Set weight of mixed material
km: M163៖ កំណត់ទំងន់នៃវត្ថុធាតុចម្រុះ

# QObject|
source: M164: Store weights
km: M164៖ ផ្ទុកទំងន់

# QObject|
source: M190: Wait for bed temperature to reach target temp
km: M190៖ រង់ចាំសីតុណ្ហាភាពគ្រែឈានដល់សីតុណ្ហភាពគោលដៅ

# QObject|
source: M200: Set filament diameter
km: M200៖ កំណត់អង្កត់ផ្ចិតត្រង

# QObject|
source: M201: Set max printing acceleration
km: M201៖ កំណត់ការបង្កើនល្បឿនការបោះពុម្ពអតិបរមា

# QObject|
source: M202: Set max travel acceleration
km: M202៖ កំណត់ការបង្កើនល្បឿនធ្វើដំណើរអតិបរមា

# QObject|
source: M203: Set maximum feedrate
km: M203៖ កំណត់អត្រាចំណីអតិបរិមា

# QObject|
source: M204: Set default acceleration
km: M204៖ កំណត់ការបង្កើនល្បឿនលំនាំដើម

# QObject|
source: M205: Advanced settings
km: M205៖ ការកំណត់កម្រិតខ្ពស់

# QObject|
source: M206: Offset axes for Sprinter, Marlin, Smoothie, RepRap Firmware / Set eeprom value for Repetier
km: M206៖ អ័ក្សអុហ្វសិតសម្រាប់ Sprinter, Marlin, Smoothie, RepRap Firmware / កំណត់តម្លៃ eeprom សម្រាប់ Repetier

# QObject|
source: M207: Set retract length
km: M207៖ កំណត់ប្រវែងដក

# QObject|
source: M208: Set unretract length
km: M208៖ កំណត់ប្រវែងមិនស្រឡះ

# QObject|
source: M209: Enable automatic retract
km: M209៖ បើកការដកដោយស្វ័យប្រវត្តិ

# QObject|
source: M212: Set Bed Level Sensor Offset
km: M212៖ កំណត់អុហ្វសិតឧបករណ៍ចាប់កម្រិតគ្រែ

# QObject|
source: M218: Set Hotend Offset
km: M218៖ កំណត់អុហ្វសិតការពារ

# QObject|
source: M220: Set speed factor override percentage
km: M220៖ កំណត់កត្តាល្បឿនលើសភាគរយ

# QObject|
source: M221: Set extrude factor override percentage
km: M221៖ កំណត់កត្តាបដិសេធភាគរយ

# QObject|
source: M226: Wait for pin state
km: M226៖ រង់ចាំស្ថានភាពម្ជុល

# QObject|
source: M231: Set OPS parameter
km: M231៖ កំណត់ប៉ារ៉ាម៉ែត្រ OPS

# QObject|
source: M232: Read and reset max. advance values
km: M232៖ អាននិងកំណត់ឡើងវិញអតិបរិមា។ តម្លៃជាមុន

# QObject|
source: M240: Trigger camera
km: M240៖ ម៉ាស៊ីនថតកេះ

# QObject|
source: M250: Set LCD contrast
km: M250៖ កំណត់កម្រិតពន្លឺ LCD

# QObject|
source: M251: Measure Z steps from homing stop (Delta printers)
km: M251៖ វាស់រង្វាស់ Z ពីការឈប់សំចត (ម៉ាស៊ីនព្រីនធ័រ)

# QObject|
source: M280: Set servo position
km: M280៖ កំណត់ទីតាំង servo

# QObject|
source: M300: Play beep sound
km: M300៖ ចាក់សំឡេងប៊ីប

# QObject|
source: M301: Set PID parameters
km: M301៖ កំណត់ប៉ារ៉ាម៉ែត្រ PID

# QObject|
source: M302: Allow cold extrudes
km: M302៖ អនុញ្ញាតិឱ្យរីករាលដាលត្រជាក់​

# QObject|
source: M303: Run PID tuning
km: M303៖ ដំណើរការការលៃតម្រូវ PID

# QObject|
source: M304: Set PID parameters - Bed
km: M304៖ កំណត់ប៉ារ៉ាម៉ែត្រ PID - គ្រែ

# QObject|
source: M305: Set thermistor and ADC parameters
km: M305៖ កំណត់ប៉ារ៉ាម៉ែត្រកម្តៅនិងអេឌីស៊ី

# QObject|
source: M306: set home offset calculated from toolhead position
km: M306៖ កំណត់អុហ្វសិតនៅផ្ទះគណនាពីទីតាំងក្បាលឧបករណ៍

# QObject|
source: M320: Activate autolevel (Repetier)
km: M320៖ ធ្វើឱ្យអូតូលីកសកម្មឡើងវិញ

# QObject|
source: M321: Deactivate autolevel (Repetier)
km: M321៖ ធ្វើឱ្យអសកម្ម (ធ្វើឡើងវិញ)

# QObject|
source: M322: Reset autolevel matrix (Repetier)
km: M322៖ កំណត់ម៉ាទ្រីសស្វ័យប្រវត្តិឡើងវិញ (ច្រោះឡើងវិញ)

# QObject|
source: M323: Distortion correction on/off (Repetier)
km: M323៖ បិទ / ការកែតម្រូវការបង្ខូចទ្រង់ទ្រាយ (ប្តូរឡើងវិញ)

# QObject|
source: M340: Control the servos
km: M340៖ គ្រប់គ្រង servos

# QObject|
source: M350: Set microstepping mode
km: M350៖ កំណត់របៀបបង្រួមតូច

# QObject|
source: M351: Toggle MS1 MS2 pins directly
km: M351៖ បិទបើកម្ជុល MS1 MS2 ដោយផ្ទាល់

# QObject|
source: M355: Turn case lights on/off
km: M355 ៖ បិទ / បើកអំពូលភ្លើង

# QObject|
source: M360: Report firmware configuration
km: M360៖ រាយការណ៍អំពីការកំណត់រចនាសម្ព័ន្ធកម្មវិធីបង្កប់

# QObject|
source: M361: Move to Theta 90 degree position
km: M361 ៖ ផ្លាស់ទៅទីតាំង ៩០ ដឺក្រេ

# QObject|
source: M362: Move to Psi 0 degree position
km: M362 ៖ ផ្លាស់ប្តូរទៅរកទីតាំងដឺក្រេ ០ ភី

# QObject|
source: M363: Move to Psi 90 degree position
km: M363 ៖ ផ្លាស់ប្តូរទៅទីតាំង ៩០ ដឺក្រេ

# QObject|
source: M364: Move to Psi + Theta 90 degree position
km: M364 ៖ ផ្លាស់ប្តូរទៅទីតាំង ៩០ ដឺក្រេ

# QObject|
source: M365: SCARA scaling factor
km: M365៖ កត្តាធ្វើមាត្រដ្ឋាន SCARA

# QObject|
source: M366: SCARA convert trim
km: M366 ៖ ការបម្លែងកាត់SCARA

# QObject|
source: M370: Morgan manual bed level - clear map
km: M370៖ កំរិតគ្រែដោយដៃរបស់ Morgan - ផែនទីច្បាស់

# QObject|
source: M371: Move to next calibration position
km: M371៖ ផ្លាស់ប្តូរទៅទីតាំងក្រិតខ្នាតបន្ទាប់

# QObject|
source: M372: Record calibration value, and move to next position
km: M372៖ កត់ត្រាតម្លៃក្រិតខ្នាតហើយប្តូរទៅទីតាំងបន្ទាប់

# QObject|
source: M373: End bed level calibration mode
km: M373៖ បញ្ចប់របៀបក្រិតកម្រិតគ្រែ

# QObject|
source: M374: Save calibration grid
km: M374៖ រក្សាទុកក្រឡាចត្រង្គក្រិតតាមខ្នាត

# QObject|
source: M375: Display matrix / Load Matrix
km: M375៖ បង្ហាញម៉ាទ្រីស / ផ្ទុកម៉ាទ្រីស

# QObject|
source: M380: Activate solenoid
km: M380៖ ធ្វើឱ្យសារធាតុសូឡាណូលីសសកម្ម

# QObject|
source: M381: Disable all solenoids
km: M381៖ បិទសារធាតុ solenoids ទាំងអស់

# QObject|
source: M400: Wait for current moves to finish
km: M400៖ រង់ចាំការផ្លាស់ប្តូរបច្ចុប្បន្នដើម្បីបញ្ចប់

# QObject|
source: M401: Lower z-probe
km: M401៖ ការស៊ើបអង្កេត z ទាបជាង

# QObject|
source: M402: Raise z-probe
km: M402៖ លើក z-probe

# QObject|
source: M404: Filament width and nozzle diameter
km: M404៖ ទទឹងហ្វីលនិងអង្កត់ផ្ចិតរន្ធ

# QObject|
source: M405: Filament Sensor on
km: M405៖ ឧបករណ៏ Filament លើ

# QObject|
source: M406: Filament Sensor off
km: M406៖ Filament ឧបករណ៍ចាប់សញ្ញាបិទ

# QObject|
source: M407: Display filament diameter
km: M407៖ បង្ហាញអង្កត់ផ្ចិតត្រង

# QObject|
source: M408: Report JSON-style response
km: M408៖ រាយការណ៍ការឆ្លើយតបតាមបែប JSON

# QObject|
source: M420: Enable/Disable Mesh Leveling (Marlin)
km: M420៖ បើក / បិទកំរិត Mesh Leveling (Marlin)

# QObject|
source: M450: Report Printer Mode
km: M450៖ រាយការណ៍ពីរបៀបព្រីន

# QObject|
source: M451: Select FFF Printer Mode
km: M451៖ ជ្រើសរើសរបៀបម៉ាស៊ីនព្រីនធីអេហ្វអេហ្វ

# QObject|
source: M452: Select Laser Printer Mode
km: M452៖ ជ្រើសរើសរបៀបព្រីនឡាស៊ែរ

# QObject|
source: M453: Select CNC Printer Mode
km: M453៖ ជ្រើសរើសរបៀបព្រីនធ័រ CNC

# QObject|
source: M460: Define temperature range for thermistor controlled fan
km: M460៖ កំណត់ជួរសីតុណ្ហភាពសម្រាប់កង្ហារដែលគ្រប់គ្រងកម្តៅ

# QObject|
source: M500: Store parameters in EEPROM
km: M500៖ រក្សាទុកប៉ារ៉ាម៉ែត្រនៅក្នុង EEPROM

# QObject|
source: M501: Read parameters from EEPROM
km: M501៖ អានប៉ារ៉ាម៉ែត្រពី EEPROM

# QObject|
source: M502: Revert to the default 'factory settings'.
km: M502៖ ត្រឡប់ទៅលំនាំដើម 'ការកំណត់រោងចក្រ' ។

# QObject|
source: M503: Print settings
km: M503៖ ការកំណត់បោះពុម្ព​

# QObject|
source: M540: Enable/Disable 'Stop SD Print on Endstop Hit'
km: M540៖ បើកដំណើរការ / បិទដំណើរការ 'បញ្ឈប់អេសឌីព្រីកនៅលើស្ទ្រីតស្ទ្រីត'

# QObject|
source: M550: Set Name
km: M550៖ កំណត់ឈ្មោះ

# QObject|
source: M551: Set Password
km: M551៖ កំណត់លេខសម្ងាត់

# QObject|
source: M552: Set IP address
km: M552៖ កំណត់អាសយដ្ឋាន IP

# QObject|
source: M553: Set Netmask
km: M553៖ កំណត់ Netmask

# QObject|
source: M554: Set Gateway
km: M554៖ កំណត់ច្រកចេញចូល

# QObject|
source: M555: Set compatibility
km: M555៖ កំណត់ភាពឆបគ្នា

# QObject|
source: M556: Axis compensation
km: M556៖ សំណងអ័ក្ស

# QObject|
source: M557: Set Z probe point
km: M557៖ កំណត់ចំណុចស៊ើបអង្កេតរបស់ Z

# QObject|
source: M558: Set Z probe type
km: M558៖ កំណត់ប្រភេទស៊ើបអង្កេត Z

# QObject|
source: M559: Upload configuration file
km: M559៖ ផ្ទុកឯកសារកំណត់រចនាសម្ព័ន្ធឡើង

# QObject|
source: M560: Upload web page file
km: M៥៦០៖ ផ្ទុកឯកសារគេហទំព័រឡើង

# QObject|
source: M561: Set Identity Transform
km: M561៖ កំណត់អត្តសញ្ញាណប្លែង

# QObject|
source: M562: Reset temperature fault
km: M562៖ កំណត់កំហុសសីតុណ្ហភាពឡើងវិញ

# QObject|
source: M563: Define or remove a tool
km: M563៖ កំណត់ឬដកឧបករណ៍ចេញ

# QObject|
source: M564: Limit axes
km: M564៖ ដែនកំណត់អ័ក្ស

# QObject|
source: M565: Set Z probe offset
km: M565៖ កំណត់អុហ្វសិតស៊ើបអង្កេតហ្ស

# QObject|
source: M566: Set allowable instantaneous speed change
km: M566៖ កំណត់ការផ្លាស់ប្តូរល្បឿនភ្លាមៗដែលអាចអនុញ្ញាតបាន

# QObject|
source: M567: Set tool mix ratio
km: M567៖ កំណត់សមាមាត្រលាយឧបករណ៍

# QObject|
source: M568: Turn off/on tool mix ratio
km: M568៖ បិទ / បើកសមាមាត្រឧបករណ៍លាយ

# QObject|
source: M569: Set axis direction and enable values
km: M569៖ កំណត់ទិសដៅអ័ក្សនិងបើកតម្លៃ

# QObject|
source: M570: Set heater timeout
km: M570៖ កំណត់ពេលវេលាអស់កំដៅ

# QObject|
source: M571: Set output on extrude
km: M571៖ កំណត់លទ្ធផលលើការធ្វើបត្យាប័ន

# QObject|
source: M573: Report heater PWM
km: M573៖ រាយការណ៍ម៉ាស៊ីនកម្តៅ PWM

# QObject|
source: M574: Set endstop configuration
km: M574៖ កំណត់ការកំណត់រចនាសម្ព័ន្ធចុង

# QObject|
source: M575: Set serial comms parameters
km: M575៖ កំណត់ប៉ារ៉ាម៉ែត្រដាប់សៀរៀល

# QObject|
source: M577: Wait until endstop is triggered
km: M577៖ រង់ចាំរហូតដល់ចុងបញ្ចប់ត្រូវបានកេះ

# QObject|
source: M578: Fire inkjet bits
km: M578៖ អណ្តូងទឹកថ្នាំ

# QObject|
source: M579: Scale Cartesian axes
km: M579៖ ជញ្ជីងអ័ក្សកាតាសៀន

# QObject|
source: M580: Select Roland
km: M580៖ ជ្រើសរើសរ៉ូឡែន

# QObject|
source: M600: Filament change pause
km: M600៖ ការបញ្ឈប់ការផ្លាស់ប្តូររបស់ filament

# QObject|
source: M605: Set dual x-carriage movement mode
km: M605៖ កំណត់របៀបចលនារទេះរុញពីរ

# QObject|
source: M665: Set delta configuration
km: M665៖ កំណត់ការកំណត់រចនាសម្ព័ន្ធដីសណ្ត

# QObject|
source: M666: Set delta endstop adjustment
km: M666៖ កំណត់ការលៃតម្រូវចុងរបស់តំបន់ដីសណ្ត

# QObject|
source: M667: Select CoreXY mode
km: M667៖ ជ្រើសរើសរបៀប CoreXY

# QObject|
source: M851: Set Z-Probe Offset
km: M851៖ កំណត់អុហ្វសិត Z-Probe

# QObject|
source: M906: Set motor currents
km: M906៖ កំណត់ចរន្តម៉ូទ័រ

# QObject|
source: M907: Set digital trimpot motor
km: M907៖ កំណត់ម៉ូទ័រអេឡិចត្រូនិចឌីជីថល

# QObject|
source: M908: Control digital trimpot directly
km: M908៖ គ្រប់គ្រងត្រីវិស័យឌីជីថលដោយផ្ទាល់

# QObject|
source: M911: Set power monitor threshold voltages
km: M911៖ កំណត់តង់ស្យុងកម្រិតម៉ូនីទ័រថាមពល

# QObject|
source: M912: Set electronics temperature monitor adjustment
km: M912៖ កំណត់ការលៃតម្រូវម៉ូនីទ័រសីតុណ្ហភាពអេឡិចត្រូនិច

# QObject|
source: M913: Set motor percentage of normal current
km: M913៖ កំណត់ភាគរយម៉ូទ័រនៃចរន្តធម្មតា

# QObject|
source: M928: Start SD logging
km: M928៖ ចាប់ផ្តើមការកាប់ឈើអេសឌី

# QObject|
source: M997: Perform in-application firmware update
km: M997៖ អនុវត្តការធ្វើបច្ចុប្បន្នភាពកម្មវិធីបង្កប់ក្នុងកម្មវិធី

# QObject|
source: M998: Request resend of line
km: M998៖ ស្នើសុំការផ្ញើសារឡើងវិញ

# QObject|
source: M999: Restart after being stopped by error
km: M999៖ ចាប់ផ្តើមឡើងវិញបន្ទាប់ពីត្រូវបានបញ្ឈប់ដោយកំហុស

# QObject|
source: ERROR! M104: It's obligatory to have an argument
km: កំហុស! M104៖ វាចាំបាច់ត្រូវមានអំណះអំណាង

# QObject|
source: ERROR! M109: It's obligatory to have an argument
km: កំហុស! M109៖ វាចាំបាច់ត្រូវមានអំណះអំណាង

# QObject|
source: ERROR! M117: It's obligatory to have an argument
km: កំហុស! M117៖ វាចាំបាច់ត្រូវមានអំណះអំណាង

# QObject|
source: ERROR! M140: It's obligatory to have an argument
km: កំហុស! M140៖ វាចាំបាច់ត្រូវមានអំណះអំណាង

# QObject|
source: ERROR! M190: It's obligatory to have an argument
km: កំហុស! M190៖ វាចាំបាច់ត្រូវមានអំណះអំណាង

# QObject|
source: ERROR! M220: It's obligatory to have an argument
km: កំហុស! M220៖ វាចាំបាច់ត្រូវមានអំណះអំណាង

# QObject|
source: ERROR! M221: It's obligatory to have an argument
km: កំហុស! M221៖ វាចាំបាច់ត្រូវមានអំណះអំណាង

# QObject|
source: Not supported or implemented!
km: មិនគាំទ្រឬអនុវត្ត!

# MainWindow|
source: Autodetect
km: រក​ឃើញ​ដោយ​ស្វ័យ​ប្រវត្តិ

# MainWindow|
source: Attempting to locate Serial Ports
km: ព្យាយាមរកទីតាំងរន្ធសៀរៀល

# MainWindow|
source: Actual Bed
km: ជាក់ស្តែង Bed

# MainWindow|
source: Target Bed
km: គោលដៅ Bed

# MainWindow|
source: Actual Ext.1
km: ជាក់ស្តែងទី ១

# MainWindow|
source: Target Ext.1
km: គោលដៅទី ១

# MainWindow|
source: Found %1 Ports
km: រកឃើញរន្ធ %1

# MainWindow|
source: No available ports! Please connect a serial device to continue!
km: មិនមានច្រកដែលអាចប្រើបាន! សូមភ្ជាប់ឧបករណ៍សៀរៀលដើម្បីបន្ត!

# MainWindow|
source: Serial connected
km: ភ្ជាប់ស៊េរី

# MainWindow|
source: Disconnect
km: ផ្តាច់

# MainWindow|
source: No plugin loaded !
km: គ្មានកម្មវិធីជំនួយត្រូវបានផ្ទុក!

# MainWindow|
source: Requesting Firmware...
km: ស្នើសុំកម្មវិធីបង្កប់ ...

# MainWindow|
source: Disconnected
km: ផ្តាច់

# MainWindow|
source: Connect
km: ភ្ជាប់

# MainWindow|
source: Home All
km: ទំព័រដើម ទាំងអស់

# MainWindow|
source: Home X
km: ទំព័រដើម X

# MainWindow|
source: Home Y
km: ទំព័រដើម Y

# MainWindow|
source: Home Z
km: ទំព័រដើម Z

# MainWindow|
source: Error
km: កំហុស

# MainWindow|
source: Not Connected To a Printer
km: មិនបានភ្ជាប់ទៅម៉ាស៊ីនព្រីនទេ

# MainWindow|
source: A Firmware Plugin was not loaded! Please send the command M115 and let us know what your firmware returns, so we can improve our firmware detection. We have loaded the most common plugin "repetier" for you. You may try to print again after this message
km: កម្មវិធីជំនួយរបស់កម្មវិធីបង្កប់មិនត្រូវបានផ្ទុកទេ! សូមផ្ញើពាក្យបញ្ជា M115 និងអោយយើងដឹងពីអ្វីដែលកម្មវិធីបង្កប់របស់អ្នកត្រលប់មកវិញដូច្នេះយើងអាចធ្វើអោយប្រសើរឡើងនូវការរាវរកកម្មវិធីបង្កប់របស់យើង។ យើងបានផ្ទុកកម្មវិធីជំនួយទូទៅ "repetier" សម្រាប់អ្នក។ អ្នកអាចព្យាយាមបោះពុម្ពម្តងទៀតបន្ទាប់ពីសារនេះ

# MainWindow|
source: Select a file to print
km: ជ្រើសរើសឯកសារដើម្បីបោះពុម្ព

# MainWindow|
source: No File Selected
km: គ្មានឯកសារត្រូវបានជ្រើសរើសទេ

# MainWindow|
source: Print: %1
km: បោះពុម្ព៖ %1

# MainWindow|
source: Save Log to file
km: រក្សាទុកកំណត់ហេតុទៅឯកសារ

# MainWindow|
source: Print File
km: បោះពុម្ពឯកសារ

# MainWindow|
source: Pause Print
km: ផ្អាកការបោះពុម្ព

# MainWindow|
source: Resume Print
km: បន្តបោះពុម្ព

# MainWindow|
source: Extruder %1
km: ឧបករណ៍បញ្ចោញ %1

# MainWindow|
source: Fan %1 speed
km: ល្បឿនរបស់ %1

# PlotWidget|
source: Actual Bed
km: គ្រែពិត

# PlotWidget|
source: Target Bed
km: គ្រែគោលដៅ

# PlotWidget|
source: Actual Ext.1
km: ការផ្សព្វផ្សាយជាក់ស្តែង ១

# PlotWidget|
source: Target Ext.1
km: គោលដៅទី ១

# PlotWidget|
source: Temp.
km: បណ្ដោះអាសន្ន។
