Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

# More...
source: Show more schedules on the list
km: បង្ហាញកាលវិភាគបន្ថែមលើបញ្ជី

source: Enter schedule
km: បញ្ចូលកាលវិភាគ

source: Skip schedule
km: រំលងកាលវិភាគ

source: Edit schedule
km: កែសម្រួលកាលវិភាគ

source: (%1 payment)
km: (ការទូទាត់ %1)

source: To Minimum Balance / Maximum Credit
km: សមតុល្យអប្បបរមា / ឥណទានអតិបរមា

source: Favorite Reports
km: របាយការណ៍ដែលខ្ញុំចូលចិត្ត

source: Comment
km: វិចារ

source: %1 Day Forecast
km: ការទស្សទាយថ្ងៃ %1

# Forecast days
source: %1 day
km: %1 ថ្ងៃ

source: Before KMyMoney can give you detailed information about your financial status, you need to create at least one account. Until then, KMyMoney shows the welcome page instead.
km: មុននឹង KMyMoney អាចផ្តល់ឱ្យអ្នកនូវព័ត៌មានលម្អិតអំពីស្ថានភាពហិរញ្ញវត្ថុរបស់អ្នកអ្នកត្រូវបង្កើតយ៉ាងហោចណាស់គណនីមួយ។ រហូតមកដល់ពេលនោះខេខេមីយនីនបង្ហាញទំព័រស្វាគមន៍ជំនួសវិញ។

source: Assets and Liabilities Summary
km: សង្ខេបទ្រព្យសម្បត្តិនិងបំណុល

source: Asset Accounts
km: គណនីទ្រព្យសម្បត្តិ

source: Liability Accounts
km: គណនេយ្យភាពទទួលខុសត្រូវ

source: Total Assets
km: ទ្រព្យ​សរុប

source: Total Liabilities
km: បំណុល​សរុប

source: Net Worth
km: តម្លៃសុទ្ធ

source: Monthly Budgeted vs. Actual
km: ថវិកាប្រចាំខែទល់នឹងជាក់ស្តែង

source: Current Month Summary
km: សង្ខេបខែបច្ចុប្បន្ន

source: Budgeted
km: ថវិកា

source: Budget Overruns
km: ការបដិសេធថវិកា

source: No Budget Categories have been overrun
km: គ្មានប្រភេទថវិកាត្រូវបានបដិសេធ

source: Cash Flow Summary
km: សេចក្តីសង្ខេបលំហូរសាច់ប្រាក់

source: Income and Expenses of Current Month
km: ប្រាក់ចំណូលនិងចំណាយនៃខែបច្ចុប្បន្ន

source: Scheduled Income
km: ប្រាក់ចំណូលតាមកាលវិភាគ

source: Expenses
km: ការចំណាយ

source: Scheduled Expenses
km: ការចំណាយគ្រោងទុក

source: Liquid Assets and Liabilities
km: ទ្រព្យសកម្មបំណុលនិងបំណុល

source: Liquid Assets
km: ទ្រព្យសកម្មរាវ

source: Transfers to Liquid Liabilities
km: ការផ្ទេរទៅបំណុលរាវ

source: Liquid Liabilities
km: បំណុលរាវ

source: Other Transfers
km: ការផ្ទេរប្រាក់ផ្សេងទៀត

source: Cash Flow Status
km: ស្ថានភាពលំហូរសាច់ប្រាក់

source: Expected Liquid Assets
km: ទ្រព្យសកម្មរាវដែលរំពឹងទុក

source: Expected Liquid Liabilities
km: បំណុលរំពឹងទុក

source: Expected Profit/Loss
km: ចំណេញ / ខាតរំពឹងទុក

source: Remove this security item from the file
km: យកធាតុសុវត្ថិភាពនេះចេញពីឯកសារ

source: Change the security information of the selected entry.
km: ផ្លាស់ប្តូរព័ត៌មានសុវត្ថិភាពនៃធាតុដែលបានជ្រើសរើស។

source: Failed to edit security: %1
km: បានបរាជ័យក្នុងការកែសម្រួលសុវត្ថិភាព៖ %1

source: <p>Do you really want to remove the currency <b>%1</b> from the file?</p><p><i>Note: adding currencies is not currently supported.</i></p>
km: <p> តើអ្នកពិតជាចង់ដករូបិយប័ណ្ណចេញ <b> %1 </b> ពីឯកសារ? </p><p><i> សម្គាល់ៈបច្ចុប្បន្នការបន្ថែមរូបិយប័ណ្ណមិនត្រូវបានគាំទ្រទេ។ </i></p>

source: <p>Do you really want to remove the %1 <b>%2</b> from the file?</p>
km: <p> តើអ្នកពិតជាចង់យក %1 ចេញ <b> %2 </b> ពីឯកសារ? </p>

source: Delete security
km: លុបសុវត្ថិភាព

source: Investment Summary
km: សង្ខេបការវិនិយោគ

source: Select Account:
km: ជ្រើសរើសគណនី:

source: Summary of the equities contained in this account, showing your holdings and their most recent price.
km: សេចក្តីសង្ខេបនៃភាគហ៊ុនដែលមាននៅក្នុងគណនីនេះបង្ហាញពីការកាន់កាប់របស់អ្នកនិងតម្លៃថ្មីៗបំផុតរបស់ពួកគេ។

# Investment name
source: Name
km: ឈ្មោះ

# Symbol name
source: Symbol
km: និមិត្តសញ្ញា

# Investment value
source: Value
km: តម្លៃ

# Shares quantity
source: Quantity
km: បរិមាណ

# Investment price
source: Price
km: តម្លៃ

source: Securities
km: មូលបត្រ

# name of the security
source: Name
km: ឈ្មោះ

source: Market
km: ទីផ្សារ

source: Fraction
km: ប្រភាគ

source: Cash Fraction
km: ប្រភាគសាច់ប្រាក់

source: Show national currencies
km: បង្ហាញរូបិយប័ណ្ណជាតិ

source: Investments
km: ការវិនិយោគ

source: Reports
km: របាយការណ៍

source: Outbox
km: ប្រអប់ចេញ

source: Creating transactions can only be performed in the ledger view
km: ការបង្កើតប្រតិបត្តិការអាចត្រូវបានអនុវត្តតែនៅក្នុងសៀវភៅដឹកនាំប៉ុណ្ណោះ

source: Modifying transactions can only be performed in the ledger view
km: ការផ្លាស់ប្តូរប្រតិបត្តិការអាចត្រូវបានអនុវត្តតែនៅក្នុងសៀវភៅដឹកនាំប៉ុណ្ណោះ

source: Duplicating transactions can only be performed in the ledger view
km: ប្រតិបត្តិការស្ទួនអាចត្រូវបានអនុវត្តតែនៅក្នុងសៀវភៅដឹកនាំប៉ុណ្ណោះ

source: Edit the current selected transactions
km: កែសម្រួលប្រតិបត្តិការដែលបានជ្រើសរើសបច្ចុប្បន្ន

source: <p><b>%1</b> is not a KMyMoney file.</p>
km: <p><b> %1 </b> មិនមែនជាឯកសារ KMyMoney ទេ។ </p>

source: GPG is not available for decryption of file <b>%1</b>
km: GPG មិនមានសម្រាប់ការឌិគ្រីបឯកសារទេ <b> %1 </b>

source: File <b>%1</b> contains the old binary format used by KMyMoney. Please use an older version of KMyMoney (0.8.x) that still supports this format to convert it to the new XML based format.
km: ឯកសារ <b> %1 </b> មានទ្រង់ទ្រាយគោលពីរចាស់ប្រើដោយ KMyMoney ។ សូមប្រើ KMyMoney (០.៨.x) កំណែចាស់ដែលនៅតែគាំទ្រទ្រង់ទ្រាយនេះដើម្បីបំលែងវាទៅជាទ្រង់ទ្រាយផ្អែកលើ XML ថ្មី។

source: File <b>%1</b> contains an unknown file format.
km: ឯកសារ <b> %1 </b> មានទ្រង់ទ្រាយឯកសារដែលមិនស្គាល់។

source: Cannot read from file <b>%1</b>.
km: មិនអាចអានពីឯកសារ <b> %1 </b>

source: Cannot load file <b>%1</b>. Reason: %2
km: មិនអាចផ្ទុកឯកសារបានទេ <b> %1 </b> ។ មូលហេតុ: %2

source: The following error was encountered while decrypting file <b>%1</b>: %2
km: កំហុសខាងក្រោមត្រូវបានជួបប្រទះខណៈពេលឌិគ្រីបឯកសារ <b> %1 </b> : %2

source: File <b>%1</b> not found.
km: ឯកសារ <b> %1 </b> រក​មិន​ឃើញ។

source: Cannot open database %1
km: មិនអាចបើកឃ្លាំងទិន្នន័យ %1

source: An unrecoverable error occurred while reading the database
km: កំហុសដែលមិនអាចរកឃើញបានកើតឡើងខណៈពេលកំពុងអានមូលដ្ឋានទិន្នន័យ

source: Database malfunction
km: ដំណើរការទិន្នន័យមិនដំណើរការ

source: Unknown fix level in input file
km: មិនដឹងកម្រិតជួសជុលនៅក្នុងឯកសារបញ្ចូល

source: GPG does not seem to be installed on your system. Please make sure, that GPG can be found using the standard search path. This time, encryption is disabled.
km: ជីភីអេសហាក់ដូចជាមិនបានដំឡើងនៅក្នុងប្រព័ន្ធរបស់អ្នកទេ។ សូមប្រាកដថា GPG អាចត្រូវបានរកឃើញដោយប្រើផ្លូវស្វែងរកស្តង់ដារ។ ពេលនេះការដាក់លេខកូដត្រូវបានបិទ។

source: GPG not found
km: រកមិនឃើញ GPG

source: <p>You have selected to encrypt your data also with the KMyMoney recover key, but the key with id</p><p><center><b>%1</b></center></p><p>has not been found in your keyring at this time. Please make sure to import this key into your keyring. You can find it on the <a href="http://kmymoney.org/">KMyMoney web-site</a>. This time your data will not be encrypted with the KMyMoney recover key.</p>
km: <p> អ្នកបានជ្រើសដើម្បីអ៊ិនគ្រីបទិន្នន័យរបស់អ្នកជាមួយនឹងលេខកូដសង្គ្រោះខេខេមីយិនប៉ុន្តែលេខកូដមានលេខសម្គាល់ </p><p><center><b> %1 </b></center></p><p> មិនត្រូវបានរកឃើញនៅក្នុងការវាយរបស់អ្នកទេនៅពេលនេះ។ សូមប្រាកដថាបាននាំចូលកូនសោនេះទៅក្នុងការវាយរបស់អ្នក។ អ្នកអាចរកវាបាននៅលើអ៊ីនធឺណេត <a href= " http://kmymoney.org/ " > គេហទំព័រខេអិមមីនី </a> ។ ពេលនេះទិន្នន័យរបស់អ្នកនឹងមិនត្រូវបានអ៊ិនគ្រីបជាមួយកូនសោខេខេមីយនី។ </p>

source: GPG Key not found
km: រកមិនឃើញកូនសោ GPG

source: <p>You have specified to encrypt your data for the user-id</p><p><center><b>%1</b>.</center></p><p>Unfortunately, a valid key for this user-id was not found in your keyring. Please make sure to import a valid key for this user-id. This time, encryption is disabled.</p>
km: <p> អ្នកបានបញ្ជាក់ដើម្បីអ៊ិនគ្រីបទិន្នន័យរបស់អ្នកសម្រាប់លេខសម្គាល់អ្នកប្រើ </p><p><center><b> %1 </b> ។ </center></p><p> ជាអកុសលលេខកូដសុពលភាពសម្រាប់លេខសម្គាល់អ្នកប្រើនេះមិនត្រូវបានរកឃើញនៅក្នុងលេខកូដរបស់អ្នកទេ។ សូមប្រាកដថាបាននាំចូលកូនសោត្រឹមត្រូវសម្រាប់លេខសម្គាល់អ្នកប្រើនេះ។ ពេលនេះការដាក់លេខកូដត្រូវបានបិទ។ </p>

source: <p>You have configured to save your data in encrypted form using GPG. Make sure you understand that you might lose all your data if you encrypt it, but cannot decrypt it later on. If unsure, answer <b>No</b>.</p>
km: <p> អ្នកបានកំណត់រចនាសម្ព័ន្ធដើម្បីរក្សាទុកទិន្នន័យរបស់អ្នកជាទម្រង់អ៊ិនគ្រីបដោយប្រើ GPG ។ ត្រូវប្រាកដថាអ្នកយល់ថាអ្នកអាចបាត់បង់ទិន្នន័យរបស់អ្នកទាំងអស់ប្រសិនបើអ្នកអ៊ិនគ្រីបវាប៉ុន្តែមិនអាចឌិគ្រីបវាពេលក្រោយបានទេ។ បើមិនច្បាស់ឆ្លើយ <b> ទេ </b> ។ </p>

source: Store GPG encrypted
km: ផ្ទុក GPG ដែលបានអ៊ិនគ្រីប

source: Unable to open file '%1' for writing.
km: មិនអាចបើកឯកសារ '%1' សម្រាប់ការសរសេរ។

source: Failure while writing to '%1'
km: បរាជ័យពេលសរសេរទៅ '%1'

source: Tried to access a file when it has not been opened
km: ព្យាយាមចូលប្រើឯកសារនៅពេលវាមិនទាន់ត្រូវបានបើក

source: Malformed URL '%1'
km: URL មិនត្រឹមត្រូវ '%1'

source: Database contains data which must be removed before using Save As. Do you wish to continue?
km: មូលដ្ឋានទិន្នន័យមានទិន្នន័យដែលត្រូវតែលុបចោលមុនពេលប្រើប្រាស់រក្សាទុកជា។ តើអ្នកចង់បន្តទេ?

source: An unrecoverable error occurred while writing to the database. It may well be corrupt.
km: កំហុសដែលមិនអាចរកឃើញបានកើតឡើងនៅពេលសរសេរទៅមូលដ្ឋានទិន្នន័យ។ វាប្រហែលជាពុករលួយ។

source: Cannot open or create database %1. Retry Save As Database and click Help for further info.
km: មិនអាចបើកឬបង្កើតមូលដ្ឋានទិន្នន័យ %1 ។ ព្យាយាមរក្សាទុកជាមូលដ្ឋានទិន្នន័យហើយចុចជំនួយសម្រាប់ព័ត៌មានបន្ថែម។

source: Afghanistan Afghani
km: អាហ្វហ្គានីស្ថានអាហ្វហ្គានីស្ថាន

source: Albanian Lek
km: អាល់បានីលេក

source: Netherland Antillian Guilder
km: អាលែនឡង់ Antillian Guilder

source: Algerian Dinar
km: អាល់ហ្សេរីឌីណា

source: Andorran Franc
km: អង់ដូរ៉ាន់ហ្វ្រង់

source: Andorran Peseta
km: អង់ដូរ៉ាន់ប៉េហ្សា

source: Angolan New Kwanza
km: អង់ហ្គោឡាញូវវ៉ានហ្សា

source: Argentine Peso
km: ប៉េសូអាហ្សង់ទីន

source: Australian Dollar
km: ដុល្លារអូស្ត្រាលី

source: Azerbaijani Manat
km: អាមេនីអាហ្សង់ទីន

source: Bitcoin Cash
km: សាច់ប្រាក់ Bitcoin

source: Bahamian Dollar
km: ដុល្លារបាហាម៉ាន

source: Bahraini Dinar
km: បារ៉ែនឌីណា

source: Bangladeshi Taka
km: តាកាបង់ក្លាដែស

source: Barbados Dollar
km: ដុល្លារបាបាដុស

source: Belarusian Ruble
km: រូបេលបេឡារុស្ស

source: Belize Dollar
km: ដុល្លារបេលី

source: Bermudian Dollar
km: ដុល្លារប៊ឺមូឌី

source: Bhutan Ngultrum
km: ប៊ូតានង៉ុមរុម

source: Bolivian Boliviano
km: បូលីវីបូលីវី

source: Bosnian Convertible Mark
km: ម៉ាកប៊ែលហ្សិកដែលអាចបំលែងបាន

source: Botswana Pula
km: បុតស្វាណា

source: Brazilian Real
km: ប្រេស៊ីល Real

source: British Pound
km: ផោនអង់គ្លេស

source: Brunei Dollar
km: ដុល្លារប៊្រុយណេ

source: Bulgarian Lev (new)
km: លេបប៊ុលហ្គារី (ថ្មី)

source: Burundi Franc
km: ប៊ូរុនឌីហ្វ្រង់

source: Cambodia Riel
km: រៀលកម្ពុជា

source: Canadian Dollar
km: ដុល្លារកាណាដា

source: Cayman Islands Dollar
km: ដុល្លារកោះកៃម៉ាន់

source: Chilean Peso
km: ប៉េសូស៊ីលី

source: Chinese Yuan Renminbi
km: យន់ចិនមីនមីន

source: Colombian Peso
km: ប៉េសូកូឡុំប៊ី

source: Comoros Franc
km: កូម័រហ្វ្រង់ស័រ

source: Costa Rican Colon
km: កូស្តារីកាពោះវៀនធំ

source: Croatian Kuna
km: កូណាក្រូអាត

source: Cuban Peso
km: ប៉េសូគុយបា

source: Czech Koruna
km: កូរូណាឆេក

source: Danish Krone
km: ក្រូនដាណឺម៉ាក

source: Djibouti Franc
km: ជីប៊ូទីបារាំង

source: Dominican Peso
km: ដូមីនីកែនប៉េសូ

source: East Caribbean Dollar
km: ដុល្លារការ៉ាបៀនខាងកើត

source: Egyptian Pound
km: ផោនអេហ្ស៊ីប

source: El Salvador Colon
km: អ៊ីលសាវ៉ាឌ័រខូឡូន

source: Eritrean Nakfa
km: អេរីត្រេនណាក់ហ្វា

source: Estonian Kroon
km: Kroon អេស្តូន

source: Ethiopian Birr
km: Birr អេត្យូពី

source: Euro
km: អឺ

source: Falkland Islands Pound
km: ផោនកោះហ្វក់ឡែន

source: Fiji Dollar
km: ដុល្លារហ្វីជី

source: Gambian Dalasi
km: ហ្គាំប៊ីដាហ្ស៊ីស៊ី

source: Georgian Lari
km: ហ្សកហ្ស៊ីឡារី

source: Ghanaian Cedi
km: ហ្គាណាស៊ីឌី

source: Gibraltar Pound
km: ផោនហ្គីប្រាតាតា

source: Guatemalan Quetzal
km: ហ្គាតេម៉ាឡា Quetzal

source: Guinea-Bissau Peso
km: ហ្គីណេ - ប៊ីសៅប៉េសូ

source: Guyanan Dollar
km: ដុល្លារហ្គីយ៉ានណាន

source: Haitian Gourde
km: ហៃហ្កឺដ

source: Honduran Lempira
km: ហុនឌូរ៉ាឡឹមភីរ៉ា

source: Hong Kong Dollar
km: ដុល្លារហុងកុង

source: Hungarian Forint
km: ហ្វ្រីនហុងគ្រី

source: Iceland Krona
km: អ៊ីស្លង់កូរ៉ូណា

source: Indian Rupee
km: រូពីឥណ្ឌា

source: Indonesian Rupiah
km: រូពីឥណ្ឌូនេស៊ី

source: Iranian Rial
km: Rial អ៊ីរ៉ង់

source: Iraqi Dinar
km: អ៊ីរ៉ាក់ឌីណា

source: Israeli New Shekel
km: អ៊ីស្រាអែលញូហ្សេល

source: Jamaican Dollar
km: ដុល្លារហ្សាម៉ាអ៊ីក

source: Japanese Yen
km: យ៉េនជប៉ុន

source: Jordanian Dinar
km: ដានីហ្ស៊កដានី

source: Kazakhstan Tenge
km: កាហ្សាក់ស្ថានថេប

source: Kenyan Shilling
km: ស៊ីលយ៉ានស៊ីល

source: Kuwaiti Dinar
km: គុយវ៉ែតឌីណា

source: Kyrgyzstan Som
km: កៀហ្ស៊ីស៊ីស្ថានសោម

source: Laos Kip
km: ប្រាក់ដុល្លារឡាវ

source: Latvian Lats
km: ឡាតឡេនៀ

source: Lebanese Pound
km: ផោនលីបង់

source: Lesotho Loti
km: ឡេសូតូឡី

source: Liberian Dollar
km: ដុល្លារលីបេរីយ៉ា

source: Libyan Dinar
km: លីណាប្រទេសលីប៊ី

source: Macau Pataca
km: ម៉ាកាវប៉ាតាកា

source: Macedonian Denar
km: ម៉ាសេដ្យានៀ

source: Malagasy Franc
km: ម៉ាលកាហ្វ្រង់

source: Malaysian Ringgit
km: រីងហ្គីតរបស់ម៉ាឡេស៊ី

source: Maldive Rufiyaa
km: ម៉ាល់ឌីវ Rufiyaa

source: Mali Republic Franc
km: សាធារណរដ្ឋម៉ាលី

source: Mauritanian Ouguiya
km: ម៉ូរីតានីអូហ្គីយ៉ា

source: Mauritius Rupee
km: ម៉ូរីសសរូព

source: Mexican Peso
km: ប៉េសូម៉ិកស៊ីកូ

source: Mongolian Tugrik
km: Tug Tug Mongolian របស់ម៉ុងហ្គោលី

source: Moroccan Dirham
km: ម៉ារ៉ុកដារីហាម

source: Mozambique Metical
km: ម៉ូហ្សំប៊ិកប៊ិច

source: Myanmar Kyat
km: មីយ៉ាន់ម៉ា

source: Namibian Dollar
km: ដុល្លារណាមមីបៀ

source: Nepalese Rupee
km: រូពីនេប៉ាល់

source: New Zealand Dollar
km: ដុល្លារនូវែលសេឡង់

source: Nicaraguan Cordoba Oro
km: នីការ៉ាហ្គ័រខ័រដូបាអូ

source: Nigerian Naira
km: នីហ្សេរីយ៉ាណៃរ៉ា

source: North Korean Won
km: វ៉ុនកូរ៉េខាងជើង

source: Norwegian Kroner
km: ក្រូណឺរ័រវ៉េស

source: Omani Rial
km: អូម៉ានីរីល

source: Pakistan Rupee
km: រូពីប៉ាគីស្ថាន

source: Papua New Guinea Kina
km: ប៉ាពួញូហ្គីណេគីណា

source: Paraguay Guarani
km: ហ្គារ៉ាហ្កាវ៉ានៀ

source: Peruvian Nuevo Sol
km: ប៉េរូនូវ៉ូល Sol

source: Philippine Peso
km: ប៉េសូហ្វីលីពីន

source: Polish Zloty
km: ប៉ូឡូញហ្សូតូ

source: Qatari Rial
km: កាតារកាតា

source: Romanian Leu (new)
km: លូរូម៉ានី (ថ្មី)

source: Russian Ruble
km: រូលរុស្ស៊ី

source: Rwanda Franc
km: រវ៉ាន់ដាហ្វ្រង់

source: Samoan Tala
km: សាម៉ានតាឡា

source: Sao Tome and Principe Dobra
km: សៅតូមេនិងព្រីនឌូបរ៉ា

source: Saudi Riyal
km: រីអារ៉ាប៊ីសាអូឌីត

source: Serbian Dinar
km: ស៊ែរឌីណា

source: Seychelles Rupee
km: សីស្ហែលរូប

source: Sierra Leone Leone
km: សៀរ៉ាឡេអូនអូន

source: Singapore Dollar
km: ដុល្លារសិង្ហបុរី

source: Solomon Islands Dollar
km: ដុល្លារកោះសូឡូម៉ុន

source: Somali Shilling
km: Shilling សូម៉ាលី

source: South African Rand
km: រ៉េនអាហ្វ្រិកខាងត្បូង

source: South Korean Won
km: វ៉ុនកូរ៉េខាងត្បូង

source: Sri Lanka Rupee
km: រូពីស្រីលង្កា

source: St. Helena Pound
km: ផោនហេលេណាផោន

source: Sudanese Dinar
km: ស៊ូដង់ឌីណា

source: Suriname Guilder
km: ហ្គីនណែម Guilder

source: Swaziland Lilangeni
km: ស្វាហ្ស៊ីលលីលីហ្គាននី

source: Swedish Krona
km: ក្រូណាស៊ុយអែត

source: Swiss Franc
km: ហ្វ្រង់ស្វីស

source: Syrian Pound
km: ផោនស៊ីរី

source: Taiwan Dollar
km: ដុល្លារតៃវ៉ាន់

source: Tajikistan Somoni
km: តាហ្ស៊ីគីស្ថានសូម៉ាលី

source: Tanzanian Shilling
km: ស៊ីលតង់តាន

source: Thai Baht
km: ប្រាក់បាតថៃ

source: Tongan Pa'anga
km: តុងតង់ប៉ាអាហ្គាន

source: Trinidad and Tobago Dollar
km: ដុល្លារទ្រីនីដាដនិងតូបាហ្គោ

source: Tunisian Dinar
km: ទុយនីស៊ីឌីណា

source: Turkish Lira
km: លីរ៉ាតួកគី

source: Turkmenistan Manat
km: ម៉ាតូនីស្ថានម៉ាណែត

source: US Dollar
km: ដុល្លារអាមេរិក

source: Uganda Shilling
km: ស៊ីលអ៊ូហ្គង់ដា

source: Ukraine Hryvnia
km: អ៊ុយក្រែន Hryvnia

source: United Arab Emirates Dirham
km: ប្រទេសអារ៉ាប់រួម Dirham

source: Uruguayan Peso
km: ប៉េសូអ៊ុយរូហ្គាយ

source: Uzbekistani Sum
km: ស៊ូបេស្យូមស៊ូត

source: Vanuatu Vatu
km: វ៉ានូអាទូវ៉ាតទូ

source: Venezuelan Bolivar
km: ប្រទេសវេណេស៊ុយអេឡា Bolivar

source: Vietnamese Dong
km: ដុងវៀតណាម

source: Zambian Kwacha
km: Kwamb សំប៊ី

source: Zimbabwe Dollar
km: ដុល្លារហ្សីមបាវេ

source: Gold
km: មាស

source: Palladium
km: ប៉ាឡាដ្យូម

source: Platinum
km: ផ្លាទីន

source: Silver
km: ប្រាក់

source: Austrian Schilling
km: អូស្ការអូលស៊ីស

source: German Mark
km: ម៉ាកអាឡឺម៉ង់

source: French Franc
km: បារាំងហ្វ្រង់

source: Italian Lira
km: លីរ៉ាអ៊ីតាលី

source: Spanish Peseta
km: អេស្ប៉ាញប៉េតាតា

source: Dutch Guilder
km: Guilder ហូឡង់

source: Belgian Franc
km: បែលហ្ស៊ិកហ្វ្រង់

source: Luxembourg Franc
km: លុចសំបួហ្វ្រង់

source: Portuguese Escudo
km: ព័រទុយហ្គាល់ Escudo

source: Irish Pound
km: ផោនអៀរឡង់

source: Finnish Markka
km: ហ្វាំងឡង់ម៉ាកកា

source: Greek Drachma
km: Drachma ក្រិក

source: Bulgarian Lev
km: លេបប៊ុលហ្គារី

source: Romanian Leu
km: រូម៉ានីលូ

source: Russian Ruble (old)
km: រូលរុស្ស៊ី (ចាស់)

source: Slovenian Tolar
km: តូឡូស្លូ

source: Turkish Lira (old)
km: លីរ៉ាតួកគី (ចាស់)

source: Maltese Lira
km: លីឡាហេលឡា

source: Cyprus Pound
km: ផោនស៊ីប

source: Slovak Koruna
km: កូរូឡាស្លូវ៉ាគី

source: Lithuanian Litas
km: លីទុយអានីលីតា

source: Belarusian Ruble (old)
km: រូបេលបេឡារុស្ស (ចាស់)

source: <p>The account "%1" was previously created as loan account but some information is missing.</p><p>The new loan wizard will be started to collect all relevant information.</p><p>Please use KMyMoney version 0.8.7 or later and earlier than version 0.9 to correct the problem.</p>
km: <p> គណនី " %1 " ពីមុនត្រូវបានបង្កើតជាគណនីប្រាក់កម្ចីប៉ុន្តែព័ត៌មានមួយចំនួនត្រូវបានបាត់។ </p><p> អ្នកជំនួយការប្រាក់កម្ចីថ្មីនឹងត្រូវចាប់ផ្តើមប្រមូលព័ត៌មានពាក់ព័ន្ធទាំងអស់។ </p><p> សូមប្រើ KMyMoney ជំនាន់ ០.៨.៧ ឬថ្មីជាងនេះនិងលឿនជាងកំណែ ០.៩ ដើម្បីកែបញ្ហា។ </p>

source: Account problem
km: បញ្ហាគណនី

source: Unable to add schedule: %1
km: មិនអាចបន្ថែមកាលវិភាគ៖ %1

source: Fix transactions
km: ជួសជុលប្រតិបត្តិការ

source: This job cannot be edited anymore because is was sent already.
km: ការងារនេះមិនអាចត្រូវបានកែតទៅទៀតទេពីព្រោះបានបញ្ជូនរួចហើយ។

source: The plugin to edit this job is not available.
km: កម្មវិធីជំនួយដើម្បីកែសម្រួលការងារនេះមិនមានទេ។

source: You must select a single job for editing.
km: អ្នកត្រូវតែជ្រើសរើសការងារតែមួយសម្រាប់កែសម្រួល។

# The user selected credit transfers to send. But they cannot be sent.
source: Cannot send selection
km: មិនអាចផ្ញើការជ្រើសរើស

source: Not all selected credit transfers can be sent because some of them are invalid or were already sent.
km: មិនមែនរាល់ការផ្ទេរប្រាក់ដែលបានជ្រើសរើសទេដែលអាចផ្ញើរបានព្រោះផ្នែកខ្លះមិនត្រឹមត្រូវឬត្រូវបានផ្ញើរួចហើយ។

# @item Show all payees
source: All
km: ទាំងអស់

# @item Show only used payees
source: Used
km: បានប្រើ

# @item Show only unused payees
source: Unused
km: មិនបានប្រើ

source: Creates a new payee
km: បង្កើតអ្នកបង់ប្រាក់ថ្មី

source: Use this to create a new payee.
km: ប្រើវាដើម្បីបង្កើតអ្នកបង់ប្រាក់ថ្មី។

source: Rename the current selected payee
km: ប្តូរឈ្មោះអ្នកទទួលប្រាក់ដែលបានជ្រើសរើសបច្ចុប្បន្ន

source: Use this to start renaming the selected payee.
km: ប្រើវាដើម្បីចាប់ផ្តើមប្តូរឈ្មោះអ្នកបង់ប្រាក់ដែលបានជ្រើសរើស។

source: Delete selected payee(s)
km: លុបអ្នកបង់ប្រាក់ដែលបានជ្រើសរើស

source: Use this to delete the selected payee. You can also select multiple payees to be deleted.
km: ប្រើវាដើម្បីលុបអ្នកបង់ប្រាក់ដែលបានជ្រើសរើស។ អ្នកក៏អាចជ្រើសរើសអ្នកបង់ប្រាក់ជាច្រើនដែលត្រូវលុបចោល។

source: Merge multiple selected payees
km: បញ្ចូលគ្នានូវអ្នកបង់ប្រាក់ដែលបានជ្រើសរើសច្រើន

source: Use this to merge multiple selected payees.
km: ប្រើវាដើម្បីបញ្ចូលគ្នានូវអ្នកបង់ប្រាក់ដែលបានជ្រើសរើសច្រើន។

source: Use this to accept the modified data.
km: ប្រើវាដើម្បីទទួលយកទិន្នន័យដែលបានកែប្រែ។

source: A payee with the name '%1' already exists. It is not advisable to have multiple payees with the same identification name. Are you sure you would like to rename the payee?
km: អ្នកទទួលប្រាក់ឈ្នួលដែលមានឈ្មោះ '%1' មានរួចហើយ។ វាមិនត្រូវបានណែនាំឱ្យមានអ្នកបង់ប្រាក់ច្រើនដែលមានឈ្មោះដូចគ្នាទេ។ តើអ្នកពិតជាចង់ប្តូរឈ្មោះអ្នកទទួលប្រាក់ឈ្នួលមែនទេ?

source: Unable to modify payee
km: មិនអាចកែប្រែអ្នកបង់ប្រាក់បានទេ

source: Balance: %1%2
km: តុល្យភាព: %1 %2

source: Your payees
km: អ្នកបង់ប្រាក់របស់អ្នក

source: Merge
km: បញ្ចូលគ្នា

source: Balance:
km: សមតុល្យ៖

# Street address
source: Address
km: អាសយដ្ឋាន

source: Payee Information
km: ព័ត៌មានអ្នកទទួលប្រាក់

# Street address
source: Address:
km: អាស័យដ្ឋាន៖

source: Reference:
km: ឯកសារយោង៖

source: Notes
km: កំណត់ចំណាំ

# E-mail address
source: E-Mail:
km: អ៊ីមែល៖

source: Matching
km: ការផ្គូផ្គង

source: Transaction Matching
km: ការផ្គូផ្គងប្រតិបត្តិការ

source: No matching
km: មិនត្រូវគ្នា

source: Match on Payee name
km: ការប្រកួតលើឈ្មោះអ្នកបង់ប្រាក់

source: Match on a name listed below
km: ផ្គូផ្គងលើឈ្មោះដែលបានរាយខាងក្រោម

source: This list contains the names that will match this payee if a transaction is imported from an external source. Keep in mind, that you can specify regular expressions here.
km: បញ្ជីនេះមានឈ្មោះដែលនឹងត្រូវនឹងអ្នកទទួលប្រាក់នេះប្រសិនបើប្រតិបត្តិការត្រូវបាននាំចូលពីប្រភពខាងក្រៅ។ ចងចាំថាអ្នកអាចបញ្ជាក់កន្សោមធម្មតានៅទីនេះ។

source: List of matching names
km: បញ្ជីឈ្មោះត្រូវគ្នា

source: Ignore Case
km: មិនអើពើករណី

source: Default Account
km: គណនីលំនាំដើម

source: Use the default category for new transactions with this payee
km: ប្រើប្រភេទលំនាំដើមសម្រាប់ប្រតិបត្តិការថ្មី ជាមួយអ្នកបង់ប្រាក់នេះ

source: Default category:
km: ប្រភេទលំនាំដើម៖

source: Suggest a category
km: ស្នើប្រភេទ

source: Account Numbers
km: លេខគណនី

source: Show the chart version of this report
km: បង្ហាញតារាងគំនូសតាងនៃរបាយការណ៍នេះ

source: Show the report version of this chart
km: បង្ហាញកំណែរបាយការណ៍នៃតារាងនេះ

# CSV (Filefilter)
source: CSV files
km: ឯកសារ CSV

# HTML (Filefilter)
source: HTML files
km: ឯកសារ HTML

source: End date
km: កាលបរិច្ឆេទបញ្ចប់

source: Charts
km: គំនូសតាង

source: Old Customized Reports
km: របាយការណ៍តាមបំណងចាស់

source: Unknown command '%1' in KReportsView::slotOpenUrl()
km: ពាក្យបញ្ជាមិនស្គាល់ '%1' នៅក្នុង KReportsView :: slotOpenUrl ()

source: Unknown view '%1' in KReportsView::slotOpenUrl()
km: មិនស្គាល់ទិដ្ឋភាព '%1' នៅក្នុង KReportsView :: slotOpenUrl ()

source: Include Stylesheet
km: រួមបញ្ចូលសន្លឹករចនាប័ទ្ម

source: Failed to save: %1
km: បានបរាជ័យក្នុងការរក្សាទុក៖ %1

source: Default Report
km: របាយការណ៍លំនាំដើម

source: Custom Report
km: របាយការណ៍ផ្ទាល់ខ្លួន

source: %1 (Customized)
km: %1 (ប្ដូរតាមបំណង)

source: Could not find reportgroup "%1" for report "%2". Please report this error to the developer's list: kmymoney-devel@kde.org
km: មិនអាចរកក្រុមរបាយការណ៍ " %1 " សម្រាប់របាយការណ៍ " %2 " ។ សូមរាយការណ៍កំហុសនេះទៅក្នុងបញ្ជីអ្នកអភិវឌ្ឍន៍៖ kmymoney-devel@kde.org

source: Failed to configure report: %1
km: បានបរាជ័យក្នុងការតំឡើងរបាយការណ៍៖ %1

source: Cannot add report, reason: "%1"
km: មិនអាចបន្ថែមរបាយការណ៍មូលហេតុ: " %1 "

source: <b>%1</b> is a default report, so it cannot be deleted.
km: <b> %1 </b> គឺជារបាយការណ៍លំនាំដើមដូច្នេះវាមិនអាចលុបបានទេ។

source: Delete Report?
km: លុបរបាយការណ៍?

source: Are you sure you want to delete report <b>%1</b>? There is no way to recover it.
km: តើអ្នកប្រាកដជាចង់លុបរបាយការណ៍ <b> %1 </b> ? មិនមានវិធីដើម្បីស្តារវាឡើងវិញទេ។

# To open a report
source: &Open
km: បើក

# To print a report
source: &Print
km: បោះពុម្ព

# Configure a report
source: &Configure
km: កំណត់រចនាសម្ព័ន្ធ

source: &New report
km: របាយការណ៍ថ្មី

source: Income and Expenses
km: ប្រាក់ចំណូលនិងចំណាយ

source: Income and Expenses This Month
km: ប្រាក់ចំណូលនិងចំណាយក្នុងខែនេះ

source: Income and Expenses This Year
km: ប្រាក់ចំណូលនិងចំណាយក្នុងឆ្នាំនេះ

source: Income and Expenses By Year
km: ប្រាក់ចំណូលនិងចំណាយតាមឆ្នាំ

source: Income and Expenses Graph
km: ក្រាហ្វិចប្រាក់ចំណូលនិងចំណាយ

source: Income and Expenses Pie Chart
km: គំនូសតាងប្រាក់ចំណូលនិងចំណាយ

source: Net Worth By Month
km: តម្លៃសុទ្ធតាមខែ

source: Net Worth Today
km: តម្លៃសុទ្ធថ្ងៃនេះ

source: Net Worth By Year
km: តម្លៃសុទ្ធតាមឆ្នាំ

source: 7-day Cash Flow Forecast
km: ការព្យាករណ៍លំហូរសាច់ប្រាក់រយៈពេល 7 ថ្ងៃ

source: Net Worth Graph
km: ក្រាហ្វិចតម្លៃសុទ្ធ

source: Account Balances by Institution
km: សមតុល្យគណនីតាមស្ថាប័ន

source: Account Balances by Type
km: សមតុល្យគណនីតាមប្រភេទ

source: Transactions by Account
km: ប្រតិបត្តិការតាមគណនី

source: Transactions by Category
km: ប្រតិបត្តិការតាមប្រភេទ
