Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: No, no payments were made yet.
km: ទេការបង់ប្រាក់មិនទាន់ត្រូវបានធ្វើឡើងនៅឡើយទេ។

source: Yes, payments were made.
km: ត្រូវហើយការទូទាត់ត្រូវបានធ្វើឡើង។

source: Note: Payments made to obtain the loan (e.g. Dissagio) are not considered as payments in this context.
km: សម្គាល់ៈការទូទាត់ដែលបានធ្វើឡើងដើម្បីទទួលបានប្រាក់កម្ចី (ឧទាហរណ៍ឌីសូកាអូ) មិនត្រូវបានចាត់ទុកថាជាការទូទាត់ក្នុងបរិបទនេះទេ។

source: Recording payments?
km: កត់ត្រាការបង់ប្រាក់?

source: Do you want to record all payments of this loan with KMyMoney?
km: តើអ្នកចង់កត់ត្រារាល់ការទូទាត់ទាំងអស់នៃប្រាក់កម្ចីនេះជាមួយខេអិមមីនីដែរឬទេ?

source: Yes, record all payments.
km: បាទ / ចាសកត់ត្រារាល់ការបង់ប្រាក់។

source: No, only record payments since the beginning of this year.
km: ទេមានតែការទូទាត់ប្រាក់កត់ត្រាទុកតាំងពីដើមឆ្នាំនេះ។

source: KMyMoney will create a schedule for this payment and reminds you whenever a payment must be made.<p> If you selected to record all payments this date has already been supplied. If you selected to record only this years payments, then the <b>First payment due date</b> is the date of the first payment made in this year.
km: ខេអិមមីនីនឹងបង្កើតកាលវិភាគសម្រាប់ការបង់ប្រាក់នេះហើយរំyouកអ្នករាល់ពេលដែលការទូទាត់ត្រូវតែធ្វើឡើង។ <p> ប្រសិនបើអ្នកបានជ្រើសរើសដើម្បីកត់ត្រារាល់ការបង់ប្រាក់កាលបរិច្ឆេទនេះត្រូវបានផ្គត់ផ្គង់រួចហើយ។ ប្រសិនបើអ្នកបានជ្រើសរើសដើម្បីកត់ត្រាការបង់ប្រាក់នៅឆ្នាំនេះបន្ទាប់មកលេខ <b> កាលបរិច្ឆេទទូទាត់ដំបូង </b> គឺជាកាលបរិច្ឆេទនៃការទូទាត់ប្រាក់លើកដំបូងនៅឆ្នាំនេះ។

source: First payment due on:
km: ការទូទាត់មុនពេលលើ៖

source: Make payment from/to:
km: ទូទាត់ប្រាក់ពី / ទៅ៖

source: KMyMoney has calculated the loan as shown below. If you want to accept these values use the "Finish" button to update your account, otherwise use the "Back" button to modify your settings.
km: KMyMoney បានគណនាប្រាក់កម្ចីដូចដែលបានបង្ហាញខាងក្រោម។ ប្រសិនបើអ្នកចង់ទទួលយកតម្លៃទាំងនេះសូមប្រើប៊ូតុង " Finish " ដើម្បីធ្វើឱ្យគណនីរបស់អ្នកទាន់សម័យបើមិនដូច្នេះទេប្រើប៊ូតុង " ខាងក្រោយ " ដើម្បីកែប្រែការកំណត់របស់អ្នក។

source: Additional Fees:
km: កម្រៃបន្ថែម៖

source: Total payment:
km: ការទូទាត់សរុប៖

source: Valid from:
km: មាន​សុពលភាព​ចាប់ពី:

source: Affected payments:
km: ការទូទាត់ដែលរងផលប៉ះពាល់៖

source: borrowed
km: បានខ្ចី

source: lend
km: ផ្តល់​ប្រាក់កម្ចី

source: not assigned
km: មិនបានកំណត់

source: on reception
km: នៅលើការទទួលស្វាគមន៍

source: on due date
km: តាមកាលបរិច្ឆេទកំណត់

source: This page summarizes the data you entered. If you need to modify anything, please use the "Back" button to go to respective page. Otherwise use the "Finish" button to create the account.
km: ទំព័រនេះសង្ខេបទិន្នន័យដែលអ្នកបានបញ្ចូល។ ប្រសិនបើអ្នកត្រូវការកែប្រែអ្វីគ្រប់យ៉ាងសូមប្រើប៊ូតុង " Back " ដើម្បីទៅកាន់ទំព័ររៀងៗខ្លួន។ បើមិនដូច្នោះទេប្រើប៊ូតុង " បញ្ចប់ " ដើម្បីបង្កើតគណនី។

# @title loan general information
source: General
km: ទូទៅ

source: Payee:
km: អ្នកទទួលប្រាក់៖

source: First payment:
km: ការទូទាត់លើកដំបូង៖

source: Amount is:
km: ចំនួនទឹកប្រាក់គឺ:

source: Loan calculation
km: ការគណនាប្រាក់កម្ចី

source: Periodic Payment:
km: ការទូទាត់តាមកាលកំណត់៖

source: Interest category:
km: ប្រភេទចំណាប់អារម្មណ៍៖

source: Payment from:
km: ការទូទាត់ពី៖

source: Next due date:
km: កាលបរិច្ឆេទដល់កំណត់បន្ទាប់៖

source: Final Payment:
km: ការទូទាត់ចុងក្រោយ៖

source: Interest is due:
km: ការប្រាក់ត្រូវដល់កំណត់

source: Payment frequency:
km: ភាពញឹកញាប់នៃការទូទាត់៖

# Occurrence period 'days'
source: Days
km: ថ្ងៃ

source: Weeks
km: សប្តាហ៍

source: Date of next interest change
km: កាលបរិច្ឆេទនៃការផ្លាស់ប្តូរការប្រាក់បន្ទាប់

source: Select the date when the interest rate for this loan will be modified and the frequency of the future changes.
km: ជ្រើសរើសកាលបរិច្ឆេទនៅពេលអត្រាការប្រាក់សម្រាប់ប្រាក់កម្ចីនេះនឹងត្រូវបានកែប្រែហើយភាពញឹកញាប់នៃការផ្លាស់ប្តូរនាពេលអនាគត។

source: Next interest change on
km: ប្តូរចំណាប់អារម្មណ៍បន្ទាប់

source: Time until next change
km: ពេលវេលារហូតដល់ការផ្លាស់ប្តូរបន្ទាប់

source: A typical KMyMoney user maintains a checking account with some institution and uses it to receive money or pay bills. If this is not the case, please deselect the checkbox below and continue on the next page.
km: អ្នកប្រើប្រាស់ KMyMoney ធម្មតារក្សាគណនីត្រួតពិនិត្យជាមួយស្ថាប័នមួយចំនួនហើយប្រើវាដើម្បីទទួលប្រាក់ឬបង់វិក្កយបត្រ។ បើមិនដូច្នោះទេសូមដោះធីកប្រអប់ខាងក្រោមហើយបន្តនៅទំព័របន្ទាប់។

source: I have a checking account that I want to manage with KMyMoney
km: ខ្ញុំមានគណនីត្រួតពិនិត្យដែលខ្ញុំចង់គ្រប់គ្រងជាមួយខេខេមីយនី

source: The name of the institution that issued the account.
km: ឈ្មោះស្ថាប័នដែលចេញគណនី។

source: Each institution has a routing number. Enter it here. If uncertain, leave the field blank. You can modify it later.
km: ស្ថាប័ននីមួយៗមានលេខនាំផ្លូវ។ បញ្ចូលវានៅទីនេះ។ ប្រសិនបើមិនច្បាស់សូមទុកវានៅទទេ។ អ្នកអាចកែប្រែវានៅពេលក្រោយ។

source: Name of the institution
km: ឈ្មោះស្ថាប័ន

source: Routing number
km: លេខផ្លូវ

source: In general the institution that issued the account also issued a number for it. Enter it here. If uncertain, you can modify this entry later.
km: ជាទូទៅស្ថាប័នដែលចេញគណនីក៏ចេញលេខសម្រាប់វាដែរ។ បញ្ចូលវានៅទីនេះ។ ប្រសិនបើមិនច្បាស់អ្នកអាចកែប្រែធាតុនេះនៅពេលក្រោយ។

source: Enter a descriptive name that will be used by KMyMoney to identify your checking account.
km: បញ្ចូលឈ្មោះពិពណ៌នាដែលនឹងត្រូវបានប្រើដោយ KMyMoney ដើម្បីកំណត់អត្តសញ្ញាណគណនីត្រួតពិនិត្យរបស់អ្នក។

source: Enter the date from when on you plan to keep track of the transactions in that account. This is usually the date of the last statement. If uncertain, leave as is.
km: បញ្ចូលកាលបរិច្ឆេទចាប់ពីពេលដែលអ្នកគ្រោងនឹងតាមដានប្រតិបត្តិការនៅក្នុងគណនីនោះ។ នេះជាកាលបរិច្ឆេទនៃសេចក្តីថ្លែងការណ៍ចុងក្រោយ។ បើមិនច្បាស់សូមទុកវានៅដដែល។

source: Number of the account
km: ចំនួនគណនី

source: Name of the account
km: ឈ្មោះគណនី

source: Enter the opening balance of the account. This is usually the ending balance of the last statement. If uncertain, leave as is.
km: បញ្ចូលសមតុល្យបើកគណនី។ នេះជាធម្មតាតុល្យភាពបញ្ចប់នៃសេចក្តីថ្លែងចុងក្រោយ។ បើមិនច្បាស់សូមទុកវានៅដដែល។

source: The fields below allow you to enter some information about your checking account. Once this wizard finishes, the account will be created for you within KMyMoney.
km: វាលខាងក្រោមអនុញ្ញាតឱ្យអ្នកបញ្ចូលព័ត៌មានមួយចំនួនអំពីគណនីមូលប្បទានប័ត្ររបស់អ្នក។ នៅពេលដែលអ្នកជំនួយការនេះបានបញ្ចប់គណនីនឹងត្រូវបានបង្កើតសម្រាប់អ្នកនៅក្នុង KMyMoney ។

source: KMyMoney supports multiple currencies. Your reports will be based on a default currency which you can select here. The default for new accounts is also the currency you select here.
km: KMyMoney គាំទ្ររូបិយប័ណ្ណជាច្រើន។ របាយការណ៍របស់អ្នកនឹងផ្អែកលើរូបិយប័ណ្ណលំនាំដើមដែលអ្នកអាចជ្រើសរើសនៅទីនេះ។ លំនាំដើមសម្រាប់គណនីថ្មីក៏ជារូបិយប័ណ្ណដែលអ្នកជ្រើសរើសនៅទីនេះដែរ។

source: KMyMoney will store your financial data in a file on the disk. A standard filename within your KDE user environment will be the default. This is just provided for convenience and you can choose any other location here.
km: KMyMoney នឹងរក្សាទុកទិន្នន័យហិរញ្ញវត្ថុរបស់អ្នកនៅក្នុងឯកសារនៅលើឌីស។ ឈ្មោះឯកសារស្តង់ដារក្នុងបរិដ្ឋានអ្នកប្រើរបស់ KDE នឹងជាលំនាំដើម។ នេះគ្រាន់តែផ្តល់ភាពងាយស្រួលហើយអ្នកអាចជ្រើសរើសទីតាំងផ្សេងទៀតនៅទីនេះ។

source: Either the currently selected file exists or the selected directory does not exist. Please make sure, that <ul> <li>the selected directory exists and</li> <li>the filename is not currently used in this directory.</li> </ul>
km: ទាំងឯកសារដែលបានជ្រើសបច្ចុប្បន្នមានឬថតដែលបានជ្រើសរើសមិនមាន។ សូមប្រាកដថា <ul> <li> ថតដែលបានជ្រើសមានហើយ </li> <li> ឈ្មោះឯកសារបច្ចុប្បន្នមិនត្រូវបានប្រើក្នុងថតនេះទេ។ </li> </ul>

source: This finishes the setup of your KMyMoney environment. You can now press the Finish button and start using KMyMoney to record your financial transactions.
km: នេះបញ្ចប់ការរៀបចំបរិស្ថាន KMyMoney របស់អ្នក។ ឥឡូវអ្នកអាចចុចប៊ូតុងបញ្ចប់ហើយចាប់ផ្តើមប្រើ KMyMoney ដើម្បីកត់ត្រាប្រតិបត្តិការហិរញ្ញវត្ថុរបស់អ្នក។

source: Please enter some information about yourself.<br><br> This information will be seen and used only by you. The information is used to personalize KMyMoney, to encrypt your file, etc.
km: សូមបញ្ចូលព័ត៌មានខ្លះអំពីខ្លួនអ្នក។ <br><br> ព័ត៌មាននេះនឹងត្រូវបានមើលឃើញនិងប្រើប្រាស់តែអ្នកប៉ុណ្ណោះ។ ព័ត៌មានត្រូវបានប្រើដើម្បីធ្វើបដិរូបកម្មគីខេមមីនីដើម្បីអ៊ិនគ្រីបឯកសាររបស់អ្នក។ ល។

# @label email address
source: Email:
km: អ៊ីមែល៖

source: Zip code
km: លេខ​កូដ​តំបន់

source: Welcome to KMyMoney!
km: សូមស្វាគមន៍មកកាន់ KMyMoney!

source: You have started KMyMoney for the first time on this computer. Before this program can help you to manage your finances, it needs to collect some data from you.<p> On the next few pages you will be guided through the steps necessary to setup the program. This will happen only once.
km: អ្នកបានចាប់ផ្តើម KMyMoney ជាលើកដំបូងនៅលើកុំព្យូទ័រនេះ។ មុនពេលកម្មវិធីនេះអាចជួយអ្នកក្នុងការគ្រប់គ្រងហិរញ្ញវត្ថុរបស់អ្នកវាចាំបាច់ត្រូវប្រមូលទិន្នន័យមួយចំនួនពីអ្នក។ <p> នៅលើទំព័រពីរបីបន្ទាប់អ្នកនឹងត្រូវបានណែនាំតាមជំហានចាំបាច់ដើម្បីរៀបចំកម្មវិធី។ រឿងនេះនឹងកើតឡើងតែម្តង។

source: KMyMoney New File Setup
km: រៀបចំឯកសារថ្មីខេអិមមីនី

# New file wizard introduction
source: Introduction
km: សេចក្តីផ្តើម

source: Personal Data
km: ទិន្នន័យ​ផ្ទាល់ខ្លួន

source: Select Currency
km: ជ្រើសរើសរូបិយប័ណ្ណ

source: Select Accounts
km: ជ្រើសរើសគណនី

source: Set preferences
km: កំណត់ចំណូលចិត្ត

source: <p>KMyMoney can encrypt your datafile using GPG Encryption. GPG encryption is one of the most secure methods in the world for protecting data. All of your account numbers and other important financial information will be very secure.</p>
km: <p> KMyMoney អាចអ៊ិនគ្រីបឯកសារទិន្នន័យរបស់អ្នកដោយប្រើការអ៊ិនគ្រីប GPG ។ ការអ៊ិនគ្រីបជីភីអេសគឺជាវិធីសាស្ត្រមួយដែលមានសុវត្ថិភាពបំផុតនៅលើពិភពលោកសម្រាប់ការពារទិន្នន័យ។ រាល់លេខគណនីរបស់អ្នកនិងព័ត៌មានហិរញ្ញវត្ថុសំខាន់ៗដទៃទៀតនឹងមានសុវត្ថិភាព។ </p>

source: If you would like to review or change any preference settings for KMyMoney after finishing this wizard, you can do so by checking this box. If not just click <b>Next</b>.
km: ប្រសិនបើអ្នកចង់ពិនិត្យឡើងវិញឬប្តូរការកំណត់ចំណូលចិត្តណាមួយសម្រាប់ KMyMoney បន្ទាប់ពីបញ្ចប់អ្នកជំនួយការនេះអ្នកអាចធ្វើដូច្នេះបានដោយធីកប្រអប់នេះ។ បើមិនគ្រាន់តែចុចទេ <b> បន្ទាប់ </b>

source: Configure preferences after finishing the wizard.
km: កំណត់រចនាសម្ព័ន្ធចំណូលចិត្តបន្ទាប់ពីបញ្ចប់អ្នកជំនួយការ។

source: You can change the configuration options at any time using the configuration dialog. Just select the <b>Configure KMyMoney...</b> option in the <b>Settings</b> menu.
km: អ្នកអាចផ្លាស់ប្តូរជម្រើសកំណត់រចនាសម្ព័ន្ធនៅពេលណាមួយដោយប្រើប្រអប់កំណត់រចនាសម្ព័ន្ធ។ គ្រាន់តែជ្រើសឯកសារ <b> តំឡើង KMyMoney ... </b> ជម្រើសនៅក្នុង <b> ការកំណត់ </b> ម៉ឺនុយ។

source: Select groups of accounts that correspond to the ways that you will use KMyMoney. Each group you select will cause several accounts and categories to be created. Select the groups that are relevant to you. You can always create additional accounts manually later.
km: ជ្រើសរើសក្រុមគណនីដែលត្រូវនឹងវិធីដែលអ្នកនឹងប្រើ KMyMoney ។ ក្រុមនីមួយៗដែលអ្នកជ្រើសរើសនឹងបណ្តាលឱ្យបង្កើតគណនីនិងប្រភេទជាច្រើន។ ជ្រើសរើសក្រុមដែលពាក់ព័ន្ធនឹងអ្នក។ អ្នកតែងតែអាចបង្កើតគណនីបន្ថែមដោយដៃនៅពេលក្រោយ។

# @label
source: KMyMoney supports multiple currencies, nevertheless one of them will be used as your base currency. The base currency is used as default for new accounts and reports. Please select the base currency from the following list.
km: KMyMoney គាំទ្ររូបិយប័ណ្ណជាច្រើនទោះជាយ៉ាងណាក៏ដោយមួយក្នុងចំណោមរូបិយប័ណ្ណទាំងនោះនឹងត្រូវបានប្រើជារូបិយប័ណ្ណគោលរបស់អ្នក។ រូបិយប័ណ្ណគោលត្រូវបានប្រើជាលំនាំដើមសម្រាប់គណនីនិងរបាយការណ៍ថ្មី។ សូមជ្រើសរើសរូបិយប័ណ្ណគោលពីបញ្ជីខាងក្រោម។

# @title
source: ISO Code
km: កូដអាយអេសអូ

# @title
source: Symbol
km: និមិត្តសញ្ញា

source: <p>Use the fields below to enter some information about yourself.</p> <p>All information is optional and only used to personalize your KMyMoney file.</p>
km: <p> ប្រើវាលខាងក្រោមដើម្បីបញ្ចូលព័ត៌មានអំពីខ្លួនអ្នក។ </p> <p> ព័ត៌មានទាំងអស់គឺស្រេចចិត្តហើយត្រូវបានប្រើដើម្បីធ្វើបដិរូបកម្មឯកសារគីមីមីនីរបស់អ្នក។ </p>

source: Data Selector
km: ឧបករណ៍ជ្រើសរើសទិន្នន័យ

source: Only display a subset of the model in the chart:
km: បង្ហាញតែសំណុំរងនៃគំរូក្នុងគំនូសតាង៖

source: in reverse order.
km: នៅក្នុងលំដាប់បញ្ច្រាស។

source: columns starting at column
km: ជួរឈរចាប់ផ្តើមពីជួរឈរ

source: Display
km: បង្ហាញ

source: rows starting at row
km: ជួរដេកចាប់ផ្តើមនៅជួរ

source: <p>...that you can change the sort order of ledger entries by right-clicking the header of the ledger view?
km: <p> ... ដែលអ្នកអាចផ្លាស់ប្តូរលំដាប់តម្រង់ជួរធាតុបញ្ចូលដោយ ចុចម៉ៅខាងស្តាំលើក្បាលសៀវភៅដៃ?

source: <p>...that you can easily move to the other side of a transfer transaction by opening the context menu with the right mouse button and selecting one of the 'Goto' functions?
km: <p> ... ដែលអ្នកអាចផ្លាស់ទីទៅផ្នែកម្ខាងទៀតនៃប្រតិបត្តិការផ្ទេរប្រាក់បានយ៉ាងងាយស្រួល ដោយបើកម៉ឺនុយបរិបទដោយប្រើប៊ូតុងម៉ៅខាងស្តាំហើយជ្រើសរើសមុខងារមួយរបស់ 'Goto'?

source: <p>...that you can start editing a transaction by double-clicking on the transaction in the register?
km: <p> ... ដែលអ្នកអាចចាប់ផ្តើមកែសម្រួលប្រតិបត្តិការដោយចុចទ្វេដងលើប្រតិបត្តិការ នៅក្នុងការចុះឈ្មោះ?

source: <p>...that you can show more details of the selected transaction in the register by selecting the 'ledger lens' feature in the settings dialog?
km: <p> ... ដែលអ្នកអាចបង្ហាញព័ត៌មានលំអិតបន្ថែមទៀតនៃប្រតិបត្តិការដែលបានជ្រើសរើសនៅក្នុង ចុះឈ្មោះដោយជ្រើសរើសយក 'កែវថតឆ្លាស់' នៅក្នុងប្រអប់កំណត់?

source: <p>...that transactions with no category assigned or split transactions with unassigned values are marked with an exclamation mark on a yellow triangle in the register?
km: <p> ... ប្រតិបត្តិការដែលមិនមានប្រភេទត្រូវបានកំណត់ឬបំបែក ប្រតិបត្តិការដែលមានតម្លៃមិនត្រូវបានកំណត់ត្រូវបានសម្គាល់ដោយសញ្ញាឧទាន នៅលើត្រីកោណពណ៌លឿងនៅក្នុងការចុះឈ្មោះ?

source: <p>...that you can show all details of the transactions in the register by typing &lt;Ctrl-T&gt; or selecting the 'View -> Show Transaction Detail' menu entry? You can turn this feature off the same way.
km: <p> ... ដែលអ្នកអាចបង្ហាញរាល់ព័ត៌មានលំអិតនៃប្រតិបត្តិការនៅក្នុងការចុះឈ្មោះ ដោយវាយ lt; Ctrl-Tgt; ឬជ្រើសរើសយកពាក្យ“ មើល -&gt; បង្ហាញអំពីធាតុប្រតិបត្តិការ” អ្នកអាចបិទមុខងារនេះតាមរបៀបដូចគ្នា។

source: <p>...that you can switch between a listing of all accounts or an icon view of all asset and liability accounts with the tabs in the accounts view?
km: <p> ... ដែលអ្នកអាចប្តូររវាងការចុះបញ្ជីគណនីទាំងអស់ឬ មើលរូបតំណាងនៃគណនីទ្រព្យសកម្មនិងទំនួលខុសត្រូវទាំងអស់ដែលមានផ្ទាំង ក្នុងទិដ្ឋភាពគណនី?

source: <p>...that the KMyMoney development team wishes you a nice day?
km: <p> ... ថាក្រុមអភិវឌ្ឍន៍ខេអិមមីនីសូមជូនពរឱ្យអ្នកមានថ្ងៃល្អ?

source: <p>...you can use your own external filter program to convert any import format to QIF on the fly? See the QIF profile editor for more details.
km: <p> ... អ្នកអាចប្រើកម្មវិធីច្រោះខាងក្រៅផ្ទាល់ខ្លួនរបស់អ្នកដើម្បីបំលែងទ្រង់ទ្រាយនាំចូល ទៅ QIF ភ្លាមៗ។ សូមមើលកម្មវិធីកែពត៌មាន QIF សំរាប់ព័ត៌មានលំអិតបន្ថែមពី ។

source: <p>...that you can create a scheduled transaction from an existing one by selecting the context menu on a transaction in the ledger or the "More..."-menu in the transaction form?
km: <p> ... ដែលអ្នកអាចបង្កើតប្រតិបត្តិការតាមកាលវិភាគពី ដែលមានស្រាប់មួយដោយជ្រើសរើសម៉ឺនុយបរិបទលើប្រតិបតិ្តការនៅក្នុងសៀវភៅបញ្ជី ឬ " ផ្សេងៗទៀត ... " -menu នៅក្នុងទម្រង់ប្រតិបត្តិការ?

source: <p>...that you can switch to the payee of a transaction by selecting the context menu on a transaction in the ledger or in the transaction menu?
km: <p> ... ដែលអ្នកអាចប្តូរទៅអ្នកទូទាត់ប្រតិបត្តិការ ដោយជ្រើសរើសម៉ឺនុយបរិបទលើប្រតិបត្តិការនៅក្នុងសៀវភៅបញ្ជីហ្សីលហ្សិនស្ព័រហ្សីសឬនៅក្នុងបញ្ជីប្រតិបត្តិការ?

source: <p>...that you can modify the colors and fonts used for the ledgers via <i>Configure/Colors and Fonts</i>?
km: <p> ... ដែលអ្នកអាចកែប្រែពណ៌និងពុម្ពអក្សរដែលត្រូវបានប្រើសម្រាប់សៀវភៅដៃ តាមរយៈ <i> កំណត់រចនាសម្ព័ន្ធ / ពណ៌និងពុម្ពអក្សរ </i> ?

source: <p>...that you can hide transactions prior to a specific date? The date can be modified via <i>Configure/General/Filter</i>.
km: <p> ... ដែលអ្នកអាចលាក់ប្រតិបត្តិការមុនកាលបរិច្ឆេទជាក់លាក់? កាលបរិច្ឆេទអាចត្រូវបានកែប្រែតាមរយៈ <i> កំណត់រចនាសម្ព័ន្ធ / ទូទៅ / ត្រង </i> ។

source: <p>...that you can customize the "Home-Page" via <i>Configure/Home</i>?
km: <p> ... ដែលអ្នកអាចប្តូរតាមតំរូវការតាមគេហទំព័រ " តាមគេហទំព័រ " តាមរយៈ <i> កំណត់រចនាសម្ព័ន្ធ / គេហដ្ឋាន </i> ?

source: <p>...that you can add more data columns to accounts tables on your "Home-Page" via <i>Configure/Home/Account information display</i>?
km: <p> ... ដែលអ្នកអាចបន្ថែមជួរឈរទិន្នន័យបន្ថែមទៅក្នុងតារាងគណនី នៅលើ " ទំព័រដើមទំព័ររបស់អ្នក " តាមរយៈ <i> កំណត់រចនាសម្ព័ន្ធ / បង្ហាញព័ត៌មានគណនី / ទំព័រដើម / គណនី </i> ?

source: <p>...that you can enter new transactions even while reconciling an account? You can also make the transaction form visible.
km: <p> ... ដែលអ្នកអាចបញ្ចូលប្រតិបត្តិការថ្មីសូម្បីតែពេលកំពុងផ្សះផ្សាគណនី ? អ្នកក៏អាចធ្វើឱ្យទម្រង់ប្រតិបត្តិការមើលឃើញ។

source: <p>...that you can actively support the KMyMoney development team in cases that heavily depend on your data? You can save your data in an anonymized way for this support.<p> Just open your data file and immediately select <b>File/Save as...</b>. In the <b>Save As...</b> dialog select the filter <b>Anonymous Files</b> and make sure your file gets the extensions <b>.anon.xml</b>. <p> To verify, how the data looks like you are about to send away, you can open this file in KMyMoney and see how the developers see your data.
km: <p> ... ដែលអ្នកអាចគាំទ្រយ៉ាងសកម្មដល់ក្រុមអភិវឌ្ឍន៍ខេអិមមីនីនៅក្នុងករណី ដែលពឹងផ្អែកយ៉ាងខ្លាំងទៅលើទិន្នន័យរបស់អ្នក? អ្នកអាចរក្សាទុកទិន្នន័យរបស់អ្នកតាមវិធីអនាមិក សម្រាប់ការគាំទ្រនេះ។ <p> គ្រាន់តែបើកឯកសារទិន្នន័យរបស់អ្នកហើយ ជ្រើសរើសភ្លាម <b> ឯកសារ / រក្សាទុកជា ... </b> ។ ក្នុង <b> រក្សាទុក​ជា... </b> ប្រអប់ ជ្រើសយកតម្រង <b> ឯកសារអនាមិក </b> និងធ្វើឱ្យប្រាកដថាឯកសាររបស់អ្នកទទួលបាន ផ្នែកបន្ថែម <b> .anon.xml </b> ។ <p> ដើម្បីផ្ទៀងផ្ទាត់ថាតើទិន្នន័យរបស់អ្នកហាក់បីដូចជាផ្ញើទៅឆ្ងាយអ្នកអាចបើកឯកសារ នេះនៅក្នុង KMyMoney និងមើលវិធីដែលអ្នកអភិវឌ្ឍន៍មើលឃើញទិន្នន័យរបស់អ្នក។

source: <p>... that you can import your bank statements even without a network connection? Just select the file (OFX or QIF) from the File->Import menu.</p> <p>Provided by Jose Jorge</p>
km: <p> ... ដែលអ្នកអាចនាំចូលរបាយការណ៍ធនាគាររបស់អ្នកសូម្បីតែគ្មានបណ្តាញ ? គ្រាន់តែជ្រើសឯកសារ (OFX ឬ QIF) ពីម៉ឺនុយឯកសារ - នាំចូល។ </p> <p> ផ្តល់ជូនដោយចូចជេស </p>
