Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: Test new feature
km: សាកល្បងមុខងារថ្មី

source: Debug Traces
km: ដានបំបាត់កំហុស

source: Debug Timers
km: បំបាត់កំហុសកម្មវិធីកំណត់ពេលវេលា

source: Remove credit transfer
km: យកការផ្ទេរប្រាក់ចេញ

source: Edit credit transfer
km: កែសម្រួលការផ្ទេរប្រាក់

source: Show log
km: បង្ហាញកំណត់ហេតុ

source: View back
km: មើលក្រោយ

source: View forward
km: មើលទៅមុខ

source: The file has been changed, save it?
km: ឯកសារត្រូវបានផ្លាស់ប្តូររក្សាទុកទេ?

source: Creating new document...
km: កំពុងបង្កើតឯកសារថ្មី ...

source: Open a file.
km: បើកឯកសារ។

source: *.kmy *.xml|KMyMoney files *|All files
km: * .kmy * .xml | ឯកសារ KMyMoney * | ឯកសារទាំងអស់

source: Loading file...
km: កំពុងផ្ទុកឯកសារ ...

source: Cannot open file as requested. Error was: %1
km: មិនអាចបើកឯកសារតាមការស្នើសុំទេ។ កំហុសគឺ៖ %1

source: <p><b>%1</b> is either an invalid filename or the file does not exist. You can open another file or create a new one.</p>
km: <p><b> %1 </b> ជាឈ្មោះឯកសារមិនត្រឹមត្រូវឬឯកសារមិនមាន។ អ្នកអាចបើកឯកសារផ្សេងទៀតឬបង្កើតឯកសារថ្មី។ </p>

source: File not found
km: រក​មិន​ឃើញ​ឯកសារ

source: <p>File <b>%1</b> is already opened in another instance of KMyMoney</p>
km: <p> ឯកសារ <b> %1 </b> ត្រូវបានបើករួចហើយនៅក្នុងឧទាហរណ៍មួយទៀតរបស់ KMyMoney </p>

source: Duplicate open
km: ស្ទួនបើក

source: Saving file...
km: កំពុងរក្សាទុកឯកសារ ...

source: Additional encryption keys to be used: %1
km: កូនសោអ៊ិនគ្រីបបន្ថែមដែលត្រូវប្រើ៖ %1

source: Saving file with a new filename...
km: រក្សាទុកឯកសារជាមួយឈ្មោះឯកសារថ្មី ...

source: Encryption key to be used
km: កូនសោអ៊ិនគ្រីបដែលត្រូវប្រើ

source: Manage additional keys
km: គ្រប់គ្រងកូនសោបន្ថែម

source: No encryption
km: គ្មានការអ៊ិនគ្រីប

# KMyMoney (Filefilter)
source: KMyMoney files
km: ឯកសារ KMyMoney

# XML (Filefilter)
source: XML files
km: ឯកសារ XML

# Anonymous (Filefilter)
source: Anonymous files
km: ឯកសារអនាមិក

# All files (Filefilter)
source: All files
km: ឯកសារ​ទាំងអស់

source: Save As
km: រក្សាទុក​ជា

source: Saving file to database...
km: កំពុងរក្សាទុកឯកសារទៅឃ្លាំងទិន្នន័យ ...

source: Cannot save to current database.
km: មិនអាចរក្សាទុកទៅឃ្លាំងទិន្នន័យបច្ចុប្បន្នទេ។

source: Cannot save to current database: %1
km: មិនអាចរក្សាទុកទៅឃ្លាំងទិន្នន័យបច្ចុប្បន្នទេ៖ %1

source: Closing window...
km: កំពុងបិទផ្ទាំងកម្មវិធី ...

# Application is ready to use
source: Ready.
km: រួចរាល់ហើយ។

source: No KMyMoneyFile open
km: គ្មាន KMyMoneyFile បើកទេ

source: Viewing personal data...
km: មើលទិន្នន័យផ្ទាល់ខ្លួន ...

source: Edit Personal Data
km: កែសម្រួលទិន្នន័យផ្ទាល់ខ្លួន

source: Unable to store user information: %1
km: មិនអាចរក្សាទុកព័ត៌មានអ្នកប្រើប្រាស់បានទេ៖ %1

source: Importing account templates.
km: ការនាំចូលគំរូគណនី។

source: Unable to import template(s): %1, thrown in %2:%3
km: មិនអាចនាំចូលគំរូ៖ %1, បោះចោលក្នុង %2: %3

source: Exporting account templates.
km: នាំចេញគំរូគណនី។

source: *.kmt|KMyMoney template files *|All files
km: * .kmt | KMyMoney ឯកសារគំរូ * | ឯកសារទាំងអស់

source: Save as...
km: រក្សាទុក​ជា...

source: Importing file...
km: កំពុងនាំចូលឯកសារ ...

source: The statements have been processed with the following results:
km: សេចក្តីថ្លែងការណ៍ត្រូវបានដំណើរការជាមួយនឹងលទ្ធផលដូចខាងក្រោម៖

source: Statement stats
km: សេចក្តីថ្លែងការណ៍ស្ថិតិ

source: You cannot import GnuCash data into an existing file. Do you wish to save this file?
km: អ្នកមិនអាចនាំចូលទិន្នន័យ GnuCash ទៅក្នុងឯកសារដែលមានស្រាប់បានទេ។ តើអ្នកចង់រក្សាទុកឯកសារនេះទេ?

source: Importing a GnuCash file.
km: ការនាំចូលឯកសារ GnuCash ។

source: *|GnuCash files *|All files
km: * | ឯកសារ GnuCash * | ឯកសារទាំងអស់

source: Importing an XML Statement.
km: ការនាំចូលសេចក្តីថ្លែងការណ៍ XML ។

source: *.xml|XML files *|All files
km: * .xml | ឯកសារ XML * | ឯកសារទាំងអស់

source: Error importing %1: This file is not a valid KMM statement file.
km: កំហុសក្នុងការនាំចូល %1៖ ឯកសារនេះមិនមែនជាឯកសារសេចក្តីថ្លែងការណ៍របស់ខេអិមអេមត្រឹមត្រូវទេ។

source: Invalid Statement
km: សេចក្តីថ្លែងមិនត្រឹមត្រូវ

source: The statement has been processed with the following results:
km: សេចក្តីថ្លែងការណ៍ត្រូវបានដំណើរការជាមួយនឹងលទ្ធផលដូចខាងក្រោម៖

source: Exporting file...
km: កំពុងនាំចេញឯកសារ ...

source: The file <b>%1</b> already exists. Do you really want to overwrite it?
km: ឯកសារ <b> %1 </b> ធ្លាប់​មាន​រួចហើយ។ តើអ្នកពិតជាចង់សរសេរជាន់លើវាឬ?

source: File already exists
km: មានឯកសាររួចហើយ

# General settings
source: General
km: ទូទៅ

source: Home
km: ផ្ទះ

# Ledger view settings
source: Ledger
km: លីតហ្គឺរ

source: Scheduled transactions
km: ប្រតិបត្តិការដែលបានគ្រោងទុក

# Report settings
source: Reports
km: របាយការណ៍

# Forecast settings
source: Forecast
km: ការព្យាករណ៍

source: Encryption
km: ការដាក់លេខកូដ

source: Colors
km: ពណ៌

source: Fonts
km: ពុម្ពអក្សរ

source: Plugins
km: កម្មវិធីជំនួយ

source: You have configured KMyMoney to use GPG to protect your data and to encrypt your data also with the KMyMoney recover key. This key is about to expire in %1 day. Please update the key from a keyserver using your GPG frontend (e.g. KGPG).
km: អ្នកបានតំឡើង KMyMoney ដើម្បីប្រើប្រាស់ជីភីអេសដើម្បីការពារទិន្នន័យរបស់អ្នកនិងអ៊ិនគ្រីបទិន្នន័យរបស់អ្នកផងដែរជាមួយនឹងកូនសោខេខេមីយនី។ កូនសោនេះហៀបនឹងផុតកំណត់ក្នុងរយៈពេល %1 ថ្ងៃ។ សូមធ្វើបច្ចុប្បន្នភាពគ្រាប់ចុចពីអ្នកប្រើគ្រាប់ចុចដោយប្រើផ្នែកខាងមុខ GPG របស់អ្នក (ឧទាហរណ៍ KGPG) ។

source: Recover key expires soon
km: រកបានមកវិញនូវលេខកូដផុតកំណត់ក្នុងពេលឆាប់ៗនេះ

source: The file must be saved first before it can be backed up. Do you want to continue?
km: ឯកសារត្រូវតែរក្សាទុកមុនពេលដែលវាអាចត្រូវបានបម្រុងទុក។ តើអ្នកចង់បន្តទេ?

source: The current implementation of the backup functionality only supports local files as source files. Your current source file is '%1'.
km: ការអនុវត្តមុខងារបម្រុងបច្ចុប្បន្នគាំទ្រតែឯកសារមូលដ្ឋានជាឯកសារប្រភពប៉ុណ្ណោះ។ ឯកសារប្រភពបច្ចុប្បន្នរបស់អ្នកគឺ '%1' ។

source: Local files only
km: ឯកសារមូលដ្ឋានតែប៉ុណ្ណោះ

source: Mounting %1
km: ម៉ោន %1

source: Backup file for today exists on that device. Replace?
km: ឯកសារបម្រុងទុកសម្រាប់ថ្ងៃនេះមាននៅលើឧបករណ៍នោះ។ ជំនួស?

source: &Replace
km: ជំនួស

source: Writing %1
km: សរសេរ %1

source: Unmounting %1
km: ផ្ដាច់ %1

source: Error mounting device
km: មានកំហុសក្នុងការភ្ជាប់ឧបករណ៍

# Backup done
source: Done
km: ធ្វើរួច

source: File successfully backed up
km: បានបម្រុងទុកឯកសារដោយជោគជ័យ

source: Error copying file to device
km: កំហុសក្នុងការចម្លងឯកសារទៅឧបករណ៍

source: Error unmounting device
km: កំហុសក្នុងការផ្ដាច់ឧបករណ៍

source: Cannot add institution: %1
km: មិនអាចបន្ថែមស្ថាប័ន៖ %1

source: Unable to store institution: %1
km: មិនអាចរក្សាទុកស្ថាប័ន៖ %1

source: Unable to edit institution: %1
km: មិនអាចកែស្ថាប័ន៖ %1

source: <p>Do you really want to delete the institution <b>%1</b>?</p>
km: <p> តើអ្នកពិតជាចង់លុបស្ថាប័ននេះចោល <b> %1 </b> ? </p>

source: Unable to delete institution: %1
km: មិនអាចលុបស្ថាប័នបានទេ៖ %1

source: Unable to find account: %1
km: មិនអាចរកគណនីបានទេ៖ %1

source: This account is a liability and if the opening balance represents money owed, then it should be negative. Negate the amount? Please click Yes to change the opening balance to %1, Please click No to leave the amount as %2, Please click Cancel to abort the account creation.
km: គណនីនេះគឺជាការទទួលខុសត្រូវហើយប្រសិនបើសមតុល្យបើកតំណាងឱ្យប្រាក់ជំពាក់បន្ទាប់មកវាគួរតែអវិជ្ជមាន។ ចរចាចំនួន? សូមចុចបាទ / ចាសដើម្បីប្តូរសមតុល្យបើកទៅជា %1, សូមចុចទេដើម្បីបោះបង់ចំនួនទឹកប្រាក់ដែលជា %2, ។

source: Loan payout
km: ការសងប្រាក់កម្ចី

source: Unable to add account: %1
km: មិនអាចបន្ថែមគណនីបានទេ៖ %1

source: <p>The category <b>%1</b> currently does not exist. Do you want to create it?</p><p><i>The parent account will default to <b>%2</b> but can be changed in the following dialog</i>.</p>
km: <p> ប្រភេទ <b> %1 </b> បច្ចុប្បន្នមិនមាន។ តើអ្នកចង់បង្កើតវាទេ? </p><p><i> គណនីមេនឹងមិនមានទេ <b> %2 </b> ប៉ុន្តែអាចត្រូវបានផ្លាស់ប្តូរនៅក្នុងប្រអប់ខាងក្រោម </i> ។ </p>

source: Create category
km: បង្កើតប្រភេទ

source: Create a new Category
km: បង្កើតប្រភេទថ្មី

source: Unable to create account: %1
km: មិនអាចបង្កើតគណនីបានទេ៖ %1

source: The security <b>%1</b> currently does not exist as sub-account of <b>%2</b>. Do you want to create it?
km: សន្តិសុខ <b> %1 </b> បច្ចុប្បន្នមិនមានជាអនុគណនីរបស់ <b> %2 </b> ។ តើអ្នកចង់បង្កើតវាទេ?

source: Create security
km: បង្កើតសុវត្ថិភាព

source: <p>Do you really want to delete the investment <b>%1</b>?</p>
km: <p> តើអ្នកពិតជាចង់លុបចោលការវិនិយោគទេ? <b> %1 </b> ? </p>

source: Delete investment
km: លុបការវិនិយោគ

source: Unable to delete investment: %1
km: មិនអាចលុបការវិនិយោគបានទេ៖ %1

source: Unable to add scheduled transaction: %1
km: មិនអាចបន្ថែមប្រតិបត្តិការដែលបានកំណត់ពេលបានទេ៖ %1

source: Adjusting transactions...
km: កែសម្រួលប្រតិបត្តិការ ...

source: Adjusting scheduled transactions...
km: កែសម្រួលប្រតិបត្តិការតាមកាលវិភាគ ...

source: Adjusting budgets...
km: កែសំរួលថវិកា ...

source: Unable to exchange category <b>%1</b> with category <b>%2</b>. Reason: %3
km: មិនអាចផ្លាស់ប្តូរប្រភេទ <b> %1 </b> ជាមួយប្រភេទ <b> %2 </b> ។ ហេតុផល: %3

source: Do you really want to delete category <b>%1</b>?
km: តើអ្នកពិតជាចង់លុបប្រភេទ <b> %1 </b>

source: Unable to delete category <b>%1</b>. Cause: %2
km: មិនអាចលុបប្រភេទបានទេ <b> %1 </b> ។ មូលហេតុ៖ %2

source: Do you want to delete category <b>%1</b> with all its sub-categories or only the category itself? If you only delete the category itself, all its sub-categories will be made sub-categories of <b>%2</b>.
km: តើអ្នកចង់លុបប្រភេទទេ <b> %1 </b> ជាមួយប្រភេទរងទាំងអស់ឬមានតែប្រភេទខ្លួនវាផ្ទាល់? ប្រសិនបើអ្នកលុបប្រភេទខ្លួនឯងតែប្រភេទរងទាំងអស់នឹងត្រូវបានបង្កើតជាអនុប្រភេទ <b> %2 </b>

source: Delete all
km: លុប​ទាំងអស់

source: Just the category
km: គ្រាន់តែប្រភេទ

source: <p>Some sub-categories of category <b>%1</b> cannot be deleted, because they are still used. They will be made sub-categories of <b>%2</b>. Proceed?</p>
km: <p> ប្រភេទរងមួយចំនួននៃប្រភេទ <b> %1 </b> មិនអាចលុបបានទេពីព្រោះពួកវានៅតែត្រូវបានប្រើ។ ពួកគេនឹងត្រូវបានធ្វើឱ្យប្រភេទរងនៃ <b> %2 </b> ។ បន្តឬ? </p>

source: Unable to delete a sub-category of category <b>%1</b>. Reason: %2
km: មិនអាចលុបប្រភេទរងនៃប្រភេទ <b> %1 </b> ។ មូលហេតុ: %2

source: <p>Do you really want to delete account <b>%1</b>?</p>
km: <p> តើអ្នកពិតជាចង់លុបគណនីមែនឬ? <b> %1 </b> ? </p>

source: Unable to delete account '%1'. Cause: %2
km: មិនអាចលុបគណនី '%1' ទេ។ មូលហេតុ៖ %2

source: Edit account '%1'
km: កែគណនី '%1'

source: Edit category '%1'
km: កែសម្រួលប្រភេទ '%1'

source: Unable to modify account '%1'. Cause: %2
km: មិនអាចកែប្រែគណនី '%1' ។ មូលហេតុ៖ %2

source: Running automatic reconciliation
km: ដំណើរការការផ្សះផ្សាដោយស្វ័យប្រវត្តិ

source: KMyMoney has detected some overdue scheduled transactions for this account. Do you want to enter those scheduled transactions now?
km: KMyMoney បានរកឃើញប្រតិបត្តិការដែលហួសពេលសម្រាប់គណនីនេះ។ តើអ្នកចង់បញ្ចូលប្រតិបត្តិការដែលបានគ្រោងទុកឥឡូវនេះទេ?

source: Scheduled transactions found
km: បានរកឃើញប្រតិបត្តិការដែលបានគ្រោងទុក

source: KMyMoney has detected transactions matching your reconciliation data. Would you like KMyMoney to clear these transactions for you?
km: KMyMoney បានរកឃើញប្រតិបត្តិការដែលត្រូវគ្នានឹងទិន្នន័យការផ្សះផ្សារបស់អ្នក។ តើអ្នកចង់អោយ KMyMoney លុបចោលប្រតិបត្តិការទាំងនេះសម្រាប់អ្នកទេ?

source: You are about to finish the reconciliation of this account with a difference between your bank statement and the transactions marked as cleared. Are you sure you want to finish the reconciliation?
km: អ្នករៀបនឹងបញ្ចប់ការផ្សះផ្សាគណនីនេះដោយមានភាពខុសគ្នារវាងរបាយការណ៍ធនាគាររបស់អ្នកនិងប្រតិបត្តិការដែលបានសម្គាល់ថាបានជម្រះ។ តើអ្នកពិតជាចង់បញ្ចប់ការផ្សះផ្សារមែនទេ?

source: Confirm end of reconciliation
km: បញ្ជាក់ការបញ្ចប់នៃការផ្សះផ្សា

source: The balance of the account must be zero before the account can be closed
km: សមតុល្យគណនីត្រូវតែសូន្យមុនពេលបិទគណនី

source: All subaccounts must be closed before the account can be closed
km: រាល់គណនីរងត្រូវតែបិទមុនពេលគណនីអាចត្រូវបានបិទ

source: This account is still included in an active schedule
km: គណនីនេះនៅតែត្រូវបានបញ្ចូលក្នុងកាលវិភាគសកម្ម

source: You have closed this account. It remains in the system because you have transactions which still refer to it, but it is not shown in the views. You can make it visible again by going to the View menu and selecting <b>Show all accounts</b> or by deselecting the <b>Do not show closed accounts</b> setting.
km: អ្នកបានបិទគណនីនេះ។ វានៅតែមាននៅក្នុងប្រព័ន្ធពីព្រោះអ្នកមានប្រតិបត្តិការដែលនៅតែយោងលើវាប៉ុន្តែវាមិនត្រូវបានបង្ហាញនៅក្នុងទស្សនៈទេ។ អ្នកអាចធ្វើឱ្យវាមើលឃើញម្តងទៀតដោយចូលទៅកាន់ម៉ឺនុយមើលហើយជ្រើសរើស <b> បង្ហាញគណនីទាំងអស់ </b> ឬដោយដោះជ្រើសយកឯកសារ <b> កុំបង្ហាញគណនីបិទ </b> ការកំណត់។

source: Information
km: ព័ត៌មាន

source: <p><b>%1</b> cannot be moved to institution <b>%2</b>. Reason: %3</p>
km: <p><b> %1 </b> មិនអាចផ្លាស់ទៅស្ថាប័នបានទេ <b> %2 </b> ។ ហេតុផល: %3 </p>

source: <p><b>%1</b> cannot be moved to <b>%2</b>. Reason: %3</p>
km: <p><b> %1 </b> មិនអាចត្រូវបានផ្លាស់ទីទៅ <b> %2 </b> ។ ហេតុផល: %3 </p>

source: %1 YTD Account Transactions
km: ប្រតិបត្តិការគណនី %1 YTD

source: Add scheduled transaction
km: បន្ថែមប្រតិបត្តិការតាមកាលវិភាគ

source: You have entered a scheduled transaction date of <b>%1</b>. Because the scheduled transaction was last paid on <b>%2</b>, KMyMoney will automatically adjust the scheduled transaction date to the next date unless the last payment date is reset. Do you want to reset the last payment date?
km: អ្នកបានបញ្ចូលកាលបរិច្ឆេទប្រតិបត្តិការដែលបានកំណត់ពេលហើយ <b> %1 </b> ។ ដោយសារតែប្រតិបត្តិការដែលបានគ្រោងទុកត្រូវបានបង់ចុងក្រោយ <b> %2 </b> , KMyMoney នឹងធ្វើការកែសម្រួលកាលបរិច្ឆេទប្រតិបត្តិការដែលបានកំណត់ទៅកាលបរិច្ឆេទបន្ទាប់ដោយស្វ័យប្រវត្តិប្រសិនបើកាលបរិច្ឆេទទូទាត់ចុងក្រោយត្រូវបានកំណត់ឡើងវិញ។ តើអ្នកចង់កំណត់កាលបរិច្ឆេទទូទាត់ចុងក្រោយទេ?

source: Reset Last Payment Date
km: កំណត់កាលបរិច្ឆេទទូទាត់ចុងក្រោយ

source: Unable to modify scheduled transaction '%1'
km: មិនអាចកែប្រែប្រតិបត្តិការដែលបានកំណត់ពេល '%1'

source: <p>Are you sure you want to delete the scheduled transaction <b>%1</b>?</p>
km: <p> តើអ្នកពិតជាចង់លុបប្រតិបត្តិការដែលបានកំណត់ពេលហើយ <b> %1 </b> ? </p>

source: In case of loan payments it is currently not possible to recreate the scheduled transaction.
km: ក្នុងករណីការទូទាត់ប្រាក់កម្ចីបច្ចុប្បន្នវាមិនអាចទៅរួចទេដើម្បីបង្កើតឡើងវិញនូវប្រតិបត្តិការដែលបានគ្រោងទុក។

source: Unable to remove scheduled transaction '%1'
km: មិនអាចលុបប្រតិបត្តិការដែលបានកំណត់ពេល '%1'

# Copy of scheduled transaction name
source: Copy of %1
km: ចម្លងនៃ %1

source: Unable to duplicate scheduled transaction: '%1'
km: មិនអាចស្ទួនប្រតិបត្តិការដែលបានគ្រោងទុកទេ៖ '%1'

source: Unknown scheduled transaction '%1'
km: មិនស្គាល់ប្រតិបត្តិការដែលបានកំណត់ពេល '%1'

source: Do you really want to skip the <b>%1</b> transaction scheduled for <b>%2</b>?
km: តើអ្នកពិតជាចង់រំលងឯកសារ <b> %1 </b> ប្រតិបត្តិការបានកំណត់ពេលសម្រាប់ <b> %2 </b>

source: Unable to skip scheduled transaction <b>%1</b>.
km: មិនអាចរំលងប្រតិបត្តិការដែលបានកំណត់ពេលបានទេ <b> %1 </b>

source: Unable to enter scheduled transaction '%1'
km: មិនអាចបញ្ចូលប្រតិបត្តិការដែលបានកំណត់ពេល '%1'

source: Are you sure you wish to stop this scheduled transaction from being entered into the register? KMyMoney will prompt you again next time it starts unless you manually enter it later.
km: តើអ្នកពិតជាចង់បញ្ឈប់ប្រតិបត្តិការដែលបានគ្រោងទុកនេះពីការចូលក្នុងបញ្ជីទេ? KMyMoney នឹងជម្រុញអ្នកម្តងទៀតនៅពេលដែលវាចាប់ផ្តើមលុះត្រាតែអ្នកបញ្ចូលវានៅពេលក្រោយ។

source: New Payee
km: អ្នកទទួលប្រាក់ថ្មី

source: Do you want to add <b>%1</b> as payer/receiver?
km: តើអ្នកចង់បន្ថែមទេ <b> %1 </b> ជាអ្នកបង់ប្រាក់ / អ្នកទទួល?

source: Unable to add payee
km: មិនអាចបន្ថែមអ្នកបង់ប្រាក់បានទេ

source: <p>Do you really want to remove the payee <b>%1</b>?</p>
km: <p> តើអ្នកពិតជាចង់ដកប្រាក់បំណាច់ <b> %1 </b> ? </p>

source: Do you really want to remove all selected payees?
km: តើអ្នកពិតជាចង់លុបអ្នកបង់ប្រាក់ដែលបានជ្រើសរើសទាំងអស់ចេញមែនទេ?

source: Remove Payee
km: យកអ្នកទទួលប្រាក់ចេញ

source: <p>Do you really want to merge the selected payees?
km: <p> តើអ្នកពិតជាចង់ច្របាច់បញ្ចូលអ្នកបង់ប្រាក់ដែលបានជ្រើសរើសទេ?

source: Merge Payees
km: បញ្ចូលគ្នានូវអ្នកបង់ប្រាក់

source: At least one transaction/scheduled transaction or loan account is still referenced by a payee. Currently you have all payees selected. However, at least one payee must remain so that the transaction/scheduled transaction or loan account can be reassigned.
km: យ៉ាងហោចណាស់ប្រតិបត្តិការមួយ / ប្រតិបត្តិការដែលបានគ្រោងទុកឬគណនីប្រាក់កម្ចីនៅតែត្រូវបានយោងដោយអ្នកបង់ប្រាក់។ បច្ចុប្បន្នអ្នកបានជ្រើសរើសអ្នកបង់ប្រាក់ទាំងអស់។ ទោះយ៉ាងណាក៏ដោយយ៉ាងហោចណាស់អ្នកទទួលប្រាក់ខែម្នាក់ត្រូវតែនៅដដែលដូច្នេះប្រតិបត្តិការប្រតិបត្តិការ / ប្រតិបត្តិការដែលបានគ្រោងទុកឬគណនីប្រាក់កម្ចីអាចត្រូវបានកំណត់ឡើងវិញ។

source: Unable to reassign payee of transaction/split
km: មិនអាចប្រគល់ប្រាក់ឈ្នួលប្រតិបតិ្តការ / ការបំបែកផ្សេងៗគ្នាទេ

source: Nothing to merge.
km: គ្មានអ្វីត្រូវបញ្ចូលគ្នាទេ។

source: Unable to remove payee(s)
km: មិនអាចដកអ្នកទទួលប្រាក់ឈ្នួល

source: New Tag
km: ស្លាកថ្មី

source: Do you want to add <b>%1</b> as tag?
km: តើអ្នកចង់បន្ថែមទេ <b> %1 </b> ជាស្លាក?

source: Unable to add tag
km: មិនអាចបន្ថែមស្លាកបានទេ

source: <p>Do you really want to remove the tag <b>%1</b>?</p>
km: <p> តើអ្នកពិតជាចង់លុបស្លាកនោះចោលឬ? <b> %1 </b> ? </p>

source: Do you really want to remove all selected tags?
km: តើអ្នកពិតជាចង់លុបស្លាកដែលបានជ្រើសរើសទាំងអស់ចេញឬ?

source: Remove Tag
km: យកស្លាកចេញ

source: At least one transaction/scheduled transaction is still referenced by a tag. Currently you have all tags selected. However, at least one tag must remain so that the transaction/scheduled transaction can be reassigned.
km: យ៉ាងហោចណាស់ប្រតិបត្តិការមួយ / ប្រតិបត្តិការដែលបានគ្រោងទុកនៅតែត្រូវបានយោងដោយស្លាក។ បច្ចុប្បន្នអ្នកបានជ្រើសរើសស្លាកទាំងអស់។ ទោះយ៉ាងណាក៏ដោយយ៉ាងហោចណាស់ស្លាកមួយត្រូវតែមានដើម្បីឱ្យប្រតិបត្តិការ / ប្រតិបត្តិការដែលបានគ្រោងទុកអាចត្រូវបានកំណត់ឡើងវិញ។

source: Unable to reassign tag of transaction/split
km: មិនអាចផ្តល់ស្លាកប្រតិបត្តិការឡើងវិញ / បំបែកបានទេ

source: Unable to remove tag(s)
km: មិនអាចលុបស្លាកបាន

source: Enter ISO 4217 code for the new currency
km: បញ្ចូលលេខកូដអាយអេសអាយ ៤២១7zម្រាប់រូបិយប័ណ្ណថ្មី

source: Cannot create new currency. %1
km: មិនអាចបង្កើតរូបិយប័ណ្ណថ្មីបានទេ។ %1

source: Cannot update currency. %1
km: មិនអាចធ្វើបច្ចុប្បន្នភាពរូបិយប័ណ្ណ។ %1

source: Update currency
km: ធ្វើបច្ចុប្បន្នភាពរូបិយប័ណ្ណ

source: Cannot delete currency %1. %2
km: មិនអាចលុបរូបិយប័ណ្ណ %1 ។ %2

source: Cannot set %1 as base currency: %2
km: មិនអាចកំណត់ %1 ជារូបិយប័ណ្ណគោល៖ %2

source: Set base currency
km: កំណត់រូបិយប័ណ្ណគោល

source: Budget <numid>%1</numid>
km: ថវិកា <numid> %1 </numid>

source: Budget <numid>%1</numid> (<numid>%2</numid>)
km: ថវិកា <numid> %1 </numid> ( <numid> %2 </numid>

source: Unable to add budget: %1, thrown in %2:%3
km: មិនអាចបន្ថែមថវិកា៖ %1, បោះចោលក្នុង %2: %3

source: <p>Do you really want to remove the budget <b>%1</b>?</p>
km: <p> តើអ្នកពិតជាចង់ដកថវិកាចេញទេ? <b> %1 </b> ? </p>

source: Do you really want to remove all selected budgets?
km: តើអ្នកពិតជាចង់លុបថវិកាដែលបានជ្រើសរើសទាំងអស់មែនទេ?

source: Remove Budget
km: យកថវិកាចេញ

source: Unable to remove budget: %1, thrown in %2:%3
km: មិនអាចយកថវិកាចេញទេ៖ %1, បោះចោលក្នុង %2: %3

source: Copy of %1
km: ច្បាប់ចម្លងនៃ %1

source: Select year
km: ជ្រើសរើសឆ្នាំ

source: Budget year
km: ឆ្នាំថវិកា

source: Unable to modify budget: %1, thrown in %2:%3
km: មិនអាចកែប្រែថវិកាបានទេ៖ %1, បោះចោលក្នុង %2: %3

source: The current budget already contains data. Continuing will replace all current values of this budget.
km: ថវិកាបច្ចុប្បន្នមានទិន្នន័យរួចហើយ។ ការបន្តនឹងជំនួសរាល់តម្លៃបច្ចុប្បន្ននៃថវិកានេះ។

# Warning message box
source: Warning
km: ការព្រមាន

source: Please be aware that changes made in the following dialog affect all KDE applications not only KMyMoney.
km: សូមជ្រាបថាការផ្លាស់ប្តូរដែលបានធ្វើនៅក្នុងប្រអប់ខាងក្រោមនឹងប៉ះពាល់ដល់កម្មវិធីរបស់ KDE ទាំងអស់មិនត្រឹមតែ KMyMoney ប៉ុណ្ណោះទេ។

source: At least one split of the selected transactions has been reconciled. Do you wish to delete the transactions anyway?
km: យ៉ាងហោចណាស់ការបែងចែកប្រតិបត្តិការដែលបានជ្រើសរើសត្រូវបានផ្សះផ្សា។ ទោះយ៉ាងណាអ្នកចង់លុបចោលប្រតិបត្តិការទេ?

source: Transaction already reconciled
km: ប្រតិបត្តិការបានផ្សះផ្សារួចហើយ

source: Do you really want to delete the selected transaction?
km: តើអ្នកពិតជាចង់លុបប្រតិបត្តិការដែលបានជ្រើសរើសមែនទេ?

source: Delete transaction
km: លុបប្រតិបត្តិការ

source: Deleting transactions
km: លុបប្រតិបត្តិការ

source: Duplicating transactions
km: ប្រតិបត្តិការស្ទួន

source: Unable to duplicate transaction(s): %1, thrown in %2:%3
km: មិនអាចធ្វើប្រតិបត្តិការស្ទួនគ្នាបានទេ៖ %1, បោះចោលក្នុង %2: %3

source: Unable to delete transaction(s): %1, thrown in %2:%3
km: មិនអាចលុបប្រតិបត្តិការ៖ %1, បោះចោលក្នុង %2: %3

source: Unable to modify transaction: %1, thrown in %2:%3
km: មិនអាចកែប្រែប្រតិបត្តិការបានទេ: %1, បោះចោលក្នុង %2: %3

source: <p>Please select what you want to do: discard the changes, save the changes or continue to edit the transaction.</p><p>You can also set an option to save the transaction automatically when e.g. selecting another transaction.</p>
km: <p> សូមជ្រើសរើសអ្វីដែលអ្នកចង់ធ្វើ៖ បោះចោលការផ្លាស់ប្តូររក្សាទុកការផ្លាស់ប្តូរឬបន្តកែសម្រួលប្រតិបត្តិការ។ </p><p> អ្នកក៏អាចកំណត់ជម្រើសដើម្បីរក្សាទុកប្រតិបត្តិការដោយស្វ័យប្រវត្តិនៅពេលឧទាហរណ៍ការជ្រើសរើសប្រតិបត្តិការផ្សេងទៀត។ </p>

source: End transaction edit
km: បញ្ចប់ការកែប្រតិបត្តិការ

source: Unable to accept transaction: %1, thrown in %2:%3
km: មិនអាចទទួលយកប្រតិបត្តិការបានទេ៖ %1, បោះចោលក្នុង %2: %3

source: Unable to unmatch the selected transactions
km: មិនអាចដោះប្រតិបត្តិការដែលបានជ្រើសរើសទេ

source: No manually entered transaction selected for matching
km: មិនមានប្រតិបត្តិការដែលបានបញ្ចូលដោយដៃត្រូវបានជ្រើសរើសសម្រាប់ការផ្គូផ្គង

source: No imported transaction selected for matching
km: មិនមានប្រតិបត្តិការនាំចូលត្រូវបានជ្រើសរើសសម្រាប់ការផ្គូផ្គង

source: Unable to match the selected transactions
km: មិនអាចផ្គូផ្គងប្រតិបត្តិការដែលបានជ្រើស

source: Untitled
km: គ្មានចំណងជើង

source: Create a new transaction
km: បង្កើតប្រតិបត្តិការថ្មី

source: Duplicate the current selected transactions
km: ចម្លងប្រតិបត្តិការដែលបានជ្រើសរើសបច្ចុប្បន្ន

# Button text for unmatch transaction
source: Unmatch
km: ដក

source: Reconcile
km: ផ្សះផ្សា

source: Reconcile - disabled because you are currently reconciling <b>%1</b>
km: ផ្សះផ្សា - ត្រូវបានបិទពីព្រោះអ្នកកំពុងផ្សះផ្សា <b> %1 </b>

source: Go to '%1'
km: ទៅកាន់ '%1'

source: Running consistency check...
km: ដំណើរការត្រួតពិនិត្យភាពស្ថិតស្ថេរ ...

source: Consistency check failed: %1
km: ការត្រួតពិនិត្យភាពស្ថិតស្ថេរបានបរាជ័យ៖ %1

source: The consistency check has found no issues in your data. Details are presented below.
km: ការត្រួតពិនិត្យភាពស្ថិតស្ថេរមិនមានបញ្ហានៅក្នុងទិន្នន័យរបស់អ្នកទេ។ ព័ត៌មានលម្អិតត្រូវបានបង្ហាញខាងក្រោម។

source: The consistency check has found some issues in your data. Details are presented below. Those issues that could not be corrected automatically need to be solved by the user.
km: ការត្រួតពិនិត្យភាពស្ថិតស្ថេរបានរកឃើញបញ្ហាមួយចំនួននៅក្នុងទិន្នន័យរបស់អ្នក។ ព័ត៌មានលម្អិតត្រូវបានបង្ហាញខាងក្រោម។ បញ្ហាទាំងនោះដែលមិនអាចកែបានដោយស្វ័យប្រវត្តិត្រូវដោះស្រាយដោយអ្នកប្រើប្រាស់។

source: Consistency check result
km: លទ្ធផលពិនិត្យភាពស្ថិតស្ថេរ

source: Checking for overdue scheduled transactions...
km: កំពុងពិនិត្យមើលប្រតិបត្តិការដែលហួសកាលបរិច្ឆេទកំណត់ ...

source: You must first select a KMyMoney file before you can import a statement.
km: ដំបូងអ្នកត្រូវជ្រើសរើសឯកសារ KMyMoney មុនពេលអ្នកអាចនាំចូលសេចក្តីថ្លែងការណ៍។

source: Importing a statement via Web Connect
km: ការនាំចូលសេចក្តីថ្លែងការណ៍តាមរយៈបណ្តាញភ្ជាប់

source: Unable to import %1 using %2 plugin. The plugin returned the following error: %3
km: មិនអាចនាំចូល %1 ដោយប្រើកម្មវិធីជំនួយ %2 ។ កម្មវិធីជំនួយបានត្រឡប់កំហុសដូចខាងក្រោម៖ %3

source: Importing error
km: កំហុសក្នុងការនាំចូល

source: All messages have been enabled.
km: បានបើកសារទាំងអស់។

source: All messages
km: សារទាំងអស់

source: Auto saving...
km: កំពុងរក្សាទុកដោយស្វ័យប្រវត្តិ ...
