Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

# @item the number 7
source: seven
km: ប្រាំពីរ

# @item the number 8
source: eight
km: ប្រាំបី

# @item the number 9
source: nine
km: ប្រាំបួន

# @item the number 10
source: ten
km: ដប់

# @item the number 11
source: eleven
km: ដប់មួយ

# @item the number 12
source: twelve
km: ដប់ពីរ

# @item the number 13
source: thirteen
km: ដប់បី

# @item the number 14
source: fourteen
km: ដប់បួន

# @item the number 15
source: fifteen
km: ដប់ប្រាំ

# @item the number 16
source: sixteen
km: ដប់ប្រាំមួយ

# @item the number 17
source: seventeen
km: ដប់ប្រាំពីរ

# @item the number 18
source: eighteen
km: ដប់ប្រាំបី

# @item the number 19
source: nineteen
km: ដប់ប្រាំបួន

# @item the number 20
source: twenty
km: ម្ភៃ

# @item the number 30
source: thirty
km: សាមសិប

# @item the number 40
source: forty
km: សែសិប

# @item the number 50
source: fifty
km: ហាសិប

# @item the number 60
source: sixty
km: ហុកសិប

# @item the number 70
source: seventy
km: ចិតសិប

# @item the number 80
source: eighty
km: ប៉ែតសិប

# @item the number 90
source: ninety
km: កៅសិប

# @item the number 1000
source: thousand
km: ពាន់

# @item the number 1,000,000
source: million
km: លាន

# @item the number 1,000,000,000
source: billion
km: ពាន់​លាន

# @item This comes after the hundred value digit
source: hundred
km: រយ

# @item This comes after the hunder text if the tens unit is different from 0
source: and
km: និង

# @item Appears last as separator
source: and
km: និង

source: %1 and %2/%3
km: %1 និង %2 / %3

source: The check template file which defines the way the printed check will look.
km: ឯកសារគំរូមូលប្បទានប័ត្រដែលកំណត់ពីរបៀបដែលមូលប្បទានប័ត្រដែលបានបោះពុម្ពនឹងមើលទៅ។

source: A list containing the id's of already printed checks.
km: បញ្ជីមានលេខសម្គាល់នៃការត្រួតពិនិត្យដែលបានបោះពុម្ពរួចហើយ។

source: Check template file
km: ពិនិត្យឯកសារគំរូ

source: Print check
km: បោះពុម្ពមូលប្បទានប័ត្រ

source: Reconciliation report
km: របាយការណ៍ការផ្សះផ្សា

source: Summar&y
km: សង្ខេប

source: &Details
km: ព័ត៌មានលម្អិត

source: Pri&nt
km: បោះពុម្ព

source: Reconciliation report of account %1
km: របាយការណ៍ការផ្សះផ្សាគណនី %1

source: All values shown in %1
km: តម្លៃទាំងអស់ដែលបង្ហាញក្នុង %1

source: Summary
km: សង្ខេប

source: Starting balance on bank statement
km: សមតុល្យចាប់ផ្តើមលើរបាយការណ៍ធនាគារ

source: %1 cleared payment
km: %1 បានទូទាត់ការទូទាត់

source: %1 cleared charge
km: %1 ជម្រះការចោទប្រកាន់

source: %1 cleared deposit
km: %1 ជម្រះការដាក់ប្រាក់

source: Ending balance on bank statement
km: តុល្យភាពបញ្ចប់លើរបាយការណ៍ធនាគារ

source: Cleared balance
km: ជម្រះសមតុល្យ

source: %1 outstanding payment
km: ការទូទាត់ឆ្នើម %1

source: %1 outstanding charge
km: %1 គិតថ្លៃសេវាកម្ម

source: %1 outstanding deposit
km: %1 ប្រាក់បញ្ញើឆ្នើម

source: Register balance as of %1
km: ចុះឈ្មោះសមតុល្យគិតចាប់ពី %1

source: %1 payment after %2
km: ការទូទាត់ %1 បន្ទាប់ពី %2

source: %1 charge after %2
km: %1 គិតថ្លៃបន្ទាប់ពី %2

source: %1 deposit after %2
km: %1 ការដាក់ប្រាក់បន្ទាប់ពី %2

source: Register ending balance
km: ចុះឈ្មោះសមតុល្យបញ្ចប់

source: Outstanding payments
km: ការទូទាត់លេចធ្លោ

source: One outstanding payment of
km: ការទូទាត់លេចធ្លោមួយ

source: Outstanding charges
km: ការចោទប្រកាន់ដែលលេចធ្លោ

source: Outstanding deposits
km: ប្រាក់បញ្ញើឆ្នើម

source: One outstanding charge of
km: បន្ទុកលេចធ្លោមួយ

source: One outstanding deposit of
km: ប្រាក់បញ្ញើលេចធ្លោមួយ

source: Load Weboob backend...
km: ផ្ទុកកម្មវិធីខាងក្រោយរបស់ Weboob ...

source: Getting list of backends.
km: ការទទួលបានបញ្ជីឈ្មោះផ្នែកខាងក្រោយ។

source: Connecting to bank...
km: ភ្ជាប់ទៅធនាគារ ...

source: Getting list of accounts list from your bank.
km: ទទួលបានបញ្ជីគណនីពីធនាគាររបស់អ្នក។

source: Select Backend
km: ជ្រើសរើសកម្មវិធីខាងក្រោយ

source: Please select a backend from the list below...
km: សូមជ្រើសរើសផ្នែកខាងក្រោយពីបញ្ជីខាងក្រោម ...

source: Name
km: ឈ្មោះ

source: Module
km: ម៉ូឌុល

source: Select a backend
km: ជ្រើសរើសផ្នែកខាងក្រោយ

source: Select what <b>online</b> account you want to map to the <b>application</b> account...
km: ជ្រើសរើសអ្វី <b> លើបណ្តាញ </b> គណនីដែលអ្នកចង់គូសផែនទី <b> កម្មវិធី </b> គណនី ...

source: History
km: ប្រវត្តិសាស្រ្ត

source: Weboob configuration
km: ការកំណត់រចនាសម្ព័ន្ធ Weboob

source: Retrieving transactions...
km: កំពុងរកមើលប្រតិបត្តិការ ...

# Chart legend title
source: Legend
km: រឿងព្រេង

source: Time
km: ពេលវេលា

# Total balance
source: Total
km: សរុប

# Chart lines legend
source: Legend
km: រឿងព្រេង

# Report date range
source: %1 through %2
km: %1 តាមរយៈ %2

source: All currencies converted to %1
km: រូបិយប័ណ្ណទាំងអស់ត្រូវបានបម្លែងទៅជា %1

source: All currencies converted to %1
km: រូបិយប័ណ្ណទាំងអស់ត្រូវបានប្តូរទៅជា %1

source: All values shown in %1 unless otherwise noted
km: តម្លៃទាំងអស់ដែលបង្ហាញក្នុង %1 លើកលែងតែមានការកត់សម្គាល់ផ្សេង

source: All values shown in %1 unless otherwise noted
km: តម្លៃទាំងអស់ដែលបង្ហាញក្នុង %1 លើកលែងតែមានការកត់សំគាល់បើមិនដូច្នេះទេ

source: Num
km: លេខ

source: Top Category
km: ប្រភេទកំពូល

source: Category Type
km: ប្រភេទប្រភេទ

source: Net Value
km: តម្លៃសុទ្ធ

source: Buys
km: ទិញ

source: Sells
km: លក់

source: Dividends Reinvested
km: ភាគលាភដែលបានបញ្ចូលឡើងវិញ

source: Dividends Paid Out
km: ភាគលាភបានបង់ចេញ

source: Starting Balance
km: ចាប់ផ្តើមតុល្យភាព

source: Ending Balance
km: តុល្យភាពបញ្ចប់

source: Annualized Return
km: ការវិលត្រឡប់ប្រចាំឆ្នាំ

source: Return On Investment
km: ការវិនិយោគត្រឡប់មកវិញ

# Account name
source: Name
km: ឈ្មោះ

source: Next Due Date
km: កាលបរិច្ឆេទកំណត់បន្ទាប់

source: Occurrence
km: ការកើតឡើង

source: Payment Method
km: វិធី​សា​ស្រ្ត​ទូទាត់

source: Opening Date
km: កាលបរិច្ឆេទបើក

source: Balance Early Warning
km: ការព្រមានមុនពេលមានតុល្យភាព

source: Balance Max Limit
km: កំរិតអតិបរិមា

source: Credit Early Warning
km: ការព្រមានមុនឥណទាន

source: Credit Max Limit
km: ដែនកំណត់ឥណទានអតិបរមា

source: Preferred
km: ចំណូលចិត្ត

source: Loan Amount
km: ចំនួនប្រាក់កម្ចី

source: Interest Rate
km: អត្រា​ការ​ប្រាក់

source: Next Interest Change
km: ការផ្លាស់ប្តូរការប្រាក់បន្ទាប់

source: Periodic Payment
km: ការទូទាត់តាមកាលកំណត់

source: Final Payment
km: ការទូទាត់ចុងក្រោយ

source: Current Balance
km: តុល្យភាព​បច្ចុប្បន្ន

source: Initial Market Value
km: តម្លៃទីផ្សារដំបូង

source: Ending Market Value
km: បញ្ចប់តម្លៃទីផ្សារ

source: Opening Balance
km: សមតុល្យបើក

source: Closing Balance
km: ការបិទតុល្យភាព

source: Calculated
km: បានគណនា

source: Grand Total
km: តំលៃ​បូក​សរុប

source: Transfer from %1
km: ផ្ទេរពី %1

source: Transfer to %1
km: ផ្ទេរទៅ %1

# Is this a tax account?
source: Yes
km: បាទ / ចាស

# Is this an opening balance account?
source: Yes
km: បាទ / ចាស

# Is this a favorite account?
source: Yes
km: បាទ / ចាស

# Report date range
source: %1 through %2
km: %1 តាមរយៈ %2

source: Actual
km: ជាក់ស្តែង

source: Difference
km: ភាពខុសគ្នា

source: Forecast
km: ការព្យាករណ៍

source: Moving Average
km: ការផ្លាស់ប្តូរមធ្យម

source: Moving Average Price
km: ការផ្លាស់ប្តូរតម្លៃមធ្យម

source: Month of %1
km: ខែនៃ %1

source: Week of %1
km: សប្តាហ៍នៃ %1

source: [No Tag]
km: [គ្មានស្លាក]

source: No Institution
km: គ្មានស្ថាប័ន

source: [Empty Payee]
km: [អ្នកទទួលប្រាក់ទទេ]

source: [Split Transaction]
km: [ការបែងចែកប្រតិបត្តិការ]

# Split transaction
source: Split
km: ពុះ

# No institution
source: None
km: គ្មាន

# Grand total balance
source: Grand Total
km: តំលៃ​បូក​សរុប

# Total balance for checking account
source: Total
km: សរុប

# Total balance for credit card
source: Total
km: សរុប

source: Investment Transactions
km: ប្រតិបត្តិការវិនិយោគ

source: Test Report
km: របាយការណ៍តេស្ត

source: Total Stock 1
km: ស្តុកសរុប ១

source: Investment Performance by Account
km: លទ្ធផលវិនិយោគដោយគណនេយ្យ

source: There was an error creating your report: "%1". Please report this error to the developer's list: kmymoney-devel@kde.org
km: មានកំហុសក្នុងការបង្កើតរបាយការណ៍របស់អ្នក៖ " %1 " ។ សូមរាយការណ៍កំហុសនេះទៅក្នុងបញ្ជីអ្នកអភិវឌ្ឍន៍៖ kmymoney-devel@kde.org

source: Unable to generate report
km: មិនអាចបង្កើតរបាយការណ៍បានទេ

source: Always show a No. field in transaction form
km: បង្ហាញផ្នែកលេខជានិច្ចក្នុងទម្រង់ប្រតិបត្តិការ

source: Auto fill with previous transaction data
km: បំពេញដោយស្វ័យប្រវត្តិជាមួយទិន្នន័យប្រតិបត្តិការមុន

source: Treat two transactions as identical, if amount differs by less than
km: ចាត់ទុកប្រតិបត្តិការពីរដូចគ្នានឹងករណីបើចំនួនខុសគ្នាតិចជាង

source: When auto fill with previous transaction data use the memos
km: នៅពេលបំពេញដោយស្វ័យប្រវត្តិជាមួយទិន្នន័យប្រតិបត្តិការមុនប្រើអនុសរណៈ

source: Autosave file periodically
km: រក្សាទុកឯកសារជាទៀងទាត់

source: Automatically find which transactions match the given reconciliation data
km: រកឃើញប្រតិបត្តិការណាមួយដែលត្រូវនឹងទិន្នន័យផ្សះផ្សាដែលបានផ្តល់ឱ្យដោយស្វ័យប្រវត្តិ

source: Number of backup files to keep
km: ចំនួនឯកសារបម្រុងទុកដែលត្រូវរក្សាទុក

source: Autosave interval in minutes
km: ចន្លោះពេលរក្សាទុកដោយស្វ័យប្រវត្តិក្នុងរយៈពេលប៉ុន្មាននាទី

source: Autosave file upon close
km: រក្សាទុកឯកសារដោយស្វ័យប្រវត្តិនៅពេលបិទ

source: Check schedules upon startup
km: ពិនិត្យកាលវិភាគនៅពេលចាប់ផ្តើម

source: Name of external calculator program
km: ឈ្មោះកម្មវិធីគណនាខាងក្រៅ

source: Name of region used for non-processing days
km: ឈ្មោះតំបន់ត្រូវបានប្រើសម្រាប់ថ្ងៃមិនដំណើរការ

source: Using the Enter key moves between the fields
km: ការប្រើគ្រាប់ចុចបញ្ចូល (Enter) ផ្លាស់ទីរវាងវាល

source: Price Precision
km: តម្លៃជាក់លាក់

source: Start with last selected view or homepage
km: ចាប់ផ្តើមជាមួយនឹងទិដ្ឋភាពដែលបានជ្រើសចុងក្រោយឬគេហទំព័រ

source: The last selected view
km: ទិដ្ឋភាពដែលបានជ្រើសរើសចុងក្រោយ

source: Use GPG to encrypt data file
km: ប្រើ GPG ដើម្បីអ៊ិនគ្រីបឯកសារទិន្នន័យ

source: Also encrypt against recover key
km: អ៊ិនគ្រីបផងដែរប្រឆាំងនឹងកូនសោសង្គ្រោះ

source: GPG User ID (deprecated)
km: លេខសម្គាល់អ្នកប្រើ GPG (បានបដិសេធ)

source: GPG User ID
km: លេខសម្គាល់អ្នកប្រើ GPG

source: Run in expert (accountant) mode
km: ដំណើរការនៅក្នុងរបៀបជំនាញ (គណនេយ្យករ)

source: Show splash screen during startup
km: បង្ហាញអេក្រង់ស្វាគមន៍កំឡុងពេលចាប់ផ្តើម

source: Synchronize account in ledger and investment view
km: ធ្វើសមកាលកម្មគណនីតាមសៀវភៅដឹកនាំនិងទិដ្ឋភាពវិនិយោគ

source: The type of the KMyMoney view
km: ប្រភេទនៃទិដ្ឋភាព KMyMoney

source: First time switch to start new user wizard
km: ប្តូរលើកដំបូងដើម្បីចាប់ផ្តើមអ្នកជំនួយការអ្នកប្រើថ្មី

source: Show title bar on each view
km: បង្ហាញរបារចំណងជើងនៅលើទិដ្ឋភាពនីមួយៗ

source: Match strings in auto-completion only from the first letter on. A substring behind the first letter is not found.
km: ផ្គូផ្គងខ្សែនៅក្នុងការបញ្ចប់ដោយស្វ័យប្រវត្តិតែពីអក្សរទីមួយប៉ុណ្ណោះ។ រកមិនឃើញនៅខាងក្រោយអក្សរទីមួយទេ។

source: Tab order of edit widgets in transaction form
km: លំដាប់ផ្ទាំងនៃធាតុក្រាហ្វិកកែសម្រួលក្នុងទំរង់ប្រតិបត្តិការ

source: Tab order of edit widgets in register
km: លំដាប់ផ្ទាំងនៃធាតុក្រាហ្វិកកែសម្រួលក្នុងការចុះឈ្មោះ

source: Order of items on homepage
km: លំដាប់នៃធាតុនៅលើគេហទំព័រ

source: Percentage of default font size used for home view HTML page
km: ភាគរយនៃទំហំពុម្ពអក្សរលំនាំដើមដែលត្រូវបានប្រើសម្រាប់ទំព័រ HTML សម្រាប់មើលនៅផ្ទះ

source: Remember (manually adjusted) font size in home view on program end.
km: ចងចាំទំហំពុម្ពអក្សរ (កែសំរួលដោយដៃ) ក្នុងទិដ្ឋភាពផ្ទះនៅចុងកម្មវិធី។

source: Show account limit information on the Homepage
km: បង្ហាញព័ត៌មានកំណត់គណនីនៅលើគេហទំព័រ

source: Show balance-status of mapped online accounts on the Homepage
km: បង្ហាញស្ថានភាពដែលមានតុល្យភាពនៃគណនីតាមអ៊ីនធឺណិតនៅលើគេហទំព័រ

source: Show number of not marked transactions per account on the Homepage [!M]
km: បង្ហាញចំនួនប្រតិបត្តិការដែលមិនបានសម្គាល់ក្នុងគណនីមួយនៅលើគេហទំព័រ [! M]

source: Show number of cleared transactions per account on the Homepage [C]
km: បង្ហាញចំនួនប្រតិបត្តិការបានទូទាត់ក្នុងមួយគណនីនៅលើគេហទំព័រ [C]

source: Show number of not reconciled (not marked + cleared) transactions per account on the Homepage [!R]
km: បង្ហាញចំនួនប្រតិបត្តិការដែលមិនបានផ្សះផ្សា (មិនបានគូសបញ្ជាក់ + លុបចោល) ក្នុងគណនីមួយនៅលើគេហទំព័រ [! R]

source: Hide closed accounts
km: លាក់គណនីបិទ

source: Show categories in the accounts view
km: បង្ហាញប្រភេទក្នុងទិដ្ឋភាពគណនី

source: Hide finished schedules
km: លាក់កាលវិភាគដែលបានបញ្ចប់

source: Show schedules with planned date
km: បង្ហាញកាលវិភាគជាមួយកាលបរិច្ឆេទដែលបានគ្រោងទុក

source: Show fancy group markers
km: បង្ហាញសញ្ញាសម្គាល់ក្រុមដែលគួរឱ្យស្រឡាញ់

source: Show fancy markers for previous and current fiscal year
km: បង្ហាញសញ្ញាសម្គាល់ល្អ ៗ សម្រាប់ឆ្នាំសារពើពន្ធមុននិងបច្ចុប្បន្ន

source: Starting month of the fiscal year
km: ខែចាប់ផ្តើមនៃឆ្នាំសារពើពន្ធ

source: Starting day of the fiscal year
km: ថ្ងៃចាប់ផ្តើមនៃឆ្នាំសារពើពន្ធ

source: Start date
km: ថ្ងៃ​ចាប់ផ្តើម

source: Log file path
km: ផ្លូវឯកសារកំណត់ហេតុ

source: List color
km: ពណ៌បញ្ជី

source: List background color
km: រាយពណ៌ផ្ទៃខាងក្រោយ

source: List grid color
km: បញ្ជីពណ៌ក្រឡាចត្រង្គ

source: Background color for imported transactions
km: ពណ៌ផ្ទៃខាងក្រោយសម្រាប់ប្រតិបត្តិការដែលបាននាំចូល

source: Background color for matched transactions
km: ពណ៌ផ្ទៃខាងក្រោយសម្រាប់ប្រតិបត្តិការដែលត្រូវគ្នា

source: List color for erroneous transactions
km: ពណ៌បញ្ជីសម្រាប់ប្រតិបត្តិការដែលមានការភាន់ច្រលំ

source: List color for missing conversion rate
km: បញ្ជីពណ៌សម្រាប់អត្រាបម្លែងដែលបាត់

source: List color for negative values
km: បញ្ជីពណ៌សម្រាប់តម្លៃអវិជ្ជមាន

source: Background color for group marker
km: ពណ៌ផ្ទៃខាងក្រោយសម្រាប់សញ្ញាសម្គាល់ក្រុម

source: Background color for required fields
km: ពណ៌ផ្ទៃខាងក្រោយសម្រាប់វាលដែលត្រូវការ

source: Use system font
km: ប្រើពុម្ពអក្សរប្រព័ន្ធ

source: Sort order of register in normal view
km: តម្រៀបលំដាប់នៃការចុះឈ្មោះក្នុងទិដ្ឋភាពធម្មតា

source: Sort order of register in search dialog
km: តម្រៀបលំដាប់នៃការចុះឈ្មោះនៅក្នុងប្រអប់ស្វែងរក

source: Default reconciliation state for transactions entered during reconciliation
km: ស្ថានភាពការផ្សះផ្សាតាមលំនាំដើមសម្រាប់ប្រតិបត្តិការដែលបានបញ្ចូលក្នុងអំឡុងពេលការផ្សះផ្សា

source: Number of days (plus/minus) to search for matching transactions
km: ចំនួនថ្ងៃ (បូក / ដក) ដើម្បីស្វែងរកប្រតិបត្តិការដែលត្រូវគ្នា

source: During import, ask for a new payee's default category
km: ក្នុងអំឡុងពេលនាំចូលសូមស្នើសុំប្រភេទលំនាំដើមរបស់អ្នកបង់ប្រាក់ថ្មី

source: Method to calculate forecast
km: វិធីសាស្រ្តក្នុងការគណនាការព្យាករណ៍

source: Days to forecast
km: ថ្ងៃដែលត្រូវព្យាករណ៍

source: Days of normal account cycle
km: ថ្ងៃនៃវដ្តគណនីធម្មតា

source: Number of historic cycles to use in forecast
km: ចំនួនវដ្តប្រវត្តិសាស្ត្រដែលត្រូវប្រើក្នុងការព្យាករណ៍

source: Day of month to start forecast
km: ថ្ងៃនៃខែដើម្បីចាប់ផ្តើមព្យាករណ៍

source: Method to calculate history-based forecast
km: វិធីសាស្រ្តក្នុងការគណនាការព្យាករណ៍ផ្អែកលើប្រវត្តិ

source: Skip opening date when fetching transactions
km: រំលងកាលបរិច្ឆេទបើកនៅពេលប្រមូលយកប្រតិបត្តិការ

source: Include future transaction when using Schedule Forecast
km: រួមបញ្ចូលប្រតិបត្តិការនាពេលអនាគតនៅពេលប្រើតារាងព្យាករណ៍

source: Include scheduled transactions when using Schedule Forecast
km: រួមបញ្ចូលប្រតិបត្តិការដែលបានគ្រោងទុកនៅពេលប្រើតារាងព្យាករណ៍

source: additional names for cash account
km: ឈ្មោះបន្ថែមសម្រាប់គណនីសាច់ប្រាក់

source: additional names for checking account
km: ឈ្មោះបន្ថែមសម្រាប់ត្រួតពិនិត្យគណនី

source: additional names for credit card account
km: ឈ្មោះបន្ថែមសម្រាប់គណនីកាតឥណទាន

source: additional names for asset account
km: ឈ្មោះបន្ថែមសម្រាប់គណនីទ្រព្យសកម្ម

source: additional names for opening balance payee
km: ឈ្មោះបន្ថែមសម្រាប់បើកអ្នកទទួលសមតុល្យ

source: additional names for invoice accounts
km: ឈ្មោះបន្ថែមសម្រាប់គណនីវិក័យប័ត្រ

source: Show accounts view expanded when loaded
km: បង្ហាញទិដ្ឋភាពគណនីបានពង្រីកនៅពេលផ្ទុក

source: Maximum quantity of legend items to display on charts
km: បរិមាណអតិបរមានៃធាតុតាងដើម្បីបង្ហាញនៅលើគំនូសតាង

source: The palette used to render charts
km: ក្ដារលាយត្រូវបានប្រើដើម្បីបង្ហាញគំនូសតាង

source: Name of default CSS file
km: ឈ្មោះឯកសារ CSS លំនាំដើម

source: Show reports view expanded when loaded
km: បង្ហាញទិដ្ឋភាពរបាយការណ៍បានពង្រីកនៅពេលផ្ទុក

source: Net Worth:
km: តម្លៃសុទ្ធ៖

source: Collapse all accounts in the list
km: បង្រួមគណនីទាំងអស់នៅក្នុងបញ្ជី

source: Expand all accounts in the list
km: ពង្រីកគណនីទាំងអស់នៅក្នុងបញ្ជី

source: Icons
km: រូបតំណាង

source: Assets
km: ទ្រព្យសម្បត្តិ

source: Liabilities
km: បំណុល

source: Equities
km: សមធម៌

source: Note: Unused categories are not shown as selected by settings.
km: សម្គាល់ៈប្រភេទដែលមិនបានប្រើមិនត្រូវបានបង្ហាញដូចដែលបានជ្រើសរើសដោយការកំណត់ទេ។

source: Total Profits:
km: ផលចំណេញសរុប៖

source: Creates a new budget
km: បង្កើតថវិកាថ្មី

source: Use this to create a new empty budget.
km: ប្រើវាដើម្បីបង្កើតថវិកាទទេថ្មី។

source: Rename the current selected budget
km: ប្តូរឈ្មោះថវិកាដែលបានជ្រើសរើសបច្ចុប្បន្ន

source: Use this to start renaming the selected budget.
km: ប្រើវាដើម្បីចាប់ផ្តើមប្តូរឈ្មោះថវិកាដែលបានជ្រើសរើស។

source: Delete the current selected budget
km: លុបថវិកាដែលបានជ្រើសរើសបច្ចុប្បន្ន

source: Use this to delete the selected budget.
km: ប្រើវាដើម្បីលុបថវិកាដែលបានជ្រើសរើស។

source: Accepts the entered values and stores the budget
km: ទទួលយកតម្លៃដែលបានបញ្ចូលហើយរក្សាទុកថវិកា

source: Use this to store the modified data.
km: ប្រើវាដើម្បីរក្សាទុកទិន្នន័យដែលបានកែប្រែ។

source: Revert budget to last saved state
km: ត្រឡប់ថវិកាទៅរដ្ឋដែលបានរក្សាទុកចុងក្រោយ

source: Use this to discard the modified data.
km: ប្រើវាដើម្បីបោះបង់ទិន្នន័យដែលបានកែប្រែ។

source: Do you want to save the changes for <b>%1</b>?
km: តើអ្នកចង់រក្សាទុកការផ្លាស់ប្តូរទេ <b> %1 </b>

source: Save changes
km: រក្សាទុកការផ្លាស់ប្តូរ

source: A budget with the name '%1' already exists. It is not advisable to have multiple budgets with the same identification name. Are you sure you would like to rename the budget?
km: ថវិកាមានឈ្មោះ '%1' មានរួចហើយ។ វាមិនត្រូវបានគេណែនាំឱ្យមានថវិកាច្រើនដែលមានឈ្មោះដូចគ្នាទេ។ តើអ្នកពិតជាចង់ប្តូរឈ្មោះថវិកាមែនទេ?

source: Unable to modify budget
km: មិនអាចកែប្រែថវិកាបានទេ

source: Unable to reset budget
km: មិនអាចកំណត់ថវិកាឡើងវិញទេ

# The balance of the selected budget
source: Balance:
km: សមតុល្យ៖

source: Your budgets
km: ថវិការបស់អ្នក

# New budget
source: New
km: ថ្មី

source: Ren
km: រេន

source: Del
km: ដេល

# @title header of the budget name column
source: Name
km: ឈ្មោះ

source: Upd
km: បច្ចុប្បន្នភាព

source: Hide unused budget categories
km: លាក់ប្រភេទថវិកាដែលមិនបានប្រើ

source: Assignments
km: កិច្ចការ

# Budget total
source: Total
km: សរុប

source: Include subaccounts
km: រួមបញ្ចូលគណនីរង

source: Profit:
km: ប្រាក់ចំណេញ៖

source: Loss:
km: ការបាត់បង់៖

# History-based method
source: History
km: ប្រវត្តិសាស្រ្ត

# Today's forecast
source: Current
km: នា​ពេល​បច្ចុប្បន្ន

source: Total variation
km: បំរែបំរួលសរុប

source: 1 day
km: ១ ថ្ងៃ

source: The balance of %1 is below the minimum balance %2 today.
km: សមតុល្យរបស់ %1 គឺទាបជាងសមតុល្យអប្បបរមា %2 ថ្ងៃនេះ។

source: The balance of %2 will drop below the minimum balance %3 in %1 day.
km: សមតុល្យរបស់ %2 នឹងធ្លាក់ចុះក្រោមសមតុល្យអប្បបរមា %3 ក្នុងរយៈពេល %1 ។

source: The balance of %1 is below %2 today.
km: សមតុល្យរបស់ %1 នៅខាងក្រោម %2 ថ្ងៃនេះ។

source: The balance of %1 is above %2 today.
km: តុល្យភាពរបស់ %1 គឺនៅខាងលើ %2 សព្វថ្ងៃនេះ។

source: The balance of %2 will drop below %3 in %1 day.
km: តុល្យភាពរបស់ %2 នឹងធ្លាក់ចុះក្រោម %3 ក្នុងរយៈពេល %1 ថ្ងៃ។

source: The balance of %2 will raise above %3 in %1 day.
km: តុល្យភាពរបស់ %2 នឹងឡើងខ្ពស់ជាង %3 ក្នុងរយៈពេល %1 ថ្ងៃ។

source: The account %1 is decreasing %2 per cycle.
km: គណនី %1 កំពុងថយចុះ %2 ក្នុងមួយវដ្ត។

source: Min Bal %1
km: មីនប៊ុល %1

source: Min Date %1
km: កាលបរិច្ឆេទអប្បបរមា %1

source: Max Bal %1
km: ប៊ុល %1

source: Max Date %1
km: កាលបរិច្ឆេទអតិបរមា %1

source: Net Worth Forecast
km: ការព្យាករណ៍សុទ្ធសុទ្ធ

source: Days to Forecast:
km: ថ្ងៃដែលត្រូវព្យាករណ៍៖

source: Days of Accounts Cycle:
km: ថ្ងៃនៃគណនីវដ្តៈ

source: Historic Cycles:
km: វដ្តប្រវត្តិសាស្ត្រ៖

source: Chart Detail:
km: ព័ត៌មានលំអិតតារាង៖

source: <p>Choose what level of detail to show on the chart.</p>
km: <p> ជ្រើសរើសកម្រិតលម្អិតអ្វីដើម្បីបង្ហាញនៅលើតារាង។ </p>

# Show all details
source: All
km: ទាំងអស់

source: Current Forecast Method:
km: វិធីសាស្ត្រព្យាករណ៍បច្ចុប្បន្ន៖

source: method
km: វិធីសាស្រ្ត

# Advanced forecast view
source: Advanced
km: កម្រិតខ្ពស់

source: Budget Forecast
km: ការព្យាករណ៍ថវិកា

source: Ledgers
km: អ្នកដឹក

source: Statement Details
km: សេចក្តីថ្លែងការណ៍លម្អិត

source: Statement Deposit Details
km: សេចក្តីលម្អិតអំពីការដាក់ប្រាក់របាយការណ៍

source: Statement Payment Details
km: សេចក្តីលម្អិតអំពីការទូទាត់សេចក្តីថ្លែងការណ៍

source: %1 deposit (%2)
km: ការដាក់ប្រាក់ %1 (%2)

source: %1 charge (%2)
km: %1 គិតថ្លៃ (%2)

source: %1 payment (%2)
km: ការទូទាត់ %1 (%2)

source: Statement: %1
km: សេចក្តីថ្លែងការណ៍: %1

# Cleared balance
source: Cleared: %1
km: បានសម្អាត៖ %1

source: Last reconciled: %1
km: ផ្សះផ្សាចុងក្រោយ: %1

source: Never reconciled
km: កុំផ្សះផ្សាគ្នា

source: Difference: %1
km: ភាពខុសគ្នា: %1

source: Balance: %1
km: តុល្យភាព: %1

source: Investment value: %1%2
km: តម្លៃវិនិយោគ៖ %1 %2

source: At least one split of the selected transactions has been reconciled. Do you wish to continue to edit the transactions anyway?
km: យ៉ាងហោចណាស់ការបែងចែកប្រតិបត្តិការដែលបានជ្រើសរើសត្រូវបានផ្សះផ្សា។ តើអ្នកចង់បន្តកែសម្រួលប្រតិបត្តិការទេ?

source: At least one split of the selected transactions has been frozen. Editing the transactions is therefore prohibited.
km: យ៉ាងហោចណាស់ការបែងចែកប្រតិបត្តិការដែលបានជ្រើសរើសត្រូវបានកក។ ដូច្នេះការកែសម្រួលប្រតិបត្តិការត្រូវហាមឃាត់។

source: Transaction already frozen
km: ប្រតិបត្តិការបានកករួចហើយ

source: At least one split of the selected transaction references an account that has been closed. Editing the transactions is therefore prohibited.
km: យ៉ាងហោចណាស់មានការបំបែកមួយនៃឯកសារយោងប្រតិបត្តិការដែលបានជ្រើសរើសគណនីដែលត្រូវបានបិទ។ ដូច្នេះការកែសម្រួលប្រតិបត្តិការត្រូវហាមឃាត់។

source: Account closed
km: គណនីត្រូវបានបិទ

source: Cannot create transactions when no account is selected.
km: មិនអាចបង្កើតប្រតិបត្តិការបានទេនៅពេលគ្មានគណនីត្រូវបានជ្រើសរើស។

source: Cannot create transactions in the context of a category.
km: មិនអាចបង្កើតប្រតិបត្តិការនៅក្នុងបរិបទនៃប្រភេទ។

source: Cannot create transactions in a closed account.
km: មិនអាចបង្កើតប្រតិបត្តិការនៅក្នុងគណនីបិទ។

source: Cannot process transactions in account %1, which is closed.
km: មិនអាចដំណើរការប្រតិបត្តិការនៅក្នុងគណនី %1 ដែលត្រូវបានបិទ។

source: Cannot process transaction with focus if it is not selected.
km: មិនអាចដំណើរការប្រតិបត្តិការដោយផ្តោតអារម្មណ៍បានទេប្រសិនបើវាមិនត្រូវបានជ្រើសរើស។

source: Cannot edit transactions with frozen splits.
km: មិនអាចកែប្រែប្រតិបត្តិការជាមួយការបំបែកជាកកបានទេ។

source: Cannot edit transactions in the context of a category.
km: មិនអាចកែសម្រួលប្រតិបត្តិការក្នុងបរិបទនៃប្រភេទ។

source: Cannot create or edit any transactions in Account %1 as it is closed
km: មិនអាចបង្កើតឬកែប្រែប្រតិបត្តិការណាមួយនៅក្នុងគណនី %1 នៅពេលវាត្រូវបានបិទ

source: Cannot edit mixed investment action/type transactions together.
km: មិនអាចកែសម្រួលសកម្មភាពវិនិយោគ / ប្រភេទប្រតិបត្តិការចម្រុះជាមួយគ្នាទេ។

source: Cannot edit investment transactions and non-investment transactions together.
km: មិនអាចកែប្រែប្រតិបត្តិការវិនិយោគនិងប្រតិបត្តិការមិនវិនិយោគជាមួយគ្នាបានទេ។

source: Cannot edit multiple split transactions at once.
km: មិនអាចកែសម្រួលប្រតិបត្តិការបំបែកជាច្រើនក្នុងពេលតែមួយបានទេ។

source: Cannot edit investment transactions in the context of this account.
km: មិនអាចកែប្រែប្រតិបត្តិការវិនិយោគក្នុងបរិបទគណនីនេះទេ។

source: Your Financial Summary
km: របាយការណ៍ហិរញ្ញវត្ថុរបស់អ្នក

source: Preferred Accounts
km: គណនីចំណូលចិត្ត

source: Payment Accounts
km: គណនីទូទាត់

source: Show KMyMoney welcome page
km: បង្ហាញទំព័រស្វាគមន៍ KMyMoney

source: Overdue payments
km: ការបង់ប្រាក់ហួសកំណត់

source: Schedule
km: កាលវិភាគ

source: Balance after
km: ធ្វើឱ្យមានតុល្យភាពបន្ទាប់ពី

source: Today's due payments
km: ការទូទាត់តាមថ្ងៃនេះ

source: Future payments
km: ការទូទាត់នាពេលអនាគត

# Less...
source: Show fewer schedules on the list
km: បង្ហាញកាលវិភាគតិចតួចនៅលើបញ្ជី
