Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: Last reconciliation
km: ការផ្សះផ្សាចុងក្រោយ

source: Online Statement Balance: %1
km: សមតុល្យសេចក្តីថ្លែងការណ៍តាមអ៊ិនធឺរណែតៈ %1

source: This year
km: ឆ្នាំ​នេះ

source: This month
km: ខែ​នេះ

source: Last week
km: សប្ដាហ៍​មុន

source: This week
km: ស​ប្តា​ហ៍​នេះ

source: Yesterday
km: ម្សិលមិញ

source: Future transactions
km: ប្រតិបត្តិការអនាគត

source: Next week
km: ស​ប្តា​ហ៍​ក្រោយ

source: Previous fiscal year
km: ឆ្នាំសារពើពន្ធមុន

source: Next fiscal year
km: ឆ្នាំសារពើពន្ធបន្ទាប់

# Unknown payee
source: Unknown
km: មិនស្គាល់

# Unknown category
source: Unknown
km: មិនស្គាល់

# Unknown security
source: Unknown
km: មិនស្គាល់

# label for status combo
source: Stat&us
km: ស្ថានភាព

source: Any status
km: ស្ថានភាពណាមួយ

source: Imported
km: បាននាំចូល

source: Matched
km: ត្រូវគ្នា

source: Erroneous
km: ខុស

source: Scheduled
km: បានកំណត់ពេល

source: Not marked
km: មិនបានសម្គាល់ទេ

source: KMyMoney has matched the two selected transactions (result above)
km: KMyMoney បានផ្គូរផ្គងប្រតិបត្តិការដែលបានជ្រើសរើសពីរ (លទ្ធផលខាងលើ)

source: Bank entry:
km: ការចូលធនាគារ៖

source: Your entry:
km: ការចូលរបស់អ្នក:

source: Transaction is missing a category assignment.
km: ប្រតិបត្តិការបានបាត់កិច្ចការប្រភេទ។

source: The transaction has a missing assignment of <b>%1</b>.
km: ប្រតិបត្តិការមានកិច្ចការដែលបានបាត់បង់ <b> %1 </b>

source: Sell
km: លក់

source: Buy
km: ទិញ

source: Investment transaction
km: ប្រតិបត្តិការវិនិយោគ

source: *** UNASSIGNED ***
km: *** បានតែងតាំង ***

source: Reinvest Dividend
km: ភាគលាភ Reinvest

# Unknown investment activity
source: Unknown
km: មិនស្គាល់

source: Ratio
km: សមាមាត្រ

source: &Deposit
km: ការដាក់ប្រាក់

source: &Transfer
km: ផ្ទេរ

source: &Withdrawal
km: ដកប្រាក់

source: &Payment
km: ការទូទាត់

source: &Charge
km: សាក

source: &Decrease
km: ថយចុះ

source: &Increase
km: កើនឡើង

source: Sort order
km: តម្រៀបតាមលំដាប់លំដោយ

source: Reconciling your account ensures your records match those of your institution, and that there are no mistakes on either side. You should reconcile your account whenever you receive a statement from your institution. All relevant information necessary for this process is usually printed on your statement. On the next page you will verify that the ending balance matches that on your statement. If not, please modify it. The starting balance is the sum of your cleared and reconciled transactions.
km: ការបង្រួបបង្រួមគណនីរបស់អ្នកធានាថាកំណត់ត្រារបស់អ្នកត្រូវគ្នានឹងស្ថាប័នរបស់អ្នកហើយមិនមានកំហុសណាមួយនៅផ្នែកណាមួយឡើយ។ អ្នកគួរតែផ្សះផ្សាគណនីរបស់អ្នកនៅពេលណាដែលអ្នកទទួលបានសេចក្តីថ្លែងការណ៍ពីស្ថាប័នរបស់អ្នក។ រាល់ព័ត៌មានដែលចាំបាច់សម្រាប់ដំណើរការនេះជាធម្មតាត្រូវបានបោះពុម្ពលើសេចក្តីថ្លែងការណ៍របស់អ្នក។ នៅទំព័របន្ទាប់អ្នកនឹងបញ្ជាក់ថាសមតុល្យបញ្ចប់នឹងត្រូវគ្នានឹងសេចក្តីថ្លែងរបស់អ្នក។ បើមិនដូច្នោះទេសូមកែប្រែវា។ សមតុល្យចាប់ផ្តើមគឺជាផលបូកនៃប្រតិបត្តិការដែលបានជម្រះនិងផ្សះផ្សាររបស់អ្នក។

source: Statement Information
km: ព័ត៌មានសេចក្តីថ្លែងការណ៍

source: Statement date:
km: កាលបរិច្ឆេទសេចក្តីថ្លែងការណ៍៖

source: Starting balance of this statement:
km: តុល្យភាពចាប់ផ្តើមនៃសេចក្តីថ្លែងការណ៍នេះ៖

source: Ending balance of this statement:
km: តុល្យភាពបញ្ចប់នៃសេចក្តីថ្លែងការណ៍នេះ៖

source: Interest / Charges
km: ចំណាប់អារម្មណ៍ / ការគិតថ្លៃ

source: If necessary, enter information about interest or charges here. KMyMoney will create transactions and cleares them directly for you.
km: បើចាំបាច់បញ្ចូលព័ត៌មានអំពីការប្រាក់ឬការគិតថ្លៃនៅទីនេះ។ ខេអិមមីនីនឹងបង្កើតប្រតិបត្តិការនិងទូទាត់វាដោយផ្ទាល់សម្រាប់អ្នក។

source: Charges
km: ការគិតប្រាក់

source: Please enter the following fields with the information as you find them on your statement. Make sure to enter all values in <b>%1</b>.
km: សូមបញ្ចូលវាលខាងក្រោមជាមួយព័ត៌មាននៅពេលអ្នករកឃើញវានៅលើសេចក្តីថ្លែងការណ៍របស់អ្នក។ ត្រូវប្រាកដថាបញ្ចូលតម្លៃទាំងអស់ <b> %1 </b>

source: Last reconciled statement: %1
km: សេចក្តីថ្លែងការណ៍ផ្សះផ្សាចុងក្រោយ: %1

source: Oldest unmarked transaction: %1
km: ប្រតិបត្តិការដែលមិនមានស្លាកសញ្ញាចាស់ជាងគេ: %1

source: Reconciliation Wizard
km: អ្នកជំនួយការផ្សះផ្សា

source: Restarting postponed reconciliation
km: ការផ្សះផ្សាដែលបានពន្យារពេលឡើងវិញ

source: You have previously postponed the reconciliation of this account. If you have entered charges or interests the last time you started reconciling this account you can modify these in the ledger later on. It is important, that you continue with the same statement you used when you postponed the reconciliation. All information you have entered into this wizard will be shown and all transactions that you already cleared are marked with a 'C'.
km: អ្នកបានពន្យារពេលការផ្សះផ្សាគណនីនេះពីមុន។ ប្រសិនបើអ្នកបានបញ្ចូលការគិតប្រាក់ឬចំណាប់អារម្មណ៍នៅពេលចុងក្រោយដែលអ្នកចាប់ផ្តើមផ្សះផ្សាគណនីនេះអ្នកអាចកែប្រែវានៅក្នុងសៀវភៅដៃនៅពេលក្រោយ វាជាការសំខាន់ណាស់ដែលអ្នកត្រូវបន្តសេចក្តីថ្លែងដដែលដែលអ្នកបានប្រើនៅពេលអ្នកពន្យារពេលការផ្សះផ្សា។ ព័ត៌មានទាំងអស់ដែលអ្នកបានបញ្ចូលទៅក្នុងអ្នកជំនួយការនេះនឹងត្រូវបានបង្ហាញហើយរាល់ប្រតិបត្តិការដែលអ្នកបានសម្អាតរួចហើយត្រូវបានសម្គាល់ដោយអក្សរ 'C' ។

source: This page summarizes the data you have entered. Press <b>Finish</b> to create the account, schedules, etc. or use <b>Back</b> to modify your entries.
km: ទំព័រនេះសង្ខេបទិន្នន័យដែលអ្នកបានបញ្ចូល។ ចុច <b> បញ្ចប់ </b> ដើម្បីបង្កើតគណនីកាលវិភាគ។ ល។ ឬប្រើប្រាស់ <b> ថយក្រោយ </b> ដើម្បីកែប្រែធាតុរបស់អ្នក។

source: Enter the name of the account under which it is known within KMyMoney. Select the type for the new account. Use the <b>What's this?</b> feature to see more details about the various account types. Enter the date the account was opened and its currency.
km: បញ្ចូលឈ្មោះគណនីដែលវាត្រូវបានស្គាល់នៅក្នុង KMyMoney ។ ជ្រើសរើសប្រភេទសម្រាប់គណនីថ្មី។ ប្រើ <b> ស្អី​គេ​ហ្នឹង? </b> លក្ខណៈពិសេសដើម្បីមើលព័ត៌មានលម្អិតបន្ថែមអំពីប្រភេទគណនីផ្សេងៗ។ បញ្ចូលកាលបរិច្ឆេទគណនីត្រូវបានបើកនិងរូបិយប័ណ្ណរបស់វា។

source: Account name
km: ឈ្មោះ​គណនី

source: Enter a name under which this account is known within KMyMoney.
km: បញ្ចូលឈ្មោះដែលគណនីនេះត្រូវបានស្គាល់នៅក្នុង KMyMoney ។

source: Account type
km: ប្រភេទ​គណនី

source: <p><b>Checking</b> Use the checking account type to manage activities on your checking account e.g. payments, checks and cash card purchases.</p> <p><b>Savings</b> Use the savings account type to manage activities on your savings account.</p> <p><b>Credit Card</b> Use the credit card account type to manage activities on your credit card.</p> <p><b>Cash</b> Use the cash account type to manage activities in your wallet.</p> <p><b>Loan</b> Use the loan account type to manage amortization loans (e.g. mortgages, car loan, money you lend, private loans etc.).</p> <p><b>Investment</b> Use the investment account to manage your stock, mutual fund and other investments.</p> <p><b>Asset</b> Use the asset account type to manage assets (e.g. your house, car or art collection).</p> <p><b>Liability</b> Use the liability account type to manage any type of liability except amortization loans. Use it for taxes you owe or money you borrowed from friends. For amortization loans like mortgages you should create a loan account.</p>
km: <p><b> ពិនិត្យ </b> ប្រើប្រភេទគណនីមូលប្បទានប័ត្រដើម្បីគ្រប់គ្រងសកម្មភាពនានាលើគណនីមូលប្បទានប័ត្ររបស់អ្នកឧទាហរណ៍ការទូទាត់មូលប្បទានប័ត្រនិងការទិញកាតសាច់ប្រាក់។ </p> <p><b> ការសន្សំ </b> ប្រើប្រភេទគណនីសន្សំដើម្បីគ្រប់គ្រងសកម្មភាពនានានៅលើគណនីសន្សំរបស់អ្នក។ </p> <p><b> កាត​ឥណទាន </b> ប្រើប្រភេទគណនីកាតឥណទានដើម្បីគ្រប់គ្រងសកម្មភាពនៅលើកាតឥណទានរបស់អ្នក។ </p> <p><b> សាច់ប្រាក់ </b> ប្រើប្រភេទគណនីសាច់ប្រាក់ដើម្បីគ្រប់គ្រងសកម្មភាពនានានៅក្នុងកាបូបរបស់អ្នក។ </p> <p><b> ប្រាក់កម្ចី </b> ប្រើប្រភេទគណនីប្រាក់កម្ចីដើម្បីគ្រប់គ្រងប្រាក់កម្ចីរំលោះ (ឧទាហរណ៍ប្រាក់កម្ចីប្រាក់កម្ចីរថយន្តប្រាក់ដែលអ្នកខ្ចីប្រាក់កម្ចីឯកជន។ ល។ ) ។ </p> <p><b> ការវិនិយោគ </b> ប្រើគណនីវិនិយោគដើម្បីគ្រប់គ្រងភាគហ៊ុនមូលនិធិទៅវិញទៅមកនិងការវិនិយោគផ្សេងទៀត។ </p> <p><b> ទ្រព្យ </b> ប្រើប្រភេទគណនីទ្រព្យសម្បត្តិដើម្បីគ្រប់គ្រងទ្រព្យសម្បត្តិ (ឧទាហរណ៍ផ្ទះឡានឬសិល្បៈរបស់អ្នក) ។ </p> <p><b> ការទទួលខុសត្រូវ </b> ប្រើប្រភេទគណនីទទួលខុសត្រូវដើម្បីគ្រប់គ្រងប្រភេទណាមួយនៃបំណុលលើកលែងតែប្រាក់កម្ចីរំលោះ។ ប្រើវាសម្រាប់ពន្ធដែលអ្នកជំពាក់ឬលុយដែលអ្នកបានខ្ចីពីមិត្តភក្តិ។ សម្រាប់ប្រាក់កម្ចីរំលោះដូចបញ្ចាំអ្នកគួរតែបង្កើតគណនីប្រាក់កម្ចី។ </p>

source: Select the currency in which this account is denominated.
km: ជ្រើសរើសរូបិយប័ណ្ណដែលគណនីនេះត្រូវបានដាក់ឈ្មោះ។

source: Opening date
km: កាលបរិច្ឆេទបើក

source: <p>The opening date would be the date of the last statement. In case you want to keep track of transactions prior to this date, enter the ending balance and statement date of a prior statement and add all following transactions into KMyMoney. KMyMoney will not allow you to enter or modify transactions prior to this date.</p> <p><i>Note</i>: If you do not know the exact amount of the opening balance, enter an estimate. You can change this value later before you reconcile this account for the first time.</p>
km: <p> កាលបរិច្ឆេទបើកនឹងជាកាលបរិច្ឆេទនៃសេចក្តីថ្លែងការណ៍ចុងក្រោយ។ ក្នុងករណីដែលអ្នកចង់តាមដានប្រតិបត្តិការមុនកាលបរិច្ឆេទនេះសូមបញ្ចូលសមតុល្យចុងនិងកាលបរិច្ឆេទនៃសេចក្តីថ្លែងការណ៍មុនហើយបន្ថែមប្រតិបត្តិការទាំងអស់ខាងក្រោមទៅ KMyMoney ។ KMyMoney នឹងមិនអនុញ្ញាតឱ្យអ្នកបញ្ចូលឬកែប្រែប្រតិបត្តិការមុនកាលបរិច្ឆេទនេះទេ។ </p> <p><i> ចំណាំ </i> ៈប្រសិនបើអ្នកមិនដឹងចំនួនទឹកប្រាក់ពិតប្រាកដនៃសមតុល្យបើកសូមវាយតំលៃប៉ាន់ស្មាន។ អ្នកអាចផ្លាស់ប្តូរតម្លៃនេះនៅពេលក្រោយមុនពេលអ្នកផ្សះផ្សាគណនីនេះជាលើកដំបូង។ </p>

source: Opening balance
km: ការបើកតុល្យភាព

source: <p>The opening balance is the balance of the account when you start using it with KMyMoney. For new accounts this is usually 0 but for existing accounts this may well differ. Please consult the account statements to figure out this value. The opening balance is to be provided in the currency of the account as selected with the currency button.</p> <p><i>Note</i>: If you do not know the exact amount of the opening balance, enter an estimate. You can change this value later before you reconcile this account for the first time.</p>
km: <p> សមតុល្យបើកគឺជាសមតុល្យគណនីនៅពេលអ្នកចាប់ផ្តើមប្រើវាជាមួយខេអិមមីយៀន។ សម្រាប់គណនីថ្មីនេះជាធម្មតា ០ ប៉ុន្តែសម្រាប់គណនីដែលមានស្រាប់វាអាចខុសគ្នា។ សូមពិគ្រោះរបាយការណ៍គណនីដើម្បីរកតម្លៃនេះ។ សមតុល្យបើកនឹងត្រូវផ្តល់ជូនជារូបិយប័ណ្ណគណនីដូចដែលបានជ្រើសរើសដោយប្រើប៊ូតុងរូបិយប័ណ្ណ។ </p> <p><i> ចំណាំ </i> ៈប្រសិនបើអ្នកមិនដឹងចំនួនទឹកប្រាក់ពិតប្រាកដនៃសមតុល្យបើកសូមវាយតំលៃប៉ាន់ស្មាន។ អ្នកអាចផ្លាស់ប្តូរតម្លៃនេះនៅពេលក្រោយមុនពេលអ្នកផ្សះផ្សាគណនីនេះជាលើកដំបូង។ </p>

source: Conversion rate
km: អត្រាបំលែង

source: For foreign currencies an initial conversion rate needs to be provided. This should be the price of the foreign currency in the base currency on the opening date of the account.
km: សម្រាប់រូបិយប័ណ្ណបរទេសអត្រាប្តូរប្រាក់ដំបូងចាំបាច់ត្រូវផ្តល់ជូន។ នេះគួរតែជាតម្លៃរូបិយប័ណ្ណបរទេសជារូបិយប័ណ្ណគោលនៅថ្ងៃបើកគណនី។

source: Online quote
km: សម្រង់តាមអ៊ីនធឺណិត

source: Mark this checkbox if the account should be maintained as preferred account
km: សម្គាល់ប្រអប់ធីកនេះប្រសិនបើគណនីគួរតែត្រូវបានរក្សាទុកជាគណនីដែលពេញចិត្ត

source: Selecting the <b>Preferred Account</b> checkbox will allow preferred access in some dialogs and views of KMyMoney.
km: ការជ្រើសឯកសារ <b> គណនីចំណូលចិត្ត </b> ប្រអប់ធីកនឹងអនុញ្ញាតឱ្យចូលដំណើរការបានពេញចិត្តនៅក្នុងប្រអប់និងទស្សនៈរបស់ KMyMoney ។

source: Preferred account
km: គណនីដែលចូលចិត្ត

source: Does this investment account have a brokerage account?<p> <b>Check</b> the mark if this investment account has an associated account for money that is not invested.<br> <b>Uncheck</b> it if you do not use this account for active stock brokerage. You should also uncheck it if the account is not maintained by a bank or broker.
km: តើគណនីវិនិយោគនេះមានគណនីអន្តរការីដែរឬទេ? <p> <b> ពិនិត្យ </b> សញ្ញាប្រសិនបើគណនីវិនិយោគនេះមានគណនីពាក់ព័ន្ធសម្រាប់ប្រាក់ដែលមិនត្រូវបានវិនិយោគ។ <br> <b> ដោះធីក </b> ប្រសិនបើអ្នកមិនប្រើគណនីនេះសម្រាប់ឈ្មួញកណ្តាលភាគហ៊ុនសកម្ម។ អ្នកក៏គួរតែដោះធីកវាប្រសិនបើគណនីមិនត្រូវបានរក្សាទុកដោយធនាគារឬឈ្មួញកណ្តាល។

source: Create brokerage account
km: បង្កើតគណនីឈ្មួញកណ្តាល

source: Account number
km: លេខ​គណនី

source: Please select the required options. Please use the <b>What's this?</b> feature to see more information about the items.
km: សូមជ្រើសរើសជំរើសដែលត្រូវការ។ សូមប្រើឯកសារ <b> ស្អី​គេ​ហ្នឹង? </b> លក្ខណៈពិសេសដើម្បីមើលព័ត៌មានបន្ថែមអំពីធាតុ។

source: What is the type of the loan?
km: តើប្រាក់កម្ចីមានប៉ុន្មានប្រភេទ?

source: I am borrowing money
km: ខ្ញុំកំពុងខ្ចីលុយ

source: I am lending money
km: ខ្ញុំកំពុងខ្ចីប្រាក់

source: Who is the payee/payer of the loan?
km: តើនរណាជាអ្នកទូទាត់ / អ្នកសងប្រាក់កម្ចី?

source: Enter the name of the person or bank you owe money or who owes you money. If the name does not exist within KMyMoney's database, you are asked if you want to create it.
km: បញ្ចូលឈ្មោះមនុស្សឬធនាគារដែលអ្នកជំពាក់លុយឬអ្នកណាជំពាក់អ្នក។ ប្រសិនបើឈ្មោះមិនមាននៅក្នុងមូលដ្ឋានទិន្នន័យរបស់ខេអិមមីនីអ្នកត្រូវបានសួរថាតើអ្នកចង់បង្កើតវាទេ។

source: Did you make/receive any payments yet?
km: តើអ្នកបានធ្វើ / ទទួលបានការទូទាត់ណាមួយនៅឡើយទេ?

source: Were there any payments for this loan whether they are entered into KMyMoney or not? Note: Payments made to obtain the loan (e.g. Disagio) are not considered as payments in this context.
km: តើមានការបង់ប្រាក់ណាមួយសម្រាប់ប្រាក់កម្ចីនេះដែរឬទេថាតើពួកគេត្រូវបានបញ្ចូលទៅក្នុងខេអិមមីយិនរឺអត់? ចំណាំ: ការទូទាត់ដែលបានធ្វើដើម្បីទទួលបានប្រាក់កម្ចី (ឧទាហរណ៍ឌីហ្គីអូ) មិនត្រូវបានគេចាត់ទុកថាជាការទូទាត់នៅក្នុងបរិបទនេះទេ ។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។។ no no no

# @item no payments were entered for a loan
source: No
km: ទេ

# @item payments were entered for a loan
source: Yes
km: ត្រូវហើយ

source: Which payments do you want to record?
km: តើការបង់ប្រាក់ណាមួយដែលអ្នកចង់កត់ត្រា?

source: <qt>Select which transactions should be recorded. <b>All payments</b> allows you to enter all payments made for this loan. The option to <b>start from the beginning of the current year</b> is meant for loans that have already been active for a longer period of time, and for which you do not want to enter all past transactions. </qt>
km: <qt> ជ្រើសរើសប្រតិបត្តិការណាមួយដែលគួរត្រូវបានកត់ត្រា។ <b> ការទូទាត់ទាំងអស់ </b> អនុញ្ញាតឱ្យអ្នកបញ្ចូលការទូទាត់ទាំងអស់ដែលបានធ្វើសម្រាប់ប្រាក់កម្ចីនេះ។ ជម្រើសទៅ <b> ចាប់ផ្តើមពីដើមឆ្នាំបច្ចុប្បន្ន </b> មានន័យថាសម្រាប់ប្រាក់កម្ចីដែលបានដំណើរការរួចហើយក្នុងរយៈពេលយូរនិងសម្រាប់អ្វីដែលអ្នកមិនចង់បញ្ចូលប្រតិបត្តិការពីមុនទាំងអស់។ </qt>

source: All payments
km: ការទូទាត់ទាំងអស់

source: Start with this year's payments
km: ចាប់ផ្តើមជាមួយនឹងការបង់ប្រាក់នៅឆ្នាំនេះ

source: Balance before start of recording
km: មានតុល្យភាពមុនពេលចាប់ផ្តើមថត

source: Enter the ending balance found on the statement that is the last one before you want to start recording this loan in KMyMoney.
km: បញ្ចូលសមតុល្យបញ្ចប់ដែលរកឃើញនៅលើសេចក្តីថ្លែងការណ៍ដែលជាប្រាក់ចុងក្រោយមុនពេលអ្នកចង់ចាប់ផ្តើមកត់ត្រាប្រាក់កម្ចីនេះនៅក្នុងគីមីមីនី។

source: You have selected to record only payments from the beginning of this year. Since prior transactions will not be recorded, you need to supply the balance of the loan on January 1st of this year.
km: អ្នកបានជ្រើសរើសដើម្បីកត់ត្រាការទូទាត់តែពីដើមឆ្នាំនេះ។ ចាប់តាំងពីប្រតិបត្តិការមុននឹងមិនត្រូវបានកត់ត្រាអ្នកត្រូវផ្គត់ផ្គង់សមតុល្យប្រាក់កម្ចីនៅថ្ងៃទី 1 ខែមករាឆ្នាំនេះ។

source: Payment frequency
km: ភាពញឹកញាប់នៃការទូទាត់

source: Interest Compounding frequency
km: ប្រេកង់បង្រួមការប្រាក់

source: Select the frequency with which the interest is compounded. If uncertain, select the same as the payment frequency. Consult your loan contract for details.
km: ជ្រើសរើសប្រេកង់ដែលការប្រាក់ត្រូវបានផ្សំ។ ប្រសិនបើមិនច្បាស់សូមជ្រើសរើសដូចគ្នានឹងភាពញឹកញាប់នៃការទូទាត់។ សូមពិគ្រោះកិច្ចសន្យាប្រាក់កម្ចីរបស់អ្នកសម្រាប់ព័ត៌មានលម្អិត។

source: Due date of first payment to be recorded
km: កាលបរិច្ឆេទដល់ពេលបង់ប្រាក់ដំបូងត្រូវកត់ត្រា

source: Depending on the answer to <b>What do you want to record?</b> this field means the following:<p> <b>All payments</b><br> Enter the due date of the very first payment<p> <b>Start with this year's payments</b><br> Enter the due date of the first payment in the current year
km: អាស្រ័យលើចម្លើយទៅ <b> តើអ្នកចង់កត់ត្រាអ្វី? </b> វាលនេះមានន័យដូចខាងក្រោម៖ <p> <b> ការទូទាត់ទាំងអស់ </b><br> បញ្ចូលកាលបរិច្ឆេទដល់ពេលបង់ដំបូង <p> <b> ចាប់ផ្តើមជាមួយនឹងការបង់ប្រាក់នៅឆ្នាំនេះ </b><br> បញ្ចូលកាលបរិច្ឆេទដល់កំណត់នៃការទូទាត់លើកដំបូងក្នុងឆ្នាំបច្ចុប្បន្ន

source: Type of interest rate
km: ប្រភេទអត្រាការប្រាក់

# @item type of interest
source: Fixed
km: ថេរ

# @item type of interest
source: Variable
km: អថេរ

source: Time between interest changes
km: ពេលវេលារវាងការផ្លាស់ប្តូរការប្រាក់

# @item frequency of interest calculation
source: Days
km: ថ្ងៃ

# @item frequency of interest calculation
source: Weeks
km: សប្តាហ៍

# @item frequency of interest calculation
source: Months
km: ខែ

# @item frequency of interest calculation
source: Years
km: ឆ្នាំ

source: Next interest change is due
km: ការផ្លាស់ប្តូរការប្រាក់បន្ទាប់គឺដល់កំណត់

source: This page allows you to select the parent account.
km: ទំព័រនេះអនុញ្ញាតឱ្យអ្នកជ្រើសរើសគណនីមេ។

source: Subaccount of
km: ចំនួនរងនៃ

source: If this account is managed by an institution please select the institution from the list. If the institution does not exist yet, please choose the <b>New Institution</b> button to create it. Otherwise, leave this field empty. Enter the account number used by the institution to identify the account.
km: ប្រសិនបើគណនីនេះត្រូវបានគ្រប់គ្រងដោយស្ថាប័នសូមជ្រើសរើសស្ថាប័នពីបញ្ជី។ ប្រសិនបើស្ថាប័ននេះមិនទាន់មានសូមជ្រើសរើសយក <b> ស្ថាប័នថ្មី </b> ប៊ូតុងដើម្បីបង្កើតវា។ បើមិនដូច្នោះទេទុកវាលនេះឱ្យនៅទទេ។ បញ្ចូលលេខគណនីដែលប្រើដោយស្ថាប័នដើម្បីកំណត់អត្តសញ្ញាណគណនី។

source: Select the institution which manages this account or leave empty
km: ជ្រើសរើសស្ថាប័នដែលគ្រប់គ្រងគណនីនេះឬទុកឱ្យទំនេរ

source: New Institution
km: ស្ថាប័នថ្មី

source: Accounts managed by an institution are usually referenced by a unique number the so called account number. Enter that number here. KMyMoney currently uses this number only for some online banking functions.
km: គណនីគ្រប់គ្រងដោយស្ថាប័នមួយជាធម្មតាត្រូវបានយោងដោយលេខពិសេសដែលហៅថាលេខគណនី។ បញ្ចូលលេខនោះនៅទីនេះ។ KMyMoney បច្ចុប្បន្នប្រើលេខនេះសម្រាប់តែមុខងារធនាគារតាមអ៊ីនធឺណិតប៉ុណ្ណោះ។

source: Enter the International Bank Account Number into this field
km: បញ្ចូលលេខគណនីធនាគារអន្តរជាតិទៅក្នុងវាលនេះ

source: You can enter the IBAN (International Bank Account Number) into this field if you know it. Usually, people at your institution can tell you the number or it is printed on your statements. See also http://en.wikipedia.org/wiki/International_Bank_Account_Number for more information. KMyMoney keeps this field only for documentation purposes and does not use it otherwise.
km: អ្នកអាចបញ្ចូល IBAN (លេខគណនីធនាគារអន្តរជាតិ) ទៅក្នុងវាលនេះប្រសិនបើអ្នកដឹង។ ជាធម្មតាមនុស្សនៅស្ថាប័នរបស់អ្នកអាចប្រាប់អ្នកពីលេខឬវាត្រូវបានបោះពុម្ពលើរបាយការណ៍របស់អ្នក។ ព័ត៌មានបន្ថែមសូមមើល http://en.wikipedia.org/wiki/InternationalBankAccountNumber សម្រាប់ព័ត៌មានបន្ថែម។ KMyMoney រក្សាទុកវាលនេះសម្រាប់តែគោលបំណងឯកសារប៉ុណ្ណោះហើយមិនត្រូវប្រើវាឡើយ។

source: Now enter the details for your loan. You can leave one of the fields empty and KMyMoney will calculate it when you press the <b>Calculate</b> button. Before you can continue with the next page you also need to press <b>Calculate</b> so that KMyMoney can check the logical correctness of the values you have supplied.
km: ឥឡូវសូមបញ្ចូលព័ត៌មានលម្អិតសម្រាប់ប្រាក់កម្ចីរបស់អ្នក។ អ្នកអាចទុកវាលមួយក្នុងចំណោមកន្លែងទំនេរហើយ KMyMoney នឹងគណនាវានៅពេលអ្នកចុចប៊ូតុង <b> គណនា </b> ប៊ូតុង។ មុនពេលអ្នកអាចបន្តទំព័របន្ទាប់អ្នកត្រូវចុចផងដែរ <b> គណនា </b> ដូច្នេះ KMyMoney អាចពិនិត្យភាពត្រឹមត្រូវនៃតំរូវការដែលអ្នកបានផ្តល់។

source: The interest rate gets calculated
km: អត្រាការប្រាក់ត្រូវបានគណនា

source: when the payment is received
km: នៅពេលដែលការទូទាត់ត្រូវបានទទួល

source: when the payment is due
km: នៅពេលដែលការទូទាត់ត្រូវដល់កំណត់

source: Loan amount
km: ចំនួនប្រាក់កម្ចី

source: Enter the amount of the loan in this field. If you want to calculate this field out of the other parameters, please leave it empty. If the field is marked as required (colored background) you have informed KMyMoney about the fact that there were already some payments towards the loan. In this case, please enter the ending balance of your last statement.
km: បញ្ចូលចំនួនប្រាក់កម្ចីក្នុងវិស័យនេះ។ ប្រសិនបើអ្នកចង់គណនាវាលនេះចេញពីប៉ារ៉ាម៉ែត្រផ្សេងទៀតសូមទុកវាឱ្យនៅទទេ។ ប្រសិនបើវាលត្រូវបានសម្គាល់តាមតម្រូវការ (ផ្ទៃខាងក្រោយពណ៌) អ្នកបានជូនដំណឹងដល់ KMyMoney អំពីការពិតដែលថាមានការបង់ប្រាក់មួយចំនួនរួចហើយចំពោះប្រាក់កម្ចី។ ក្នុងករណីនេះសូមបញ្ចូលតុល្យភាពបញ្ចប់នៃសេចក្តីថ្លែងការណ៍ចុងក្រោយរបស់អ្នក។

source: Interest rate
km: អត្រា​ការ​ប្រាក់

source: Please enter the interest rate (as a percentage) or leave the field empty to calculate it.
km: សូមបញ្ចូលអត្រាការប្រាក់ (គិតជាភាគរយ) ឬទុកវាលទំនេរដើម្បីគណនា។

source: Term
km: រយៈពេល

source: Please enter the term of this loan or enter 0 to calculate it. The term is the time that is required to fully repay the loan. This time might be different from the time your loan contract is signed for.
km: សូមបញ្ចូលរយៈពេលនៃប្រាក់កម្ចីនេះឬបញ្ចូលលេខ ០ ដើម្បីគណនាវា។ រយៈពេលគឺជាពេលវេលាដែលត្រូវសងប្រាក់កម្ចីឱ្យបានពេញលេញ។ ពេលនេះប្រហែលជាខុសគ្នាពីពេលដែលកិច្ចសន្យាខ្ចីប្រាក់របស់អ្នកត្រូវបានចុះហត្ថលេខា។

source: Payment (principal and interest)
km: ការទូទាត់ (ប្រាក់ដើមនិងការប្រាក់)

source: Please enter the amount you pay for principal and interest or leave the field empty to calculate it.
km: សូមបញ្ចូលចំនួនទឹកប្រាក់ដែលអ្នកចំណាយសម្រាប់ប្រាក់ដើមនិងការប្រាក់ឬទុកវាលទំនេរដើម្បីគណនាវា។

source: Balloon payment
km: ការទូទាត់ប៉េងប៉ោង

source: Please enter the amount of a final amortization payment or leave the field empty to calculate it.
km: សូមបញ្ចូលចំនួនទឹកប្រាក់នៃការសងរំលោះចុងក្រោយឬទុកវាលទំនេរដើម្បីគណនាវា។

source: Calculate
km: គណនា

source: Press this button to calculate/verify your loan details.
km: ចុចប៊ូតុងនេះដើម្បីគណនា / ផ្ទៀងផ្ទាត់ព័ត៌មានលម្អិតប្រាក់កម្ចីរបស់អ្នក។

source: Pressing this button calculates a possibly missing parameter for your loan or verifies that the values entered match. If something is not correct you will receive information about it.
km: ចុចប៊ូតុងនេះគណនាប៉ារ៉ាម៉ែត្រដែលអាចបាត់សម្រាប់ប្រាក់កម្ចីរបស់អ្នកឬផ្ទៀងផ្ទាត់ថាតម្លៃដែលបានបញ្ចូលត្រូវគ្នា។ ប្រសិនបើមានអ្វីមួយមិនត្រឹមត្រូវអ្នកនឹងទទួលបានព័ត៌មានអំពីវា។

source: Now enter the information required for the periodic loan payments. If your regular payments contains any additional fees, click on the <b>Additional fees</b> button to enter them.
km: ឥឡូវបញ្ចូលព័ត៌មានដែលត្រូវការសម្រាប់ការទូទាត់ប្រាក់កម្ចីតាមកាលកំណត់។ ប្រសិនបើការទូទាត់ទៀងទាត់របស់អ្នកមានថ្លៃបន្ថែមណាមួយសូមចុចលើប៊ូតុង <b> ថ្លៃសេវាបន្ថែម </b> ប៊ូតុងដើម្បីបញ្ចូលពួកវា។

source: Principal + Interest
km: នាយកសាលា + ការប្រាក់

source: Additional Fees
km: កម្រៃបន្ថែម

source: = periodical payments
km: = ការបង់ប្រាក់តាមកាលកំណត់

source: If this loan is for an asset, such as a car or a house, you can create the asset account now. An asset account represents the total value of an asset. The money from this loan will be transferred into the asset account you create or select. If this loan is a 'consumer loan' (money to use however you want), you can use a checking account instead.
km: ប្រសិនបើប្រាក់កម្ចីនេះសម្រាប់ទ្រព្យសម្បត្តិដូចជាឡានឬផ្ទះអ្នកអាចបង្កើតគណនីទ្រព្យបានឥឡូវនេះ។ គណនីទ្រព្យតំណាងឱ្យតម្លៃសរុបនៃទ្រព្យ។ ប្រាក់ដែលបានពីប្រាក់កម្ចីនេះនឹងត្រូវផ្ទេរទៅក្នុងគណនីទ្រព្យដែលអ្នកបង្កើតឬជ្រើសរើស។ ប្រសិនបើប្រាក់កម្ចីនេះគឺជា 'ប្រាក់កម្ចីអតិថិជន' (លុយត្រូវប្រើទោះយ៉ាងណាអ្នកចង់បាន) អ្នកអាចប្រើគណនីត្រួតពិនិត្យជំនួសវិញ។

source: Do not create payout transaction
km: កុំបង្កើតប្រតិបត្តិការទូទាត់សង

source: Refinance existing loan
km: ប្រាក់កម្ចីដែលមានស្រាប់

source: Check this if you are refinancing a loan that already exists in KMyMoney
km: ពិនិត្យវាប្រសិនបើអ្នកកំពុងផ្តល់ប្រាក់កម្ចីប្រាក់កម្ចីដែលមានរួចហើយនៅក្នុង KMyMoney

source: Asset Account
km: គណនីទ្រព្យ

source: Loan account
km: គណនីប្រាក់កម្ចី

source: Date of payment
km: កាលបរិច្ឆេទនៃការទូទាត់
