Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: Choose Import Type Dialog
km: ជ្រើសរើសប្រអប់នាំចូលប្រភេទ

source: Please choose the type of export you wish to perform. A simple explanation of the export type is available at the bottom of the screen and is updated when you select an item from the choice box. Once you have chosen an export type please press the OK button.
km: សូមជ្រើសរើសប្រភេទនៃការនាំចេញដែលអ្នកចង់អនុវត្ត។ ការពន្យល់សាមញ្ញ នៃប្រភេទនាំចេញមាននៅផ្នែកខាងក្រោមនៃអេក្រង់ហើយត្រូវបានធ្វើបច្ចុប្បន្នភាពនៅពេល អ្នកជ្រើសរើសធាតុពីប្រអប់ជម្រើស។ ពេលអ្នកបានជ្រើសរើសប្រភេទនាំចេញសូមចុចប៊ូតុងយល់ព្រម។

source: Choose export type:
km: ជ្រើសរើសប្រភេទនាំចេញ៖

source: Choose Export Type Dialog
km: ជ្រើសរើសប្រអប់នាំចេញប្រភេទ

source: CSV
km: ស៊ីអេសអេស

source: QIF files are created by the popular accounting program Quicken. Another dialog will appear, if you choose this type, asking for further information relevant to the Quicken format.
km: ឯកសារ QIF ត្រូវបានបង្កើតឡើងដោយកម្មវិធីគណនេយ្យដ៏ពេញនិយម Quicken ។ ប្រអប់មួយទៀតនឹងលេចចេញមកប្រសិនបើអ្នកជ្រើសរើសប្រភេទនេះសុំព័ត៌មានបន្ថែម ទាក់ទងនឹងទ្រង់ទ្រាយឃ្វីន។

source: The CSV type uses a comma delimited text file that can be used by most popular spreadsheet programs available for Linux and other operating systems.
km: ប្រភេទស៊ីអេសអេសប្រើឯកសារអត្ថបទដែលកំណត់ដោយសញ្ញាក្បៀសដែលអាចត្រូវបានប្រើដោយកម្មវិធីសៀវភៅបញ្ជីប្រជាប្រិយបំផុត ដែលមានសម្រាប់លីនុចនិងប្រព័ន្ធ ប្រតិបត្តិការផ្សេងទៀត។

source: Please choose the type of import you wish to perform. A simple explanation of the import type is available at the bottom of the screen and is updated when you select an item from the choice box. Once you have chosen an import type please press the OK button.
km: សូមជ្រើសរើសប្រភេទការនាំចូលដែលអ្នកចង់អនុវត្ត។ ការពន្យល់ដ៏សាមញ្ញ នៃប្រភេទនាំចូលមាននៅផ្នែកខាងក្រោមនៃអេក្រង់ហើយត្រូវបានធ្វើបច្ចុប្បន្នភាពនៅពេល អ្នកជ្រើសរើសធាតុមួយពីប្រអប់ជ្រើសរើស។ ពេលអ្នកបានជ្រើសរើសប្រភេទនាំចូលសូមចុចប៊ូតុងយល់ព្រម។

source: Some description
km: ការពិពណ៌នាខ្លះ

source: Transaction %1 has no splits
km: ប្រតិបត្តិការ %1 មិនមានការបែងចែកទេ

source: <p>Payee changed.<br/>&nbsp;&nbsp;&nbsp;Old: <b>%1</b>, New: <b>%2</b></p>
km: <p> អ្នកប្តូរប្រាក់បានផ្លាស់ប្តូរ។ <br/> nbsp; nbsp; nbsp; ចាស់ៈ <b> %1 </b> , ថ្មី៖ <b> %2 </b></p>

source: <p>Account changed.<br/>&nbsp;&nbsp;&nbsp;Old: <b>%1</b>, New: <b>%2</b></p>
km: <p> បានផ្លាស់ប្ដូរគណនី។ <br/> nbsp; nbsp; nbsp; ចាស់ៈ <b> %1 </b> , ថ្មី៖ <b> %2 </b></p>

source: <p>Transfer account changed.<br/>&nbsp;&nbsp;&nbsp;Old: <b>%1</b>, New: <b>%2</b></p>
km: <p> បានផ្លាស់ប្តូរគណនីផ្ទេរ។ <br/> nbsp; nbsp; nbsp; ចាស់ៈ <b> %1 </b> , ថ្មី៖ <b> %2 </b></p>

source: <p>Category changed.<br/>&nbsp;&nbsp;&nbsp;Old: <b>%1</b>, New: <b>%2</b></p>
km: <p> បានផ្លាស់ប្តូរប្រភេទ។ <br/> nbsp; nbsp; nbsp; ចាស់ៈ <b> %1 </b> , ថ្មី៖ <b> %2 </b></p>

# Empty memo
source: empty
km: ទទេ

source: <p>Memo changed.<br/>&nbsp;&nbsp;&nbsp;Old: <b>%1</b>, New: <b>%2</b></p>
km: <p> អនុស្សរណៈបានផ្លាស់ប្តូរ។ <br/> nbsp; nbsp; nbsp; ចាស់ៈ <b> %1 </b> , ថ្មី៖ <b> %2 </b></p>

# No number
source: empty
km: ទទេ

source: <p>Number changed.<br/>&nbsp;&nbsp;&nbsp;Old: <b>%1</b>, New: <b>%2</b></p>
km: <p> លេខបានផ្លាស់ប្ដូរ។ <br/> nbsp; nbsp; nbsp; ចាស់ៈ <b> %1 </b> , ថ្មី៖ <b> %2 </b></p>

source: <p>Amount changed.<br/>&nbsp;&nbsp;&nbsp;Old: <b>%1</b>, New: <b>%2</b></p>
km: <p> ចំនួនទឹកប្រាក់បានផ្លាស់ប្តូរ។ <br/> nbsp; nbsp; nbsp; ចាស់ៈ <b> %1 </b> , ថ្មី៖ <b> %2 </b></p>

source: <p>Reconciliation flag changed.<br/>&nbsp;&nbsp;&nbsp;Old: <b>%1</b>, New: <b>%2</b></p>
km: <p> ការផ្សះផ្សាទង់ជាតិបានផ្លាស់ប្តូរ។ <br/> nbsp; nbsp; nbsp; ចាស់ៈ <b> %1 </b> , ថ្មី៖ <b> %2 </b></p>

source: Fatal error in determining data: %1
km: កំហុសធ្ងន់ធ្ងរក្នុងការកំណត់ទិន្នន័យ: %1

source: Confirm Manual Enter
km: បញ្ជាក់ការបញ្ចូលដោយដៃ

source: The following changes have been made to the transaction data:
km: ការផ្លាស់ប្តូរខាងក្រោមត្រូវបានធ្វើឡើងចំពោះទិន្នន័យប្រតិបត្តិការ៖

source: Please choose what you wish to do with the above changes
km: សូមជ្រើសរើសអ្វីដែលអ្នកចង់ធ្វើជាមួយការផ្លាស់ប្តូរខាងលើ

source: Discard the changes and enter the original transaction into the register.
km: បោះបង់ការផ្លាស់ប្តូរហើយបញ្ចូលប្រតិបត្តិការដើមទៅក្នុងបញ្ជី។

source: Enter these new values this one time, for this occurrence only.
km: បញ្ចូលតម្លៃថ្មីទាំងនេះមួយដងសម្រាប់ការកើតឡើងនេះប៉ុណ្ណោះ។

source: Set all further occurrences in this schedule to be these values.
km: កំណត់ការកើតឡើងបន្ថែមទៀតទាំងអស់នៅក្នុងកាលវិភាគនេះទៅជាតម្លៃទាំងនេះ។

source: User
km: អ្នក​ប្រើ

source: Exchange Rate/Price Editor
km: អត្រាប្តូរប្រាក់ / អ្នកកែតំលៃ

source: Amount
km: ចំនួនទឹកប្រាក់

source: Convert
km: បំលែង

# @label convert from stock to currency
source: to
km: ទៅ

source: To amount
km: ចំនួន

source: Exchange rate / Price
km: អត្រាប្តូរប្រាក់ / តំលៃ

source: Update price history
km: ធ្វើបច្ចុប្បន្នភាពប្រវត្តិតម្លៃ

source: Select as base currency
km: ជ្រើសរើសជារូបិយប័ណ្ណគោល

source: Delete currency
km: លុបរូបិយប័ណ្ណ

source: New currency
km: រូបិយប័ណ្ណថ្មី

source: Currencies
km: រូបិយប័ណ្ណ

# @title header of the currency name column
source: Name
km: ឈ្មោះ

source: ID
km: លេខសម្គាល់

source: Symbol
km: និមិត្តសញ្ញា

source: Edit Equity
km: កែសម្រួលសមធម៌

source: Stock
km: ស្តុក

source: Mutual Fund
km: មូលនិធិទៅវិញទៅមក

source: Bond
km: មូលបត្របំណុល

source: Smallest fraction:
km: ប្រភាគតូចបំផុត៖

source: Investment Type:
km: ប្រភេទវិនិយោគ៖

source: Equity Name:
km: ឈ្មោះសមធម៌៖

source: Market Symbol:
km: និមិត្តសញ្ញាទីផ្សារ៖

source: Price History
km: ប្រវត្តិតម្លៃ

source: Add
km: បន្ថែម

source: Edit
km: កែសម្រួល

source: Remove
km: លុប

source: Direct deposit
km: ការ​ដាក់​ប្រាក់​ដោយ​ផ្ទាល់

source: Manual deposit
km: ការដាក់ប្រាក់ដោយដៃ

source: Direct debit
km: ឥណពន្ធផ្ទាល់

source: Standing order
km: សណ្តាប់ធ្នាប់ឈរ

source: Bank transfer
km: ការផ្ទេរប្រាក់តាមធនាគារ

source: Write check
km: សរសេរមូលប្បទានប័ត្រ

# Other payment method
source: Other
km: ផ្សេងទៀត

source: Next due date
km: កាលបរិច្ឆេទដល់កំណត់បន្ទាប់

source: Number
km: ចំនួន

source: Edit Scheduled transaction
km: កែសម្រួលប្រតិបត្តិការតាមកាលវិភាគ

source: Schedule name:
km: ឈ្មោះតារាងពេលវេលា៖

source: Frequency:
km: ភាពញឹកញាប់៖

source: Number of selected periods between entries
km: ចំនួនរយៈពេលដែលបានជ្រើសរវាងធាតុ

source: Payment information
km: ព​ត៌​មាន​ទូទាត់ប្រាក់

source: Payment method
km: វិធី​សា​ស្រ្ត​ទូទាត់

source: Details
km: ព័ត៌មានលម្អិត

source: Payment
km: ការទូទាត់

source: Deposit
km: ការដាក់ប្រាក់

source: Quantity
km: បរិមាណ

source: Value
km: តម្លៃ

source: Balance
km: តុល្យភាព

source: Options
km: ជម្រើស

source: Do not change the date
km: កុំប្តូរកាលបរិច្ឆេទ

source: Change the date to the previous processing day
km: ផ្លាស់ប្តូរកាលបរិច្ឆេទទៅថ្ងៃកែច្នៃមុន

source: Change the date to the next processing day
km: ផ្លាស់ប្តូរកាលបរិច្ឆេទទៅថ្ងៃកែច្នៃបន្ទាប់

source: If this schedule occurs on a non-processing day:
km: ប្រសិនបើកាលវិភាគនេះកើតឡើងនៅថ្ងៃមិនដំណើរការ៖

source: The amount is an estimate because it varies for each payment
km: ចំនួនទឹកប្រាក់គឺជាការប៉ាន់ស្មានពីព្រោះវាខុសគ្នាសម្រាប់ការទូទាត់នីមួយៗ

source: Always process this schedule the last day of a month
km: ដំណើរការកាលវិភាគនេះនៅថ្ងៃចុងក្រោយនៃខែ

source: Enter this schedule into the register automatically when it is due
km: បញ្ចូលកាលវិភាគនេះទៅក្នុងការចុះឈ្មោះដោយស្វ័យប្រវត្តិនៅពេលដល់ពេលកំណត់

source: This schedule will end at some time
km: កាលវិភាគនេះនឹងបញ្ចប់នៅពេលណាមួយ

source: Number of transactions remaining:
km: ចំនួនប្រតិបត្តិការដែលនៅសល់៖

source: Date of final transaction:
km: កាលបរិច្ឆេទនៃប្រតិបត្តិការចុងក្រោយ៖

source: Help
km: ជំនួយ

source: Unable to load schedule details
km: មិនអាចផ្ទុកព័ត៌មានលម្អិតកាលវិភាគបានទេ

source: <p>Please check that all the details in the following dialog are correct and press OK.</p><p>Editable data can be changed and can either be applied to just this occurrence or for all subsequent occurrences for this schedule. (You will be asked what you intend after pressing OK in the following dialog)</p>
km: <p> សូមពិនិត្យមើលថារាល់ព័ត៌មានលម្អិតនៅក្នុងប្រអប់ខាងក្រោមត្រឹមត្រូវហើយចុចយល់ព្រម។ </p><p> ទិន្នន័យដែលអាចកែប្រែបានអាចត្រូវបានផ្លាស់ប្តូរហើយអាចត្រូវបានអនុវត្តចំពោះការកើតឡើងនេះឬសម្រាប់ការកើតឡើងជាបន្តបន្ទាប់ទាំងអស់សម្រាប់កាលវិភាគនេះ។ (អ្នកនឹងត្រូវបានសួរថាតើអ្នកចង់ធ្វើអ្វីបន្ទាប់ពីចុចយល់ព្រមនៅក្នុងប្រអប់ខាងក្រោម) </p>

source: Enter scheduled transaction
km: បញ្ចូលប្រតិបត្តិការដែលបានកំណត់ពេល

source: Enter Schedule
km: បញ្ចូលកាលវិភាគ

source: Schedule Details
km: ព័ត៌មានលម្អិតអំពីកាលវិភាគ

# @label schedule name
source: Name:
km: ឈ្មោះ៖

source: Type:
km: ប្រភេទ:

source: Enter
km: បញ្ចូល

source: Enter the transaction and advance the next due date of this schedule to the next payment date.
km: បញ្ចូលប្រតិបត្តិការហើយឈានដល់កាលបរិច្ឆេទកំណត់បន្ទាប់នៃកាលវិភាគនេះទៅកាលបរិច្ឆេទទូទាត់បន្ទាប់។

source: Do not enter the transaction but advance the next due date of this schedule to the next payment date.
km: កុំបញ្ចូលប្រតិបត្តិការប៉ុន្តែឈានដល់កាលបរិច្ឆេទកំណត់បន្ទាប់នៃកាលវិភាគនេះទៅកាលបរិច្ឆេទទូទាត់បន្ទាប់។

source: Ignore
km: មិនអើពើ

source: Do not enter or skip payments for this schedule but continue with the next schedule.
km: កុំបញ្ចូលឬរំលងការបង់ប្រាក់សម្រាប់កាលវិភាគនេះប៉ុន្តែបន្តជាមួយកាលវិភាគបន្ទាប់។

source: Cancel processing of schedule entry.
km: បោះបង់ដំណើរការនៃការបញ្ចូលកាលវិភាគ។

# Equity name
source: Name
km: ឈ្មោះ

# Internal identifier
source: ID
km: លេខសម្គាល់

# Online quote source
source: Source
km: ប្រភព

source: %1 units in %2
km: %1 ឯកតាក្នុង %2

source: Failed to retrieve an exchange rate for %1 from %2. It will be skipped this time.
km: បានបរាជ័យក្នុងការទាញយកអត្រាប្តូរប្រាក់សម្រាប់ %1 ពី %2 ។ វានឹងរំលងនៅពេលនេះ។

source: Price Update Failed
km: ការធ្វើបច្ចុប្បន្នភាពតម្លៃបានបរាជ័យ

source: Failed to retrieve a quote for %1 from %2. Press <b>No</b> to remove the online price source from this security permanently, <b>Yes</b> to continue updating this security during future price updates or <b>Cancel</b> to stop the current update operation.
km: បានបរាជ័យក្នុងការទាញយកសម្រង់សម្រាប់ %1 ពី %2 ។ ចុច <b> ទេ </b> ដើម្បីដកប្រភពតម្លៃតាមអ៊ិនធរណេតពីសុវត្ថិភាពនេះជារៀងរហូត <b> ត្រូវហើយ </b> ដើម្បីបន្តធ្វើបច្ចុប្បន្នភាពសុវត្ថិភាពនេះកំឡុងពេលធ្វើបច្ចុប្បន្នភាពតម្លៃនាពេលអនាគតឬ <b> បោះបង់ </b> ដើម្បីបញ្ឈប់ប្រតិបត្តិការបច្ចុប្បន្ន។

source: Cannot update security <b>%1</b>: %2
km: មិនអាចធ្វើបច្ចុប្បន្នភាពសុវត្ថិភាពបានទេ <b> %1 </b> : %2

source: Price for %1 updated (id %2)
km: តម្លៃសម្រាប់ %1 បានបន្ទាន់សម័យ (លេខសម្គាល់ %2)

source: Received an invalid price for %1, unable to update.
km: ទទួលបានតម្លៃមិនត្រឹមត្រូវសម្រាប់ %1 មិនអាចធ្វើបច្ចុប្បន្នភាពបានទេ។

source: Received a price for %1 (id %2), but this symbol is not on the list. Aborting entire update.
km: ទទួលបានតម្លៃសម្រាប់ %1 (លេខសម្គាល់ %2) ប៉ុន្តែនិមិត្តសញ្ញានេះមិនមាននៅក្នុងបញ្ជីទេ។ បោះបង់ការធ្វើបច្ចុប្បន្នភាពទាំងស្រុង។

source: Update Stock and Currency Prices
km: ធ្វើបច្ចុប្បន្នភាពភាគហ៊ុននិងតម្លៃរូបិយប័ណ្ណ

source: List of known Equities, and the date they were last updated on.
km: បញ្ជីរាយនាមសមធម៌ដែលបានស្គាល់និងកាលបរិច្ឆេទដែលបានធ្វើបច្ចុប្បន្នភាពចុងក្រោយ។

source: Configure
km: កំណត់រចនាសម្ព័ន្ធ

source: Update All
km: ធ្វើ​បច្ចុប្បន្នភាព​ទាំងអស់

source: Update Selected
km: បានជ្រើសការធ្វើបច្ចុប្បន្នភាព

source: Status:
km: ស្ថានភាព៖

source: &OK
km: យល់ព្រម

source: &Cancel
km: បោះបង់

source: &Export
km: នាំចេញ

source: Start operation
km: ចាប់ផ្តើមប្រតិបត្តិការ

source: Use this to start the export operation
km: ប្រើវាដើម្បីចាប់ផ្តើមប្រតិបត្តិការនាំចេញ

source: &Browse...
km: រុករក ...

source: Select filename
km: ជ្រើសរើសឈ្មោះឯកសារ

source: Use this to select a filename to export to
km: ប្រើវាដើម្បីជ្រើសឈ្មោះឯកសារដើម្បីនាំចេញ

# New profile
source: &New...
km: ថ្មី...

source: Create a new profile
km: បង្កើតទម្រង់ថ្មី

source: Use this to open the profile editor
km: ប្រើវាដើម្បីបើកកម្មវិធីនិពន្ធទម្រង់

source: QIF Export
km: QIF នាំចេញ

source: From this dialog you are able to export transactions to a quicken compatible file, (known as a QIF file, because of the extension). Please enter the path to the QIF file or select it by clicking on the Browse button. You can choose the file's path, the account and the format of the QIF file (profile). Choose Account to export all the transactions between the specified dates or just categories. You can also limit the transactions that are exported by start and ending date. Once you have pressed the Export button a message box will appear when the export has completed detailing how many transactions, categories and payees were exported.
km: ពីប្រអប់នេះអ្នកអាចនាំចេញប្រតិបត្តិការទៅឯកសារដែលឆបគ្នាលឿនជាងមុន (ដែលគេស្គាល់ថាជាឯកសារ QIF ដោយសារតែផ្នែកបន្ថែម) ។ សូមបញ្ចូលផ្លូវទៅឯកសារ QIF ឬជ្រើសរើសវាដោយចុចលើប៊ូតុងរកមើល។ អ្នកអាចជ្រើសរើសផ្លូវឯកសារគណនីនិងទ្រង់ទ្រាយឯកសារ QIF (ទម្រង់) ។ ជ្រើសរើសគណនីដើម្បីនាំចេញរាល់ប្រតិបត្តិការរវាងកាលបរិច្ឆេទដែលបានបញ្ជាក់ឬប្រភេទ។ អ្នកក៏អាចកំណត់ប្រតិបត្តិការដែលត្រូវបាននាំចេញដោយកាលបរិច្ឆេទចាប់ផ្តើមនិងកាលបរិច្ឆេទបញ្ចប់។ នៅពេលដែលអ្នកបានចុចប៊ូតុងនាំចេញប្រអប់សារមួយនឹងលេចចេញនៅពេលដែលការនាំចេញបានបញ្ជាក់លម្អិតថាតើចំនួនប្រតិបត្តិការប្រភេទនិងអ្នកបង់ចំនួនប៉ុន្មានត្រូវបាននាំចេញ។

source: File to export to:
km: ឯកសារត្រូវនាំចេញទៅ៖

source: Browse...
km: រុករក ...

source: Account to export
km: គណនីត្រូវនាំចេញ

source: QIF Profile
km: ប្រវត្តិរូប QIF

# @action create new export profile
source: New...
km: ថ្មី ...

source: Contents to Export
km: មាតិកានាំចេញ

source: Categories
km: ប្រភេទ

source: Date Range
km: ជួរកាលបរិច្ឆេទ

source: End on:
km: បញ្ចប់នៅ៖

source: Start on:
km: ចាប់ផ្តើម៖

source: Export
km: នាំចេញ

# @info:tooltip for find transaction apply button
source: Search transactions
km: ប្រតិបត្តិការស្វែងរក

source: Text
km: អត្ថបទ

source: Category
km: ប្រភេទ

source: Tags
km: ស្លាក

source: Payees
km: អ្នកបង់ប្រាក់

source: Warning: Filtering by Category will exclude all transfers from the results.
km: ការព្រមាន: ការច្រោះតាមប្រភេទនឹងមិនរាប់បញ្ចូលរាល់ការផ្ទេរពីលទ្ធផល។

# No selection
source: (None)
km: (គ្មាន)

source: Current selections: %1
km: ជម្រើសបច្ចុប្បន្ន៖ %1

source: Found %1 matching transaction (D %2 / P %3 = %4)
km: បានរកឃើញប្រតិបត្តិការដែលត្រូវគ្នា %1 (D %2 / P %3 = %4)

source: Found %1 matching transaction
km: រកឃើញប្រតិបត្តិការត្រូវគ្នា %1

source: Search transactions
km: ប្រតិបត្តិការស្វែងរក

source: Criteria
km: លក្ខណៈវិនិច្ឆ័យ

source: Define your search criteria
km: កំណត់លក្ខណៈវិនិច្ឆ័យស្វែងរករបស់អ្នក

source: Contains
km: មាន

source: Does not contain
km: មិនមាន

source: Treat text as regular expression
km: ចាត់ទុកអត្ថបទជាកន្សោមធម្មតា

source: Case sensitive
km: ប្រកាន់​តួអក្សរ​តូច​ធំ

source: Range
km: ជួរ

# To (Date)
source: To
km: ទៅ

# From (Date)
source: From
km: ពី

source: Search this amount
km: ស្វែងរកចំនួននេះ

source: Search amount in the range
km: ស្វែងរកចំនួនទឹកប្រាក់នៅក្នុងជួរ

# to (amount)
source: to
km: ទៅ

# from (amount)
source: from
km: មកពី

source: Select transactions without tags
km: ជ្រើសរើសប្រតិបត្តិការដោយគ្មានស្លាក

source: Select all
km: ជ្រើស​យក​ទាំងអស់

source: Select none
km: ជ្រើសរើសយក

source: Payee
km: អ្នកទទួលប្រាក់

source: Select transactions without payees
km: ជ្រើសរើសប្រតិបត្តិការដោយគ្មានអ្នកបង់ប្រាក់

source: Validity
km: សុពលភាព

source: Type
km: ប្រភេទ

# @item reconciliation status
source: All states
km: រដ្ឋទាំងអស់

# @item reconciliation status
source: Not reconciled
km: មិនផ្សះផ្សា

# @item reconciliation status
source: Cleared
km: ជម្រះ

# @item reconciliation status
source: Reconciled
km: ផ្សះផ្សាឡើងវិញ

source: All types
km: គ្រប់ប្រភេទ

source: Payments
km: ការទូទាត់

source: Deposits
km: ការដាក់ប្រាក់

source: Transfers
km: ការផ្ទេរប្រាក់

source: Any transaction
km: ប្រតិបត្តិការណាមួយ

source: Valid transaction
km: ប្រតិបត្តិការត្រឹមត្រូវ

# @label reconciliation status
source: State
km: រដ្ឋ

source: Search this number
km: ស្វែងរកលេខនេះ

source: Search number in range
km: លេខស្វែងរកក្នុងជួរ

# to (number)
source: to
km: ទៅ

# from (number)
source: from
km: ពី

source: text
km: អត្ថបទ

source: Result
km: លទ្ធផល

source: Create Tables
km: បង្កើតតារាង

source: Save SQL
km: រក្សាទុក SQL

source: In order to use a database, you need to install some additional software. Click Help for more information
km: ដើម្បីប្រើមូលដ្ឋានទិន្នន័យអ្នកត្រូវតំឡើងកម្មវិធីបន្ថែមមួយចំនួន។ ចុចជំនួយសម្រាប់ព័ត៌មានបន្ថែម

source: No Qt SQL Drivers
km: មិនមានកម្មវិធីបញ្ជា Qt SQL ទេ

source: Unable to open database. You must use an SQL CREATE DATABASE statement before creating the tables. Click Help for more information.
km: មិនអាចបើកមូលដ្ឋានទិន្នន័យបានទេ។ អ្នកត្រូវតែប្រើសេចក្តីថ្លែងការណ៍ SQL បង្កើតមុនពេលបង្កើតតារាង។ សូមចុចជំនួយសម្រាប់ព័ត៌មានបន្ថែម។

source: Tables successfully created
km: បានបង្កើតតារាងដោយជោគជ័យ

source: Creation failed executing statement Executed: %1 Error No %2: %3
km: ការបង្កើតបានបរាជ័យក្នុងការប្រតិបត្តិសេចក្តីថ្លែងការណ៍ ប្រតិបត្តិ៖ %1 កំហុសទេ %2: %3

source: Select output file
km: ជ្រើសរើសឯកសារលទ្ធផល

source: Database type %1 has not been fully tested in a KMyMoney environment. Please make sure you have adequate backups of your data. Please report any problems to the developer mailing list at kmymoney-devel@kde.org
km: ប្រភេទមូលដ្ឋានទិន្នន័យ %1 មិនត្រូវបានសាកល្បងពេញលេញនៅក្នុងបរិយាកាសខេអិមមីយ។ សូមប្រាកដថាអ្នកមានព័ត៌មានបម្រុងទុកគ្រប់គ្រាន់។ សូមរាយការណ៍អំពីបញ្ហាណាមួយទៅកាន់បញ្ជីសំបុត្ររួមរបស់អ្នកអភិវឌ្ឍន៍នៅ kmymoney-devel@kde.org

source: KMyMoney - Generate SQL
km: KMyMoney - បង្កើត SQL

source: Database Type
km: ប្រភេទមូលដ្ឋានទិន្នន័យ

source: Database Details
km: ព័ត៌មានលម្អិតអំពីមូលដ្ឋានទិន្នន័យ

source: Database File (SQLite only)
km: ឯកសារមូលដ្ឋានទិន្នន័យ (សម្រាប់តែ SQLite)

source: Database Name (Others)
km: ឈ្មោះមូលដ្ឋានទិន្នន័យ (ផ្សេងទៀត)

source: Host Name
km: ឈ្មោះម៉ាស៊ីន

source: Username
km: ឈ្មោះ​អ្នកប្រើប្រាស់

source: Password
km: ពាក្យសម្ងាត់

source: SQL for creation
km: SQL សម្រាប់ការបង្កើត

source: GnuCash Import Options
km: ជម្រើសនាំចូល GnuCash

source: Use 'Help' for more information on these options
km: ប្រើ“ ជំនួយ” សម្រាប់ព័ត៌មានបន្ថែមអំពីជំរើសទាំងនេះ

source: Investment Handling
km: ការដោះស្រាយការវិនិយោគ

source: One investment account for each stock
km: គណនីវិនិយោគមួយសម្រាប់ភាគហ៊ុននីមួយៗ

source: One investment account for all stocks
km: គណនីវិនិយោគមួយសម្រាប់ភាគហ៊ុនទាំងអស់

source: Prompt for an investment account for each stock
km: ជំរុញឱ្យមានគណនីវិនិយោគសម្រាប់ភាគហ៊ុននីមួយៗ

source: Online price quotes
km: សម្រង់តម្លៃតាមអ៊ីនធឺណិត

source: Use Finance::Quote for share price quotes
km: ប្រើហិរញ្ញវត្ថុ :: ដកស្រង់សម្រាប់ការសម្រង់តម្លៃភាគហ៊ុន

source: Scheduled Transactions
km: ប្រតិបត្តិការដែលបានគ្រោងទុក

source: Drop suspect scheduled transactions
km: ទម្លាក់ការសង្ស័យដែលបានកំណត់ពេលប្រតិបត្តិការ

source: Decoding option
km: ជម្រើសឌិកូដ

source: Decode using
km: ឌិកូដដោយប្រើ

source: Transaction Notes option
km: ជម្រើសចំណាំប្រតិបត្តិការ

source: Use transaction notes on non-split transactions
km: ប្រើកំណត់ត្រាប្រតិបត្តិការលើប្រតិបត្តិការមិនបំបែក

source: Debug Options
km: ជម្រើសបំបាត់កំហុស

source: General debug data
km: ទិន្នន័យបំបាត់កំហុសទូទៅ

source: Display XML data
km: បង្ហាញទិន្នន័យ XML

source: Anonymize data
km: ទិន្នន័យអនាមិក

source: Investment: %1
km: ការវិនិយោគ៖ %1

source: Quote source: %1
km: ប្រភពដកស្រង់៖ %1

source: Online Quotes - Select price source
km: សម្រង់តាមអ៊ីនធឺណិត - ជ្រើសរើសប្រភពតម្លៃ

source: This price source is not known to KMyMoney. Please select an option below.
km: ប្រភពពីតម្លៃនេះមិនត្រូវបានគេស្គាល់ដោយខេអិមមីនីទេ។ សូមជ្រើសរើសជំរើសខាងក្រោម។

source: Do not perform online quotes for this investment
km: កុំអនុវត្តសម្រង់តាមអ៊ីនធឺណិតសម្រាប់ការវិនិយោគនេះ

source: Select a known KMyMoney source from the list below
km: ជ្រើសរើសប្រភព KMyMoney ដែលគេស្គាល់ពីបញ្ជីខាងក្រោម

source: Use the following name for the price source. (Click Help for further information.)
km: ប្រើឈ្មោះដូចខាងក្រោមសម្រាប់ប្រភពតម្លៃ។ (ចុចជំនួយសម្រាប់ព័ត៌មានបន្ថែម។ )

source: Always use this selection for this price source.
km: ប្រើជម្រើសនេះជានិច្ចសម្រាប់ប្រភពតម្លៃនេះ។

source: Select additional keys
km: ជ្រើសរើសកូនសោបន្ថែម

source: User identification
km: ការកំណត់អត្តសញ្ញាណអ្នកប្រើប្រាស់

source: Enter the id of the key you want to use for data encryption. This can either be an e-mail address or the hexadecimal key id. In case of the key id, do not forget the leading 0x.
km: បញ្ចូលលេខសម្គាល់នៃកូនសោដែលអ្នកចង់ប្រើសម្រាប់ការអ៊ិនគ្រីបទិន្នន័យ។ នេះអាចជាអាសយដ្ឋានអ៊ីមែលឬលេខសម្គាល់លេខគោលដប់ប្រាំមួយ។ ក្នុងករណីលេខសម្គាល់សំខាន់កុំភ្លេចលេខនាំមុខ 0x ។

source: Keys for all of the above user ids found
km: បានរកឃើញកូនសោសម្រាប់លេខសម្គាល់អ្នកប្រើទាំងអស់ខាងលើ

source: &Import
km: នាំចូល

source: Use this to start the import operation
km: ប្រើវាដើម្បីចាប់ផ្តើមប្រតិបត្តិការនាំចូល

source: %1|Import files %2|All files
km: %1 | ឯកសារនាំចូល %2 | ឯកសារទាំងអស់

source: Import File...
km: នាំចូលឯកសារ ...

source: QIF Import
km: QIF នាំចូល

source: <p>From this dialog you are able to import transactions from a Quicken<b>&trade;</b> compatible file, (known as a QIF file, because of the extension).</p> <p>Please enter the path to the QIF file or select it by clicking on the Browse button. Once you have the file's path press the Import button and KMyMoney will import all the transactions, categories and payees it finds.</p>
km: <p> ពីប្រអប់នេះអ្នកអាចនាំចូលប្រតិបត្តិការពី Quicken <b> ពាណិជ្ជកម្ម; </b> ឯកសារឆបគ្នា (ត្រូវបានគេស្គាល់ថាជាឯកសារ QIF ដោយសារតែផ្នែកបន្ថែម) ។ </p> <p> សូមបញ្ចូលផ្លូវទៅឯកសារ QIF ឬជ្រើសរើសវាដោយចុចលើប៊ូតុងរកមើល។ នៅពេលអ្នកមានផ្លូវចុចប៊ូតុងនាំចូលហើយ KMyMoney នឹងនាំចូលរាល់ប្រតិបត្តិការប្រភេទនិងអ្នកបង់ប្រាក់ដែលរកឃើញ។ </p>

source: QIF File to Import:
km: ឯកសារ QIF ត្រូវនាំចូល:

source: Import options
km: ជម្រើសនាំចូល

# @action create new import profile
source: New...
km: ថ្មី ...

source: Source of QIF
km: ប្រភពនៃ QIF

source: Select <b>Bank statement</b> turns on automatic category matching which is turned off in case of <b>Other application</b>. Use the latter if you import files from other Personal Finance Management software.
km: ជ្រើសរើស <b> របាយការណ៍ធនាគារ </b> បើកការផ្គូផ្គងប្រភេទស្វ័យប្រវត្តិដែលត្រូវបានបិទក្នុងករណី <b> កម្មវិធីផ្សេងទៀត </b> ។ ប្រើក្រោយប្រសិនបើអ្នកនាំចូលឯកសារពីកម្មវិធីគ្រប់គ្រងហិរញ្ញវត្ថុផ្ទាល់ខ្លួនផ្សេងទៀត។

source: Bank statement
km: របាយការណ៍ធនាគារ

source: Other application
km: កម្មវិធីផ្សេងទៀត

source: Import
km: នាំចូល

source: Verify Import
km: ផ្ទៀងផ្ទាត់ការនាំចូល

source: MyDialog
km: ប្រអប់ខ្ញុំ

source: Merge Transactions
km: បញ្ចូលប្រតិបត្តិការ

source: Are you sure you wish to merge these transactions?
km: តើអ្នកពិតជាចង់បញ្ចូលប្រតិបត្តិការទាំងអស់នេះមែនទេ?

source: File Information
km: ព័ត៌មានឯកសារ

source: Created on
km: បានបង្កើតនៅលើ

source: Last modified on
km: បានកែប្រែចុងក្រោយនៅ

source: Base currency
km: រូបិយប័ណ្ណគោល

source: Institutions
km: ស្ថាប័ននានា

source: Accounts/Categories
km: គណនី / ប្រភេទ

source: Transactions
km: ប្រតិបត្តិការ

source: Splits
km: ពុះ

source: Schedules
km: កាលវិភាគ

source: Prices
km: តម្លៃ

source: Total
km: សរុប

source: Closed
km: បានបិទ

source: &Delete
km: លុប

source: Delete this entry
km: លុបធាតុនេះ

source: Remove this price item from the file
km: យកធាតុតម្លៃនេះចេញពីឯកសារ

# New price entry
source: &New
km: ថ្មី

source: Add a new entry
km: បន្ថែមធាតុថ្មី

source: Create a new price entry.
km: បង្កើតធាតុតម្លៃថ្មី។

source: &Edit
km: កែសម្រួល

source: Modify the selected entry
km: កែប្រែធាតុដែលបានជ្រើសរើស

source: Change the details of selected price information.
km: ផ្លាស់ប្តូរព័ត៌មានលម្អិតនៃព័ត៌មានតម្លៃដែលបានជ្រើសរើស។

source: Do you really want to delete the selected price entry?
km: តើអ្នកពិតជាចង់លុបធាតុដែលបានជ្រើសរើសមែនទេ?

source: Delete price information
km: លុបព័ត៌មានតម្លៃ

source: Price Editor
km: កម្មវិធីកែសម្រួលតម្លៃ

source: Commodity
km: ទំនិញ

source: Stock Name
km: ឈ្មោះភាគហ៊ុន

source: Currency
km: រូបិយប័ណ្ណ

# Price source
source: Source
km: ប្រភព

source: Show all stored prices
km: បង្ហាញតម្លៃដែលបានរក្សាទុកទាំងអស់

# @action add new price
source: New
km: ថ្មី

source: Modify
km: កែប្រែ

source: Online Quotes
km: សម្រង់តាមអ៊ីនធឺណិត

source: Delete
km: លុប

source: Split Options
km: ជម្រើសបំបែក
