Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: <center>Do you want to add a new security</center> <center>%1 </center> <center>to the selection list?</center> <center>Click 'Continue' to add the name.</center> <center>Otherwise, click 'Cancel'.</center>
km: <center> តើអ្នកចង់បន្ថែមសន្តិសុខថ្មីទេ </center> <center> %1 </center> <center> ទៅបញ្ជីជ្រើសរើស? </center> <center> ចុច 'បន្ត' ដើម្បីបន្ថែមឈ្មោះ។ </center> <center> បើមិនដូច្នោះទេចុច 'បោះបង់' ។ </center>

source: Add Security Name
km: បន្ថែមឈ្មោះសុវត្ថិភាព

source: <center>You have selected to remove from the selection list</center> <center>%1. </center> <center>Click 'Continue' to remove the name, or</center> <center>Click 'Cancel'' to leave 'as is'.</center>
km: <center> អ្នកបានជ្រើសរើសលុបពីបញ្ជីជ្រើសរើស </center> <center> %1 ។ </center> <center> ចុច 'បន្ត' ដើម្បីលុបឈ្មោះឬ </center> <center> ចុច 'បោះបង់' 'ដើម្បីចាកចេញ' គឺ '។ </center>

source: Hide Security Name
km: លាក់ឈ្មោះសុវត្ថិភាព

source: Lines-Date Wizard Page
km: ទំព័រអ្នកជំនួយការបន្ទាត់ - កាលបរិច្ឆេទ

source: Please select the start and end lines. Ensure you drop any trailer lines. Also, select the correct date format.
km: សូមជ្រើសរើសបន្ទាត់ចាប់ផ្តើមនិងបញ្ចប់។ ធានាថាអ្នកទម្លាក់ខ្សែរភាពយន្តណាមួយ។ ផងដែរជ្រើសទ្រង់ទ្រាយកាលបរិច្ឆេទត្រឹមត្រូវ។

source: Start line
km: បន្ទាត់ចាប់ផ្តើម

source: Enter the number of the first transaction line. Will not accept value greater than the End Line value.
km: បញ្ចូលចំនួនខ្សែប្រតិបត្តិការដំបូង។ នឹងមិនទទួលយកតម្លៃធំជាងតម្លៃរបស់ End End ឡើយ។

source: End line
km: ខ្សែបញ្ចប់

source: Enter the number of the last transaction line. Will not accept value less than Start Line value.
km: បញ្ចូលលេខនៃខ្សែប្រតិបត្តិការចុងក្រោយ។ នឹងមិនទទួលយកតម្លៃទាបជាងតម្លៃបន្ទាត់ចាប់ផ្តើម។

# date format to use
source: Date format
km: ទ្រង់ទ្រាយកាលបរិច្ឆេទ

source: Results table
km: តារាងលទ្ធផល

source: Column
km: ជួរឈរ

source: <center>No valid activity type found for this transaction.</center><center>Please check the parameters supplied.</center>
km: <center> រកមិនឃើញប្រភេទសកម្មភាពត្រឹមត្រូវសម្រាប់ប្រតិបត្តិការនេះទេ។ </center><center> សូមពិនិត្យមើលប៉ារ៉ាម៉ែត្រដែលបានផ្គត់ផ្គង់។ </center>

source: There is a problem with the columns selected for 'Price', 'Quantity and 'Amount'. You will need to reselect those columns.
km: មានបញ្ហាជាមួយជួរឈរដែលបានជ្រើសរើស សម្រាប់ 'តំលៃ', បរិមាណនិង 'ចំនួនទឹកប្រាក់' ។ អ្នកត្រូវជ្រើសរើសជួរឈរទាំងនោះឡើងវិញ។

source: The values in the columns you have selected do not match any expected investment type. Please check the fields in the current transaction, and also your selections.
km: តម្លៃនៅក្នុងជួរឈរដែលអ្នកបានជ្រើសរើស មិនត្រូវគ្នានឹងប្រភេទវិនិយោគដែលរំពឹងទុកទេ។ សូមពិនិត្យមើលវាលនៅក្នុងប្រតិបត្តិការបច្ចុប្បន្ន និងជម្រើសរបស់អ្នកផងដែរ។

source: Enter Account Name
km: បញ្ចូលឈ្មោះគណនី

source: Redefine Transaction Type
km: ប្រភេទប្រតិបត្តិការប្តូរដែនកំណត់

source: Invalid Transaction Type
km: ប្រភេទប្រតិបត្តិការមិនត្រឹមត្រូវ

source: The transaction below has an unrecognised type/action. Please select an appropriate entry.
km: ប្រតិបត្តិការខាងក្រោមមានប្រភេទ / សកម្មភាពដែលមិនស្គាល់។ សូមជ្រើសរើសធាតុដែលសមស្រប។

# the number of the column containing error
source: Type/action column
km: ប្រភេទ / ជួរឈរសកម្មភាព

source: Select Transaction Type
km: ជ្រើសរើសប្រភេទប្រតិបត្តិការ

source: Select new investment type
km: ជ្រើសរើសប្រភេទវិនិយោគថ្មី

# description of investment activity
source: Buy Shares
km: ទិញភាគហ៊ុន

# description of investment activity
source: Sell Shares
km: លក់ភាគហ៊ុន

# description of investment activity
source: Dividend
km: ភាគលាភ

# description of investment activity
source: Reinvest Dividend
km: ភាគលាភ Reinvest

# description of investment activity
source: Add Shares
km: បន្ថែមភាគហ៊ុន

# description of investment activity
source: Remove Shares
km: យកភាគហ៊ុនចេញ

source: Separator Wizard Page
km: ទំព័រអ្នកជំនួយការបំបែក

source: The field delimiter should be detected automatically. Attempting to change it will reset any field choices. The text delimiter does not normally need to be changed, except possibly when within a field.
km: អ្នកកំណត់ព្រំដែនគួរតែត្រូវបានរកឃើញដោយស្វ័យប្រវត្តិ។ ការប៉ុនប៉ងដើម្បីផ្លាស់ប្តូរវានឹងកំណត់ជម្រើសវាលណាមួយឡើងវិញ។ ធម្មតាអ្នកកំណត់ព្រំដែនអត្ថបទមិនចាំបាច់ត្រូវបានផ្លាស់ប្តូរទេ លើកលែងតែពេលដែលនៅទីវាល។

source: Field Delimiter
km: អ្នកកំណត់ព្រំដែន

source: semiColon (;)
km: កូឡូឡុន (;)

source: colon (:)
km: សញ្ញា (:)

source: tab (\t)
km: ផ្ទាំង (\ t)

# punctuation mark used as field delimiter
source: Text Delimiter
km: អ្នកកំណត់ព្រំដែនអត្ថបទ

source: Select field delimiter/separator character. This will reset any existing field choices.
km: ជ្រើសតួអក្សរកំណត់ព្រំដែន / តួអក្សរបំបែក។ វានឹងកំណត់ជម្រើសវាលដែលមានស្រាប់ឡើងវិញ។

source: quote (")
km: សម្រង់ (")

source: apostrophe (')
km: សញ្ញា (')

source: Symbols and Security Names present
km: និមិត្តសញ្ញានិងឈ្មោះសុវត្ថិភាពមានវត្តមាន

# Confirm
source: Yes
km: បាទ / ចាស

source: Security and Symbols
km: សន្តិសុខនិងនិមិត្តសញ្ញា

source: Edit Securities and Symbols
km: កែសម្រួលមូលបត្រនិងនិមិត្តសញ្ញា

source: The following symbols and securities are present in the import file. Existing securities will be flagged in the 'Exists' column. If necessary, edit security names to match your existing File, and add missing symbols, which are necessary for import. For new securities, edit the name in one of its rows, and that name will apply to its other rows, if any.
km: និមិត្តសញ្ញានិងមូលបត្រខាងក្រោមមាននៅក្នុងឯកសារនាំចូល។ មូលប័ត្រដែលមានស្រាប់នឹងត្រូវបានបោះទង់សម្គាល់នៅក្នុងជួរឈរ“ បច្ចុប្បន្ន” ។ បើចាំបាច់កែសម្រួលឈ្មោះសុវត្ថិភាពដើម្បីផ្គូផ្គងឯកសារដែលមានស្រាប់ និងបន្ថែមនិមិត្តសញ្ញាដែលបាត់ដែលចាំបាច់សម្រាប់នាំចូល។ សម្រាប់មូលបត្រថ្មីកែសម្រួលឈ្មោះក្នុងជួរមួយរបស់វាហើយឈ្មោះនោះនឹងត្រូវអនុវត្តចំពោះជួរដេកផ្សេងទៀតប្រសិនបើមាន។

source: Exists
km: មាន

source: Security Name
km: ឈ្មោះសុវត្ថិភាព

source: Schedules to iCalendar
km: កាលវិភាគសម្រាប់ iCalendar

source: Schedules to iCalendar [%1]
km: កាលវិភាគសម្រាប់ iCalendar [%1]

# ICS (Filefilter)
source: iCalendar files
km: ឯកសារ iCalendar

source: Export as
km: នាំចេញជា

source: Minutes
km: នាទី

source: Hours
km: ម៉ោង

# Time unit
source: Days
km: ថ្ងៃ

source: Before
km: មុន

source: After
km: បន្ទាប់ពី

source: To create an alarm for the exported schedules
km: ដើម្បីបង្កើតសំឡេងរោទិ៍សម្រាប់កាលវិភាគនាំចេញ

source: Tells whether the reminder should be triggered before or after the schedule start
km: ប្រាប់ថាតើការរំshouldកគួរត្រូវបានកេះមុនឬក្រោយកាលវិភាគចាប់ផ្តើម

source: The number of units of the interval before or after the schedule starts
km: ចំនួនឯកតានៃចន្លោះពេលមុនឬបន្ទាប់ពីកាលវិភាគចាប់ផ្តើម

source: The units of the interval before or after the schedule starts in seconds
km: ឯកតានៃចន្លោះពេលមុនឬបន្ទាប់ពីកាលវិភាគចាប់ផ្តើមគិតជាវិនាទី

source: If the reminders should repeat or not
km: ប្រសិនបើការរំshouldកគួរតែធ្វើឡើងវិញឬអត់

source: The number of units of the interval between reminders
km: ចំនួនឯកតានៃចន្លោះពេលរវាងកម្មវិធីរំលឹក

source: The units of the interval between reminders in seconds
km: ឯកតានៃចន្លោះពេលរវាងកម្មវិធីរំលឹកក្នុងរយៈពេលប៉ុន្មានវិនាទី

source: The number of reminders to be generated for the schedule
km: ចំនួននៃការរំលឹកដែលត្រូវបង្កើតសម្រាប់កាលវិភាគ

source: The icalendar file in which to export the schedules.
km: ឯកសារ icalendar ដែលត្រូវនាំចេញតារាងពេលវេលា។

source: Icalendar export settings
km: ការកំណត់ការនាំចេញរបស់ Icalendar

source: Create reminders
km: បង្កើតកម្មវិធីរំលឹក

# @action whether the schedule will have more occurrences over time
source: Repeating:
km: ធ្វើឡើងវិញ៖

source: How often:
km: ជា​ញឹកញាប់:

source: Interval:
km: ចន្លោះពេល៖

source: Time(s)
km: ពេលវេលា

source: iCalendar file
km: ឯកសារ iCalendar

source: Transfer from %1 to %2, Payee %3, amount %4
km: ផ្ទេរពី %1 ទៅ %2, អ្នកបង់ប្រាក់ %3, ចំនួន %4

source: From %1 into %2, Category %3, sum of %4
km: ពី %1 ទៅជា %2, ប្រភេទ %3, ផលបូក %4

source: From account %1, Pay to %2, Category %3, sum of %4
km: ពីគណនី %1 បង់ទៅ %2, ប្រភេទ %3, ផលបូក %4

source: You selected to extract the payee from the memo field but did not supply a regular expression for payee and memo extraction. The option will not be activated.
km: អ្នកបានជ្រើសរើសដើម្បីដកអ្នកទទួលប្រាក់ចេញពីវាលកំណត់ហេតុប៉ុន្តែអ្នកមិនបានផ្គត់ផ្គង់កន្សោមធម្មតាសម្រាប់អ្នកទទួលប្រាក់និងកម្រងអនុស្សរណៈទេ។ ជម្រើសនឹងមិនត្រូវបានធ្វើឱ្យសកម្មទេ។

source: Missing information
km: បាត់ព័ត៌មាន

source: Account:
km: គណនី៖

source: Bank:
km: ធនាគារ៖

source: Use payee field as provided by institution
km: ប្រើវាលអ្នកបង់ប្រាក់ដូចដែលបានផ្តល់ដោយស្ថាប័ន

source: Extract payee from memo field using regular expressions
km: ទាញយកអ្នកបង់ប្រាក់ពីវាលអនុសរណៈដោយប្រើកន្សោមធម្មតា

source: Exceptions
km: ករណីលើកលែង

source: Regular Expression for
km: កន្សោមធម្មតាសម្រាប់

source: Download
km: ទាញយក

source: The plugin usually downloads the account balance and transactions. In some circumstances, the download of transaction data is not supported for certain accounts. The following option allows to turn off the request for transaction data.
km: កម្មវិធីជំនួយជាធម្មតាទាញយកសមតុល្យគណនីនិងប្រតិបត្តិការ។ ក្នុងកាលៈទេសៈខ្លះការទាញយកទិន្នន័យប្រតិបត្តិការមិនត្រូវបានគាំទ្រសម្រាប់គណនីជាក់លាក់ទេ។ ជម្រើសខាងក្រោមអនុញ្ញាតឱ្យបិទការស្នើសុំទិន្នន័យប្រតិបត្តិការ។

source: Download transactions from institution
km: ទាញយកប្រតិបត្តិការពីស្ថាប័ន

source: Ask user
km: សួរអ្នកប្រើប្រាស់

source: No date
km: គ្មានកាលបរិច្ឆេទ

source: Last download
km: ទាញយកចុងក្រោយ

source: First possible
km: ដំបូងអាចធ្វើទៅបាន

source: Default start date for statement download
km: កាលបរិច្ឆេទចាប់ផ្តើមលំនាំដើមសម្រាប់ការទាញយកសេចក្តីថ្លែងការណ៍

source: Account Mapping
km: ការគូសផែនទីគណនី

source: <qt> Please choose the <b>online</b> account you want the <b>application</b> account to be mapped to from the list below. </qt>
km: <qt> សូមជ្រើសរើស <b> លើបណ្តាញ </b> គណនីដែលអ្នកចង់បាន <b> កម្មវិធី </b> គណនីត្រូវបានធ្វើផែនទីពីបញ្ជីខាងក្រោម។ </qt>

source: Application Account
km: គណនីពាក្យសុំ

source: Bank Code
km: លេខកូដធនាគារ

source: Account Number
km: លេខ​គណនី

source: Online Accounts
km: គណនីតាមអ៊ីនធឺណិត

source: Assign
km: ចាត់តាំង

source: <qt><p>Please select the first date for which transactions are to be retrieved from <b>%1</b>.</p><p>If you specify no date then the bank will choose one.</p></qt>
km: <qt><p> សូមជ្រើសរើសកាលបរិច្ឆេទដំបូងសម្រាប់ប្រតិបត្តិការណាមួយដែលត្រូវទាញយកមកវិញ <b> %1 </b> ។ </p><p> ប្រសិនបើអ្នកមិនបញ្ជាក់កាលបរិច្ឆេទទេនោះធនាគារនឹងជ្រើសរើសយកមួយ។ </p></qt>

source: Pick Start Date
km: ជ្រើសរើសកាលបរិច្ឆេទចាប់ផ្តើម

source: Start Date
km: ថ្ងៃ​ចាប់ផ្តើម

source: No date (let the bank determine the start date)
km: គ្មានកាលបរិច្ឆេទ (ទុកឱ្យធនាគារកំណត់កាលបរិច្ឆេទចាប់ផ្តើម)

source: Last Update
km: ធ្វើបច្ចុប្បន្នភាពចុងក្រោយ

source: First possible date
km: កាលបរិច្ឆេទដំបូងដែលអាចទៅរួច

source: Pick date
km: ជ្រើសរើសកាលបរិច្ឆេទ

source: &Help
km: ជំនួយ

source: Width of the flicker field for optical tan generation (chipTan/sm@rtTan).
km: ទទឹងនៃវាល flicker សម្រាប់ជំនាន់តាន់អុបទិក (chipTan / sm@rtTan) ។

source: Clock length of optical tan flickering in ms.
km: ប្រវែងនាឡិកានៃការចាំងពន្លឺអុបទិកនៅក្នុងអិម។

source: After a clock the first flicker bar changes (each half-byte is transmitted in 2*clock setting).
km: បន្ទាប់ពីមួយម៉ោងរបារផ្លាស់ប្តូរដំបូងផ្លាស់ប្តូរ (បៃពាក់កណ្តាលនីមួយៗត្រូវបានបញ្ជូនតាមការកំណត់ម៉ោង 2 *) ។

source: Online settings
km: ការកំណត់តាមអ៊ីនធឺណិត

source: KBanking module not correctly initialized
km: ម៉ូឌុល KBanking មិនបានចាប់ផ្តើមត្រឹមត្រូវទេ

source: Configure Aq&Banking...
km: កំណត់រចនាសម្ព័ន្ធអេកប៊ែងឃីង ...

source: AqBanking importer...
km: អ្នកនាំចូល AqBanking …

source: <qt>The given application account <b>%1</b> has not been mapped to an online account.</qt>
km: <qt> គណនីពាក្យសុំដែលបានផ្តល់ឱ្យ <b> %1 </b> មិនត្រូវបានបញ្ចូលទៅក្នុងគណនីនៅលើអ៊ីនធឺណិតទេ។ </qt>

source: Account Not Mapped
km: គណនីមិនត្រូវបានគូសផែនទី

source: <qt>Could not enqueue the job. </qt>
km: <qt> មិនអាចប្រមូលការងារបានទេ។ </qt>

source: Error importing statement. Do you want to continue?
km: កំហុសក្នុងការនាំចូលរបាយការណ៍។ តើអ្នកចង់បន្តទេ?

source: Critical Error
km: កំហុសសំខាន់

source: A valid tan is required to proceed.
km: តាន់ដែលមានសុពលភាពត្រូវបានទាមទារដើម្បីបន្ត។

source: Order confirmation
km: ការ​បញ្ជាក់​ការ​បញ្ជាទិញ

source: Reduce optical tan area in size
km: កាត់បន្ថយផ្ទៃតាន់អុបទិកក្នុងទំហំ

source: Reduce
km: កាត់បន្ថយ

source: Enlarge optical tan field
km: ពង្រីកវាល tan អុបទិក

source: Enlarge
km: ពង្រីក

source: Accelerate
km: បង្កើនល្បឿន

source: To confirm this order enter the tan displayed by your generator
km: ដើម្បីបញ្ជាក់ពីការបញ្ជាទិញនេះសូមបញ្ចូលពណ៌ត្នោតដែលបង្ហាញដោយម៉ាស៊ីនភ្លើងរបស់អ្នក

# replacement for institution or account w/o name
source: (unnamed)
km: (មិនបញ្ចេញឈ្មោះ)

# Header for AqBanking account list
source: Id
km: លេខសម្គាល់

# Header for AqBanking account list
source: Institution Code
km: លេខកូដស្ថាប័ន

# Header for AqBanking account list
source: Institution Name
km: ឈ្មោះ​វិទ្យាស្ថាន

# Header for AqBanking account list
source: Account Number
km: លេខ​គណនី

# Header for AqBanking account list
source: Account Name
km: ឈ្មោះ​គណនី

# Header for AqBanking account list
source: Owner
km: ម្ចាស់

# Header for AqBanking account list
source: Backend
km: កម្មវិធីខាងក្រោយ

source: Get Balance
km: ទទួលបានតុល្យភាព

source: Get Transactions
km: ទទួលបានប្រតិបត្តិការ

source: Transfer
km: ផ្ទេរ

source: Debit Note
km: ចំណាំឥណពន្ធ

# Unknown job type
source: (unknown)
km: (មិនស្គាល់)

# Unknown bank code
source: (unknown)
km: (មិនស្គាល់)

# Unknown account number
source: (unknown)
km: (មិនស្គាល់)

# Status of the job
source: new
km: ថ្មី

# Status of the job
source: accepted
km: បានទទួលយក

# Status of the job
source: rejected
km: បដិសេធ

# Status of the job
source: pending
km: កំពុងរង់ចាំ

# Status of the job
source: sending
km: ផ្ញើ

# Status of the job
source: reconciled (auto)
km: ផ្សះផ្សា (ដោយស្វ័យប្រវត្តិ)

# Status of the job
source: reconciled (manual)
km: ផ្សះផ្សា (សៀវភៅដៃ)

# Status of the job
source: revoked
km: ដកហូត

# Status of the job
source: aborted
km: បានបោះបង់ចោល

# Status of the job
source: error
km: កំហុស

# Status of the job
source: (unknown)
km: (មិនស្គាល់)

source: Job Id
km: លេខសម្គាល់ការងារ

source: Job Type
km: ប្រភេទ​ការងារ

source: Institute
km: វិទ្យាស្ថាន

source: To confirm this order enter the tan displayed by your &generator
km: ដើម្បីបញ្ជាក់ពីការបញ្ជាទិញនេះសូមបញ្ចូលពណ៌ត្នោតដែលបង្ហាញដោយម៉ាស៊ីនភ្លើងរបស់អ្នក

source: <qt>The update job is not supported by the bank/account/backend. </qt>
km: <qt> ការងារធ្វើបច្ចុប្បន្នភាពមិនត្រូវបានគាំទ្រដោយធនាគារ / គណនី / អ្នកខាងក្រោយទេ។ </qt>

source: Job not Available
km: ការងារមិនមាន

# Status of the job
source: updated
km: ធ្វើឱ្យទាន់សម័យ

# Status of the job
source: sent
km: បានផ្ញើ

# Status of the job
source: finished
km: បញ្ចប់

# Unknown account provider
source: (unknown)
km: (មិនស្គាល់)

# Unknown creator of the job
source: (unknown)
km: (មិនស្គាល់)

source: Backend
km: កម្មវិធីខាងក្រោយ

source: Application
km: ពាក្យសុំ

source: The HTTP request failed.
km: សំណើរ HTTP បរាជ័យ។

# The HTTP request failed
source: Failed
km: បានបរាជ័យ

source: OFX Direct Connect
km: OFX ភ្ជាប់ផ្ទាល់

source: Contacting bank...
km: កំពុងទាក់ទងធនាគារ ...

source: Loading banklist
km: ផ្ទុកបញ្ជីធនាគារ

source: Getting list of banks from http://moneycentral.msn.com/ This may take some time depending on the available bandwidth.
km: ការទទួលបានបញ្ជីធនាគារពី http://moneycentral.msn.com/ វាអាចចំណាយពេលខ្លះអាស្រ័យលើកម្រិតបញ្ជូនដែលមាន។

source: Supports online statements<br/>
km: គាំទ្រសេចក្តីថ្លែងតាមអ៊ីនធឺណិត <br/>

source: Supports investments<br/>
km: គាំទ្រដល់ការវិនិយោគ <br/>

source: Supports bill payment (but not supported by KMyMoney yet)<br/>
km: គាំទ្រការទូទាត់វិក័យប័ត្រ (ប៉ុន្តែមិនទាន់មានការគាំទ្រពីខេខេមីយនីនៅឡើយទេ) <br/>

source: Does not support online banking
km: មិនគាំទ្រដល់សេវាកម្មធនាគារតាមអ៊ីនធឺណិតទេ

source: Please choose a bank.
km: សូមជ្រើសរើសធនាគារ។

source: Please fill all fields with values.
km: សូមបំពេញវាលទាំងអស់ដោយតម្លៃ។

source: <p>Details for %1:</p>
km: <p> ព័ត៌មានលម្អិតសម្រាប់ %1៖ </p>

source: No suitable accounts were found at this bank.
km: មិនមានគណនីសមរម្យណាមួយត្រូវបានរកឃើញនៅធនាគារនេះទេ។

source: Please choose an account
km: សូមជ្រើសរើសគណនី

source: Server message: %1
km: សារម៉ាស៊ីនមេ៖ %1

source: Your bank returned warnings when signing on
km: ធនាគាររបស់អ្នកបានធ្វើការព្រមាននៅពេលអ្នកចូល

# Warning 'message'
source: WARNING %1
km: ព្រមាន %1

source: Error signing onto your bank
km: កំហុសក្នុងការចូលទៅក្នុងធនាគាររបស់អ្នក

source: ERROR %1
km: កំហុស %1

source: Online Banking Account Setup
km: រៀបចំគណនីធនាគារតាមអ៊ីនធឺណិត

source: Select Financial Institution
km: ជ្រើសរើសស្ថាប័នហិរញ្ញវត្ថុ

source: Please select your financial institution from the list below...
km: សូមជ្រើសរើសស្ថាប័នហិរញ្ញវត្ថុរបស់អ្នកពីតារាងខាងក្រោម ...

# @title type of online banking connection
source: Automatic
km: ស្វ័យប្រវត្តិ

# @title type of online banking connection
source: Manual
km: ហត្ថកម្ម

source: Enter Login Details
km: បញ្ចូលព័ត៌មានលំអិតចូល

source: Please enter the username and password you use to log into this bank for online banking. Please note that many banks require a separate signup, and assign a separate PIN or password just for online banking from home.
km: សូមបញ្ចូលឈ្មោះអ្នកប្រើនិងពាក្យសម្ងាត់ដែលអ្នកប្រើដើម្បីចូលធនាគារនេះសម្រាប់ធនាគារតាមអ៊ីនធឺណិត។ សូមកត់សម្គាល់ថាធនាគារជាច្រើនត្រូវការការចុះឈ្មោះដាច់ដោយឡែកហើយកំណត់លេខសម្ងាត់ឬពាក្យសម្ងាត់ដាច់ដោយឡែកសម្រាប់តែសេវាកម្មធនាគារតាមអ៊ីនធឺណិតពីផ្ទះប៉ុណ្ណោះ។

# @label account username
source: Username
km: ឈ្មោះ​អ្នកប្រើប្រាស់

source: Store password
km: ទុកពាក្យសម្ងាត់

source: Identify as
km: កំណត់អត្តសញ្ញាណជា

source: Expert option to enter the four digit version information of the application
km: ជម្រើសអ្នកជំនាញដើម្បីបញ្ចូលព័ត៌មានកំណែបួនខ្ទង់នៃកម្មវិធី

source: Header Version
km: ក្បាលទំព័រ

source: Connection Details
km: ព័ត៌មានលម្អិតការតភ្ជាប់

source: Client UID
km: អតិថិជន UID

source: Select Account
km: ជ្រើសរើសគណនី

source: Please select the account from your financial institution from the list below which matches this account.
km: សូមជ្រើសរើសគណនីពីស្ថាប័នហិរញ្ញវត្ថុរបស់អ្នកពីបញ្ជីខាងក្រោមដែលត្រូវនឹងគណនីនេះ។

source: Bank
km: ធនាគារ

source: Branch
km: សាខា

source: Finish
km: បញ្ចប់

source: Congratulations: you have successfully set up your bank for online banking via OFX.
km: អបអរសាទរអ្នកបានរៀបចំធនាគាររបស់អ្នកដោយជោគជ័យសម្រាប់ធនាគារតាមអ៊ិនធឺរណែតតាមរយៈ OFX ។

source: Enabled & configured
km: ត្រូវបានកំណត់រចនាសម្ព័ន្ធ

source: Account Details
km: ព័ត៌មានលម្អិតអំពីគណនី

source: STATUS:
km: ស្ថិតិ៖

source: Unavailable
km: មិនមាន

source: BANK/BROKER:
km: ធនាគារ / ជើងសាមូលនិធិៈ

source: &lt;Not configured&gt;
km: វាមិនបានកំណត់រចនាសម្ព័ន្ធ;

source: ACCOUNT:
km: គណនី៖

source: OFX Details
km: ព័ត៌មានលម្អិត OFX

source: OFX <CLIENTUID> for institutions that require it
km: OFX <CLIENTUID> សម្រាប់ស្ថាប័នដែលត្រូវការវា

source: Import Details
km: ព័ត៌មានលម្អិតនាំចូល

source: Start date of import
km: កាលបរិច្ឆេទចាប់ផ្តើមនៃការនាំចូល

source: Last &update
km: ការធ្វើបច្ចុប្បន្នភាពចុងក្រោយ

source: To&day minus
km: ដកថ្ងៃនេះ

# @action number of days
source: days
km: ថ្ងៃ

source: Pi&ck date
km: ជ្រើសរើសកាលបរិច្ឆេទ

source: Payee's name is based on contents of the OFX tag
km: ឈ្មោះរបស់អ្នកបង់ប្រាក់គឺផ្អែកលើមាតិកានៃស្លាក OFX

source: <html><head/><body><p>In case the server is located in a different timezone than your local time, then the post date of imported transactions is off by a day.</p><p>This setting can be used to adjust the timestamps of the transactions during import to reflect your local time. It does not affect previously imported transactions. </p><p>If you are located west of your bank's server than enter a negative time, in case you are located east of it enter a positve time.</p><p>If you are not sure, leave this setting at 0:00.</p></body></html>
km: <html><head/><body><p> ក្នុងករណីដែលម៉ាស៊ីនមេស្ថិតនៅក្នុងតំបន់ពេលវេលាខុសពីម៉ោងក្នុងស្រុករបស់អ្នកនោះកាលបរិច្ឆេទក្រោយប្រតិបត្តិការដែលបាននាំចូលត្រូវបានបិទក្នុងមួយថ្ងៃ។ </p><p> ការកំណត់នេះអាចត្រូវបានប្រើដើម្បីកែពេលវេលានៃប្រតិបត្តិការកំឡុងពេលនាំចូលដើម្បីឆ្លុះបញ្ចាំងម៉ោងក្នុងស្រុករបស់អ្នក។ វាមិនប៉ះពាល់ដល់ប្រតិបត្តិការដែលបាននាំចូលពីមុនទេ។ </p><p> ប្រសិនបើអ្នកមានទីតាំងនៅភាគខាងលិចនៃម៉ាស៊ីនមេធនាគាររបស់អ្នកជាងចូលពេលវេលាអវិជ្ជមានក្នុងករណីដែលអ្នកមានទីតាំងនៅខាងកើតវាបញ្ចូលពេលវេលាវិជ្ជមាន។ </p><p> ប្រសិនបើអ្នកមិនច្បាស់សូមចាកចេញពីការកំណត់នេះនៅម៉ោង 0:00 ។ </p></body></html>

source: Timezone offset
km: អុហ្វសិតតំបន់ពេលវេលា

source: Quicken Windows 2004
km: Quicken Windows ២០០៤

source: Quicken Windows 2005
km: Quicken Windows ២០០៥

source: Quicken Windows 2006
km: Quicken Windows ២០០៦

source: Quicken Windows 2007
km: Quicken Windows ២០០៧

source: Quicken Windows 2014
km: Quicken Windows ២០១៤

source: Quicken Windows (Expert)
km: Quicken Windows (អ្នកជំនាញ)

source: MS-Money 2003
km: MS-Money ២០០៣

source: MS-Money 2004
km: MS-Money ២០០៤

source: MS-Money 2005
km: MS-Money ២០០៥

source: MS-Money 2006
km: MS-Money ២០០៦

source: MS-Money 2007
km: MS-Money ២០០៧

source: MS-Money (Expert)
km: អេសអេស - លុយ (ជំនាញ)

source: Enter your password for account <b>%1</b>
km: បញ្ចូលពាក្យសម្ងាត់របស់អ្នកសម្រាប់គណនី <b> %1 </b>

source: OFX import file selection
km: ការជ្រើសរើសឯកសារនាំចូល OFX

source: Unable to import %1 using the OFX importer plugin. This file is not the correct format.
km: មិនអាចនាំចូល %1 ដោយប្រើកម្មវិធីជំនួយអ្នកនាំចូល OFX ។ ឯកសារនេះមិនមែនជាទ្រង់ទ្រាយត្រឹមត្រូវទេ។

source: Incorrect format
km: ទ្រង់ទ្រាយមិនត្រឹមត្រូវ

source: Unable to parse file
km: មិនអាចញែកឯកសារបានទេ

source: No accounts found.
km: រកមិនឃើញគណនី។

source: Error connecting to bank: %1
km: កំហុសក្នុងការភ្ជាប់ទៅធនាគារ៖ %1

source: <p>Unable to import <b>'%1'</b> using the OFX importer plugin. The plugin returned the following error:</p><p>%2</p>
km: <p> មិនអាចនាំចូលបានទេ <b> '%1' </b> ប្រើកម្មវិធីជំនួយអ្នកនាំចូល OFX ។ កម្មវិធីជំនួយបានត្រឡប់កំហុសដូចខាងក្រោម៖ </p><p> %2 </p>

source: Importing process terminated unexpectedly.
km: ដំណើរការនាំចូលបានបញ្ចប់ដោយមិននឹកស្មានដល់។

source: Failed to import all statements.
km: បានបរាជ័យក្នុងការនាំចូលរបាយការណ៍ទាំងអស់។

source: Cannot open file %1 for writing
km: មិនអាចបើកឯកសារ %1 សម្រាប់ការសរសេរ

source: OFX setup error
km: កំហុសរៀបចំ OFX

source: SEPA Credit Transfer
km: សេវាផ្ទេរប្រាក់អេសអេអេអេ

source: For this beneficiary's country the BIC is mandatory.
km: សម្រាប់ប្រទេសអ្នកទទួលផលនេះ BIC គឺចាំបាច់។

source: A beneficiary name is needed.
km: ត្រូវការឈ្មោះអ្នកទទួលផល។

source: A positive amount to transfer is needed.
km: ចំនួនទឹកប្រាក់វិជ្ជមានក្នុងការផ្ទេរគឺចាំបាច់។

source: After this credit transfer the account's balance will be below your credit limit.
km: បន្ទាប់ពីការផ្ទេរប្រាក់នេះសមតុល្យគណនីនឹងស្ថិតនៅក្រោមកំរិតឥណទានរបស់អ្នក។

source: After this credit transfer the account's balance will be below the minimal balance.
km: បន្ទាប់ពីការផ្ទេរប្រាក់នេះសមតុល្យគណនីនឹងទាបជាងសមតុល្យអប្បបរមា។

source: The end-to-end reference cannot contain more than one character.
km: សេចក្តីយោងចប់ដល់ទីបញ្ចប់មិនអាចមានតួអក្សរច្រើនជាងមួយទេ។

source: The maximal line length of %1 character per line is exceeded.
km: ប្រវែងបន្ទាត់អតិបរិមានៃតួអក្សរ %1 ក្នុងមួយជួរត្រូវបានលើស។

source: The purpose can only contain the letters A-Z, spaces and ':?.,-()+ and /
km: គោលបំណងអាចមានតែអក្សរអាអេចចន្លោះនិង ':?, - () + និង /

source: In the purpose only a single line is allowed.
km: ក្នុងគោលបំណងមានតែខ្សែតែមួយប៉ុណ្ណោះដែលត្រូវបានអនុញ្ញាត។

source: A purpose is needed.
km: ត្រូវការគោលបំណង។

source: Beneficiary Name
km: ឈ្មោះអ្នកទទួលផល

source: End-to-end reference
km: សេចក្តីយោងចប់ - ចប់

source: Purpose
km: គោលបំណង

source: Could not load responsible plugin to view this task.
km: មិនអាចផ្ទុកកម្មវិធីជំនួយដែលទទួលខុសត្រូវដើម្បីមើលភារកិច្ចនេះទេ។

# @item the number 0
source: zero
km: សូន្យ

# @item the number 1
source: one
km: មួយ

# @item the number 2
source: two
km: ពីរ

# @item the number 3
source: three
km: បី

# @item the number 4
source: four
km: បួន

# @item the number 5
source: five
km: ប្រាំ

# @item the number 6
source: six
km: ប្រាំមួយ
