Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: Please select the appropriate columns to use, corresponding to your data.
km: សូមជ្រើសរើសជួរឈរដែលសមស្របដើម្បីប្រើ, ត្រូវនឹងទិន្នន័យរបស់អ្នក។

# column containing number field
source: Number
km: ចំនួន

source: Select column containing number field.
km: ជ្រើសជួរឈរដែលមានវាលលេខ។

source: Select column containing date field.
km: ជ្រើសជួរឈរដែលមានវាលកាលបរិច្ឆេទ។

# location of debit column
source: Debit
km: ឥណពន្ធ

source: Select column containing payee or description field.
km: ជ្រើសជួរឈរដែលមានអ្នកបង់ប្រាក់ឬវាលពិពណ៌នា។

source: Select 'Debit/credit' if both columns exist, otherwise select 'Amount'.
km: ជ្រើសរើស 'ឥណពន្ធ / ឥណទាន' ប្រសិនបើមានជួរឈរទាំងពីរបើមិនដូច្នោះទេជ្រើសរើស 'ចំនួនទឹកប្រាក់' ។

# presence of debit/credit columns
source: Debit/credit
km: ឥណពន្ធ / ឥណទាន

source: Select column containing credit field.
km: ជ្រើសរើសជួរឈរដែលមានវាលក្រេឌីត។

# location of amount column
source: Amount
km: ចំនួនទឹកប្រាក់

# column containing number field
source: Category
km: ប្រភេទ

source: Select 'Amount' if only one value column, otherwise select 'Debit/credit'.
km: ជ្រើសរើស 'ចំនួនទឹកប្រាក់' ប្រសិនបើមានជួរឈរតម្លៃតែមួយបើមិនដូច្នេះទេជ្រើសរើសយក 'ឥណពន្ធ / ឥណទាន' ។

# presence of amount column
source: Amount
km: ចំនួនទឹកប្រាក់

source: Select column containing amount field.
km: ជ្រើសជួរឈរដែលមានវាលចំនួនទឹកប្រាក់។

source: Select column containing memo field.
km: ជ្រើសរើសជួរឈរដែលមានវាលអនុសរណៈ។

# column containing payee or description field
source: Payee/Description
km: អ្នកបង់ប្រាក់ / ការពិពណ៌នា

source: Select column containing debit field.
km: ជ្រើសរើសជួរឈរដែលមានវាលឥណពន្ធ។

source: Select column containing category field.
km: ជ្រើសជួរឈរដែលមានវាលប្រភេទ។

# location of credit column
source: Credit
km: ឥណទាន

source: Clear selected column entries
km: សម្អាតធាតុជួរឈរដែលបានជ្រើសរើស

source: Clear
km: សម្អាត

source: Completion Wizard Page
km: ទំព័រអ្នកជំនួយការបញ្ចប់

source: Please select the decimal symbol used in your file. The thousands separator changes automatically. Check that the lines and fields are correctly set. Finally, click Import. If required, a QIF file may then be produced.
km: សូមជ្រើសរើសនិមិត្តសញ្ញាដែលប្រើក្នុងឯកសាររបស់អ្នក។ សញ្ញាបំបែកខ្ទង់ពាន់ផ្លាស់ប្តូរដោយស្វ័យប្រវត្តិ។ ពិនិត្យមើលថាបន្ទាត់និងវាលត្រូវបានកំណត់យ៉ាងត្រឹមត្រូវ។ ចុងក្រោយចុចនាំចូល។ បើចាំបាច់ឯកសារ QIF អាចនឹងត្រូវបានផលិត។

source: Click to select the required decimal symbol, and to check that the selected symbol matches the data.
km: ចុចដើម្បីជ្រើសនិមិត្តសញ្ញាដែលត្រូវការហើយដើម្បីពិនិត្យ ថានិមិត្តសញ្ញាដែលបានជ្រើសរើសត្រូវនឹងទិន្នន័យ។

source: dot (.)
km: ចំណុច (។ )

source: comma (,)
km: ក្បៀស (,)

source: Thousands Symbol
km: និមិត្តសញ្ញារាប់ពាន់

source: Add New Profile
km: បន្ថែមប្រវត្តិរូបថ្មី

source: Please select a profile type and enter a profile name.
km: សូមជ្រើសរើសប្រភេទប្រវត្តិរូបហើយបញ្ចូលឈ្មោះប្រវត្តិរូប។

source: *.csv *.PRN *.txt | CSV Files *|All files
km: * .csv * .PRN * .txt | ឯកសារស៊ីអេសវី * | ឯកសារទាំងអស់

source: <center>Row number %1 does not have the expected number of columns.</center><center>This might not be a problem, but it may be a header line.</center><center>You may accept all similar items, or just this one, or cancel.</center>
km: <center> ចំនួនជួរដេក %1 មិនមានចំនួនជួរឈរដែលរំពឹងទុក។ </center><center> នេះប្រហែលជាមិនមែនជាបញ្ហាទេប៉ុន្តែវាអាចជាបឋមកថា។ </center><center> អ្នកអាចទទួលយកធាតុស្រដៀងគ្នាទាំងអស់ឬគ្រាន់តែរបស់មួយនេះឬបោះបង់។ </center>

source: CSV import
km: ការនាំចូលស៊ីអេសវី

source: Accept All
km: ទទួលយកទាំងអស់

source: Accept This
km: ទទួលយកនេះ

source: <center>An invalid date has been detected during import.</center><center><b>'%1'</b></center>Please check that you have set the correct date format, <center>and start and end lines.</center>
km: <center> កាលបរិច្ឆេទមិនត្រឹមត្រូវត្រូវបានរកឃើញអំឡុងពេលនាំចូល។ </center><center><b> '%1' </b></center> សូមពិនិត្យថាអ្នកបានកំណត់ទ្រង់ទ្រាយកាលបរិច្ឆេទត្រឹមត្រូវគឺ <center> និងការចាប់ផ្តើមនិងបញ្ចប់បន្ទាត់។ </center>

source: Enter debit flag column number
km: បញ្ចូលលេខជួរឈរទង់ឥណពន្ធ

source: An invalid column was entered. Must be between 1 and %1.
km: បានបញ្ចូលជួរឈរមិនត្រឹមត្រូវ។ ត្រូវតែមានចន្លោះពី ១ ដល់ %1 ។

source: <center>The columns selected are invalid.</center>There must an amount or debit and credit fields, plus date and payee fields.
km: <center> ជួរឈរដែលបានជ្រើសមិនត្រឹមត្រូវ។ </center> ត្រូវតែមានចំនួនទឹកប្រាក់ឬវាលឥណពន្ធនិងឥណទានបូករួមនឹងវាលកាលបរិច្ឆេទនិងអ្នកបង់ប្រាក់។

source: <center>You possibly need to check the start and end line settings, or reset 'Skip setup'.</center>
km: <center> អ្នកចាំបាច់ត្រូវពិនិត្យមើលការចាប់ផ្តើមបន្ទាត់បញ្ចប់និងកំណត់ឡើងវិញ 'រំលងការរៀបចំ' ។ </center>

source: <center>On row '%5', the '%1' field contains '%2', and the '%3' field contains '%4'.</center><center>This combination is not valid.</center><center>If you wish for just this zero field to be cleared, click 'Clear this'.</center><center>Or, if you wish for all such zero fields to be cleared, click 'Clear all'.</center><center>Otherwise, click 'Cancel'.</center>
km: <center> នៅជួរ '%5', វាល '%1' មានផ្ទុក '%2', និងវាល '%3' មានផ្ទុក '%4' ។ </center><center> ការរួមបញ្ចូលគ្នានេះមិនមានសុពលភាពទេ។ </center><center> ប្រសិនបើអ្នកចង់អោយវាលសូន្យនេះត្រូវបានលុបសូមចុច 'លុបវា' ។ </center><center> ឬប្រសិនបើអ្នកចង់អោយវាលសូន្យទាំងអស់ត្រូវបានលុបសូមចុច 'ជម្រះទាំងអស់' ។ </center><center> បើមិនដូច្នោះទេចុច 'បោះបង់' ។ </center>

source: CSV invalid field values
km: តម្លៃវាលមិនត្រឹមត្រូវ CSV

source: Clear this
km: ជម្រះនេះ

source: Clear all
km: លុបចេញ​ទាំងអស់

source: <center>The %1 field contains '%2'</center><center>and the %3 field contains '%4'.</center><center>Please choose which you wish to accept.</center>
km: <center> វាល %1 មាន '%2' </center><center> និងវាល %3 មាន '%4' ។ </center><center> សូមជ្រើសរើសអ្វីដែលអ្នកចង់ទទួលយក។ </center>

source: Accept %1
km: ទទួលយក %1

source: The date entry "%1" read from the file cannot be interpreted through the current date format setting of "%2." Pressing 'Continue' will assign today's date to the transaction. Pressing 'Cancel'' will abort the import operation. You can then restart the import and select a different date format.
km: ធាតុកាលបរិច្ឆេទ " %1 " អានពីឯកសារមិនអាចត្រូវបានបកស្រាយតាមរយៈការកំណត់ទ្រង់ទ្រាយកាលបរិច្ឆេទបច្ចុប្បន្ននៃ " %2 ។ " ការចុច 'បន្ត' នឹងកំណត់កាលបរិច្ឆេទថ្ងៃនេះទៅប្រតិបត្តិការ។ ចុច 'បោះបង់' 'នឹងបញ្ឈប់ប្រតិបត្តិការនាំចូល។ បន្ទាប់មកអ្នកអាចចាប់ផ្តើមការនាំចូលឡើងវិញហើយជ្រើសរើសទ្រង់ទ្រាយកាលបរិច្ឆេទផ្សេង។

source: <center>The start line is greater than the end line. </center><center>Please correct your settings.</center>
km: <center> បន្ទាត់ចាប់ផ្តើមគឺធំជាងបន្ទាត់បញ្ចប់។ </center><center> សូមកែតម្រូវការកំណត់របស់អ្នក។ </center>

source: <center>There must an amount or debit and credit fields, plus date and payee fields.</center>
km: <center> ត្រូវតែមានចំនួនទឹកប្រាក់ឬវាលឥណពន្ធនិងឥណទានបូករួមនឹងវាលកាលបរិច្ឆេទនិងអ្នកបង់ប្រាក់។ </center>

source: <center>As you had skipped Setup, the wizard will now return you to the setups.</center>
km: <center> ដូចដែលអ្នកបានរំលងការដំឡើងឥឡូវអ្នកជំនួយការនឹងត្រឡប់អ្នកទៅការរៀបចំ។ </center>

source: QIF Files
km: ឯកសារ QIF

source: Save QIF
km: រក្សាទុក QIF

source: Enter column number of debit/credit code
km: បញ្ចូលលេខជួរនៃលេខឥណពន្ធ / លេខកូដឥណទាន

source: <center>The '<b>%1</b>' field already has this column selected.</center><center>If you wish to copy the Memo data to the Payee field, click 'Yes'.</center>
km: <center> នេះ ' <b> %1 </b> 'បានជ្រើសរើសជួរឈរនេះរួចហើយ។ </center><center> ប្រសិនបើអ្នកចង់ចំលងទិន្នន័យ Memo ទៅក្នុងវាលអ្នកបង់ប្រាក់ចុច 'បាទ / ចាស' ។ </center>

source: <center>The '<b>%1</b>' field already has this column selected.</center><center>Please reselect both entries as necessary.</center>
km: <center> នេះ ' <b> %1 </b> 'បានជ្រើសរើសជួរឈរនេះរួចហើយ។ </center><center> សូមជ្រើសរើសធាតុទាំងពីរជាមុនសិន។ </center>

source: Row number %1 may be a header line, as it has an incomplete set of entries.<center>It may be that the start line is incorrectly set.</center>
km: ចំនួនជួរដេក %1 អាចជាបឋមកថាព្រោះវាមានធាតុបញ្ចូលមិនពេញលេញ។ <center> វាអាចថាខ្សែចាប់ផ្តើមត្រូវបានកំណត់មិនត្រឹមត្រូវ។ </center>

source: <center>The cell in column '%1' on row %2 is empty.</center><center>Please check your selections.</center><center>Continue or Cancel?</center>
km: <center> ក្រឡាក្នុងជួរឈរ '%1' នៅជួរដេក %2 គឺទទេ។ </center><center> សូមពិនិត្យការជ្រើសរើសរបស់អ្នក។ </center><center> បន្តឬបោះបង់? </center>

source: Selections Warning
km: ការព្រមានជម្រើស

source: <center>The selected decimal symbol was not present in column %1,</center><center>- but may now have been added.</center><center>If the <b>decimal</b> symbol displayed does not match your system setting</center><center>your data is unlikely to import correctly.</center><center>Please check your selection.</center>
km: <center> និមិត្តសញ្ញាទសភាគដែលបានជ្រើសមិនមាននៅក្នុងជួរឈរ %1, </center><center> - ប៉ុន្តែឥឡូវនេះអាចត្រូវបានបន្ថែម។ </center><center> បើ <b> ទសភាគ </b> និមិត្តសញ្ញាដែលបានបង្ហាញមិនត្រូវនឹងការកំណត់ប្រព័ន្ធរបស់អ្នកទេ </center><center> ទិន្នន័យរបស់អ្នកទំនងជាមិននាំចូលត្រឹមត្រូវទេ។ </center><center> សូមពិនិត្យការជ្រើសរើសរបស់អ្នក។ </center>

source: <center>The selected decimal symbol ('%1') was not present</center><center>or has produced invalid results in row %2, and possibly more.</center><center>Please try again.</center>
km: <center> និមិត្តសញ្ញាទសភាគដែលបានជ្រើស ('%1') មិនមានទេ </center><center> ឬបានបង្កើតលទ្ធផលមិនត្រឹមត្រូវក្នុងជួរ %2 និងអាចមានច្រើនទៀត។ </center><center> សូម​ព្យាយាម​ម្តង​ទៀត។ </center>

source: Invalid Conversion
km: ការប្រែចិត្តជឿមិនត្រឹមត្រូវ

source: CSV Import Wizard
km: អ្នកជំនួយការនាំចូលស៊ីអេសវី

source: To raise the wizard window, right click in this window.
km: ដើម្បីលើកយកផ្ទាំងកម្មវិធីអ្នកជំនួយការចុច ចុចខាងស្តាំនៅក្នុងផ្ទាំងកម្មវិធីនេះ។

source: CSV...
km: ស៊ីអេសវី ...

# CSV Importer dialog title
source: CSV Importer
km: អ្នកនាំចូលស៊ីអេសវី

source: <center>The '<b>%1</b>' field already has this column selected.</center><center>If you wish to copy the Payee data to the memo field, click 'Yes'.</center>
km: <center> នេះ ' <b> %1 </b> 'បានជ្រើសរើសជួរឈរនេះរួចហើយ។ </center><center> ប្រសិនបើអ្នកចង់ចម្លងទិន្នន័យរបស់អ្នកទទួលប្រាក់ទៅក្នុងអនុសរណៈសូមចុច 'បាទ / ចាស' ។ </center>

source: The '<b>%1</b>' field already has this column selected. <center>Please reselect both entries as necessary.</center>
km: នេះ ' <b> %1 </b> 'បានជ្រើសរើសជួរឈរនេះរួចហើយ។ <center> សូមជ្រើសរើសធាតុទាំងពីរជាមុនសិន។ </center>

source: <center>Field name not recognised.</center> <center>'<b>%1</b>'</center> Please re-enter your column selections.
km: <center> មិនស្គាល់ឈ្មោះវាល។ </center><center> ' <b> %1 </b> ' </center> សូមបញ្ចូលការជ្រើសរើសជួរឈររបស់អ្នកឡើងវិញ។

source: <center>You have cleared the profile name '%1'.</center> <center>If you wish to delete the entry, click 'Delete'.</center> <center>Otherwise, click 'Keep'.</center>
km: <center> អ្នកបានលុបឈ្មោះប្រវត្តិរូប '%1' ។ </center> <center> ប្រសិនបើអ្នកចង់លុបធាតុសូមចុច 'លុប' ។ </center> <center> បើមិនដូច្នោះទេចុច 'រក្សា' ។ </center>

source: Delete or Edit Profile Name
km: លុបឬកែសម្រួលឈ្មោះទម្រង់

source: Keep
km: រក្សា

source: <center>The name you have entered does not exist,</center><center>but you have not elected to add a new profile</center><center>If you wish to add '%1' as a new profile,</center><center> click 'Yes'. Otherwise, click 'No'</center>
km: <center> ឈ្មោះដែលអ្នកបានបញ្ចូលមិនមានទេ </center><center> ប៉ុន្តែអ្នកមិនបានជ្រើសរើសដើម្បីបន្ថែមទម្រង់ថ្មីទេ </center><center> ប្រសិនបើអ្នកចង់បន្ថែម '%1' ជាទម្រង់ថ្មី, </center><center> ចុច 'បាទ / ចាស' ។ បើមិនដូច្នោះទេចុច 'ទេ' </center>

source: Adding profile name.
km: បន្ថែមឈ្មោះប្រវត្តិរូប។

source: <center>You have edited the name of a profile</center><center>from '%1' to '%2'.</center><center>If you wish to accept the new name, click 'Yes'.</center><center>Otherwise, click 'No'</center>
km: <center> អ្នកបានកែឈ្មោះប្រវត្តិរូប </center><center> ពី '%1' ទៅ '%2' ។ </center><center> ប្រសិនបើអ្នកចង់ទទួលយកឈ្មោះថ្មីចុច 'បាទ / ចាស' ។ </center><center> បើមិនដូច្នោះទេចុច 'ទេ' </center>

source: Edit a profile name or create new one.
km: កែឈ្មោះប្រវត្តិរូបឬបង្កើតឈ្មោះថ្មី។

source: <center>If you continue, you will lose any recent profile edits.</center><center>Continue or Cancel?</center>
km: <center> ប្រសិនបើអ្នកបន្តអ្នកនឹងបាត់បង់ការកែប្រែទម្រង់ថ្មីៗ។ </center><center> បន្តឬបោះបង់? </center>

source: Radio button Banking clicked
km: បានចុចប៊ូតុងវិទ្យុធនាគារ

source: Radio button Investment clicked
km: ចុចប៊ូតុងមូលវិនិយោគ

source: <center>The name you have entered does not exist,</center><center>but you have not elected to add a new profile.</center>
km: <center> ឈ្មោះដែលអ្នកបានបញ្ចូលមិនមានទេ </center><center> ប៉ុន្តែអ្នកមិនបានជ្រើសរើសដើម្បីបន្ថែមទម្រង់ថ្មីទេ។ </center>

source: <center>If you wish to add '%1'as a new profile,</center><center> click 'Yes'. Otherwise, click 'No'</center>
km: <center> ប្រសិនបើអ្នកចង់បន្ថែម '%1'as ទម្រង់ថ្មី, </center><center> ចុច 'បាទ / ចាស' ។ បើមិនដូច្នោះទេចុច 'ទេ' </center>

source: Select File
km: ជ្រើសឯកសារ

source: A profile must be selected before selecting a file.
km: ត្រូវជ្រើសរើសប្រវត្តិរូបមុនពេលជ្រើសរើសឯកសារ។

source: Incorrect number or type of fields. Check the field delimiter.
km: ចំនួនឬប្រភេទវាលមិនត្រឹមត្រូវ។ ពិនិត្យអ្នកកំណត់ព្រំដែន។

source: <center>An invalid value has been detected in column %1 on row %2.</center>Please check that you have selected the correct columns.<center>You may accept all similar items, or just this one, or cancel.</center>
km: <center> តម្លៃមិនត្រឹមត្រូវត្រូវបានរកឃើញនៅក្នុងជួរឈរ %1 នៅជួរដេក %2 ។ </center> សូមពិនិត្យមើលថាអ្នកបានជ្រើសរើសជួរឈរត្រឹមត្រូវ។ <center> អ្នកអាចទទួលយកធាតុស្រដៀងគ្នាទាំងអស់ឬគ្រាន់តែរបស់មួយនេះឬបោះបង់។ </center>

source: Import CSV
km: នាំចូលស៊ីអេសវី

source: Make QIF File
km: ធ្វើឯកសារ QIF

source: Import CSV
km: នាំចូលស៊ីអេសវី

source: Exit
km: ចេញ

source: CSVWizard
km: ស៊ីអេសវីអ្នកជំនួយការ

# Noun, the introduction.
source: 1. Start
km: ចាប់ផ្តើម

source: 2. Separators
km: 2. អ្នកបំបែក

source: 3. Banking
km: 3. ធនាគារ

source: 4. Investing
km: ការវិនិយោគ

source: 5. Lines
km: 5. បន្ទាត់

# Noun, the end.
source: 6. Finish
km: 6. បញ្ចប់

source: Intro Wizard Page
km: ទំព័រអ្នកជំនួយការការណែនាំ

source: Click either Banking or Investment. Then select 'Add New Profile' and enter a new name. Then open the file you wish to import, and set up your new parameters. Or, select an existing profile, to use saved settings.
km: ចុចលើធនាគារឬការវិនិយោគ។ បន្ទាប់មកជ្រើស 'បន្ថែមទម្រង់ថ្មី' ហើយបញ្ចូលឈ្មោះថ្មី។ បន្ទាប់មកបើកឯកសារដែលអ្នកចង់នាំចូល ហើយតំឡើងប៉ារ៉ាម៉ែត្រថ្មីរបស់អ្នក។ ឬជ្រើសទម្រង់ដែលមានស្រាប់ដើម្បីប្រើការកំណត់ដែលបានរក្សាទុក។

source: Banking
km: ធនាគារ

source: To add a new profile, enter its name then click Return. Or, select an existing profile. An existing name may be edited, which will produce a new profile.
km: ដើម្បីបន្ថែមទម្រង់ថ្មីបញ្ចូលឈ្មោះរបស់វាបន្ទាប់មកចុចត្រឡប់។ ឬជ្រើសរើសទម្រង់ដែលមានស្រាប់។ ឈ្មោះដែលមានស្រាប់អាចត្រូវបានកែសម្រួលដែលនឹងបង្កើតទម្រង់ថ្មី។

source: Select to bypass profile setup. Only useful if a profile has already been setup.
km: ជ្រើសរើសដើម្បីចៀសវាងការរៀបចំទម្រង់។ មានប្រយោជន៍ប្រសិនបើប្រវត្តិរូបត្រូវបានរៀបចំរួចហើយ។

source: Skip setup
km: រំលងការរៀបចំ

source: Investment Wizard Page
km: ទំព័រអ្នកជំនួយការវិនិយោគ

source: Please select the appropriate columns to use, corresponding to your data. If there is just a single security in the file, enter its name below. Otherwise, select the column for the symbol, and for the description or detail.
km: សូមជ្រើសរើសជួរឈរដែលសមស្របដើម្បីប្រើដែលត្រូវនឹងទិន្នន័យរបស់អ្នក។ ប្រសិនបើវាមានសុវត្ថិភាពតែមួយនៅក្នុងឯកសារសូមបញ្ចូលឈ្មោះរបស់វានៅខាងក្រោម។ បើមិនដូច្នោះទេជ្រើសរើសជួរឈរសម្រាប់និមិត្តសញ្ញានិងសម្រាប់ការពិពណ៌នាឬលម្អិត។

source: or Security Name
km: ឬឈ្មោះសុវត្ថិភាព

source: Filter text
km: ច្រោះអត្ថបទ

source: Select column containing investment type field.
km: ជ្រើសរើសជួរឈរដែលមានប្រភេទប្រភេទវិនិយោគ។

source: Select column containing memo field. More than one column may be entered successively. May also be selected to contain a copy of the type or detail column.
km: ជ្រើសរើសជួរឈរដែលមានវាលអនុសរណៈ។ ជួរឈរច្រើនជាងមួយអាចត្រូវបានបញ្ចូលជាបន្តបន្ទាប់។ អាចត្រូវបានជ្រើសរើសឱ្យមានច្បាប់ចម្លងនៃប្រភេទឬជួរឈរលម្អិត។

source: If a descriptive column contains an activity type, select it here. See also Filter text field.
km: ប្រសិនបើជួរឈរពិពណ៌នាមានប្រភេទសកម្មភាពសូមជ្រើសរើសវានៅទីនេះ។ សូមមើលផងដែរនូវប្រអប់អត្ថបទ។

source: If necessary, select column containing fee. Caution. This might already have been incorporated into the price.
km: បើចាំបាច់ជ្រើសរើសជួរឈរដែលមានថ្លៃឈ្នួល។ ប្រយ័ត្ន។ នេះប្រហែលជាត្រូវបានបញ្ចូលទៅក្នុងតម្លៃ រួចហើយ។

source: Detail
km: ពត៌មានលំអិត

source: If more than one stock is present in the file, and if the stock symbols are shown in one of the columns, select it here.
km: ប្រសិនបើមានភាគហ៊ុនច្រើនជាងមួយមាននៅក្នុងឯកសារនោះ ហើយប្រសិនបើនិមិត្តសញ្ញាស្តុកត្រូវបានបង្ហាញនៅក្នុងជួរឈរមួយនោះ ជ្រើសរើសវានៅទីនេះ។

source: If necessary, select a fraction/multiplier for compatibility between imported and stored prices. For instance, if the import price is in cents but the file is priced in dollars, select 0.01.
km: បើចាំបាច់ជ្រើសរើសប្រភាគ / មេគុណសម្រាប់ភាពឆបគ្នា រវាងតម្លៃនាំចូលនិងរក្សាទុក។ ឧទាហរណ៍ប្រសិនបើតម្លៃនាំចូល គិតជាសេនប៉ុន្តែឯកសារនោះមានតម្លៃជាដុល្លារសូមជ្រើសរើសលេខ 0.01 ។

# verb, Select column containing date field
source: Select column containing date field
km: ជ្រើសជួរឈរដែលមានវាលកាលបរិច្ឆេទ

source: If the Detail column has an activity type prefixed by a standard text, enter the text here. For instance, if a field contains, say, 'type: dividend', enter 'type: '.
km: ប្រសិនបើជួរឈរ Detail មានប្រភេទសកម្មភាពដែលមានបុព្វបទដោយអត្ថបទស្តង់ដារនោះ បញ្ចូលអត្ថបទនៅទីនេះ។ ឧទាហរណ៍ប្រសិនបើវាលមួយមាននិយាយថា 'ប្រភេទ: ភាគលាភ', បញ្ចូល 'ប្រភេទ:' ។

source: Alternatively, if the file contains just a single security, enter its name here. The names are retained and may be selected from the list here.
km: ម៉្យាងវិញទៀតប្រសិនបើឯកសារមានសុវត្ថិភាពតែមួយបញ្ចូលឈ្មោះរបស់វានៅទីនេះ។ ឈ្មោះត្រូវបានរក្សាទុកហើយអាចត្រូវបានជ្រើសរើសពីបញ្ជីនៅទីនេះ។

# column for monetary value
source: Amount
km: ចំនួនទឹកប្រាក់

source: Select column containing quantity field.
km: ជ្រើសជួរឈរដែលមានវាលបរិមាណ។

source: Check box if any fee is a percentage figure rather than a value.
km: ប្រអប់ធីកប្រសិនបើថ្លៃសេវាណាមួយជាតួលេខភាគរយជាជាងតម្លៃ។

# select if fee is a percentage (not value)
source: Fee is Percentage
km: ថ្លៃឈ្នួលជាភាគរយ

# column containing fee field
source: Fee Column
km: ជួរឈរថ្លៃឈ្នួល

source: Select column containing price field.
km: ជ្រើសជួរឈរដែលមានវាលតម្លៃ។

# column containing investment type/action field
source: Type/Action
km: ប្រភេទ / សកម្មភាព

source: Remove security name from selection list. It does not affect the underlying security itself.
km: យកឈ្មោះសុវត្ថិភាពចេញពីបញ្ជីជ្រើសរើស។ វាមិនប៉ះពាល់ដល់សន្តិសុខមូលដ្ឋានទេ។

source: Hide security
km: លាក់សុវត្ថិភាព

source: Clear selected column entries.
km: សម្អាតធាតុជួរឈរដែលបានជ្រើសរើស។

# verb, to clear selected columns
source: Clear
km: ច្បាស់

source: Price Fraction
km: ប្រភាគថ្លៃ

# %1
source: buy
km: ទិញ

# %1
source: sell
km: លក់

# %1
source: repurchase
km: ការទិញមកវិញ

# %1
source: dividend
km: ភាគលាភ

# %1
source: interest
km: ចំណាប់អារម្មណ៍

# %1
source: income
km: ប្រាក់ចំណូល

# %1
source: reinvest
km: វិនិយោគឡើងវិញ

# %1
source: reinv
km: ធ្វើឱ្យប្រសើរឡើង

# %1
source: re-inv
km: អញ្ជើញម្តងទៀត

# %1
source: add
km: បន្ថែម

# %1
source: stock dividend
km: ភាគលាភភាគហ៊ុន

# %1
source: transfer in
km: ផ្ទេរចូល

# %1
source: re-registration in
km: ចុះឈ្មោះឡើងវិញ

# %1
source: journal entry
km: ធាតុទិនានុប្បវត្តិ

# %1
source: remove
km: លុប

# %1
source: check
km: ពិនិត្យ

# %1
source: payment
km: ការទូទាត់

# %1
source: bill payment
km: ការទូទាត់វិក័យប័ត្រ

# %1
source: qualified div
km: div មានលក្ខណៈសម្បត្តិគ្រប់គ្រាន់

# %1
source: foreign tax paid
km: បង់ពន្ធបរទេស

# %1
source: adr mgmt fee
km: កម្រៃ adr mgmt

source: *.csv *.PRN *.txt|CSV Files *|All files
km: * .csv * .PRN * .txt | ឯកសារ CSV * | ឯកសារទាំងអស់

source: <center>The '<b>%1</b>' field already has this column selected.</center><center>If you wish to copy that data to the memo field, click 'Yes'.</center>
km: <center> នេះ ' <b> %1 </b> 'បានជ្រើសរើសជួរឈរនេះរួចហើយ។ </center><center> ប្រសិនបើអ្នកចង់ចម្លងទិន្នន័យនោះទៅក្នុងវាលអនុសរណៈសូមចុច 'បាទ / ចាស' ។ </center>

source: <center>An amount, price, and/or quantity column is missing.</center>Please check your selections.
km: <center> ចំនួន, តម្លៃ, និង / ឬជួរឈរបរិមាណត្រូវបានបាត់។ </center> សូមពិនិត្យការជ្រើសរើសរបស់អ្នក។

source: The quantity, price and amount parameters in the current transaction do not match with the action type. Please select another action type
km: បរិមាណបរិមាណនិងចំនួនទឹកប្រាក់នៅក្នុងប្រតិបត្តិការបច្ចុប្បន្ន មិនត្រូវគ្នានឹងប្រភេទសកម្មភាពទេ។ សូមជ្រើសរើសប្រភេទសកម្មភាពផ្សេងទៀត

source: Enter the name of the Brokerage or Checking Account used for the transfer of funds:
km: បញ្ចូលឈ្មោះគណនីមូលប្បទានប័ត្រឬគណនីមូលប្បទានប័ត្រដែលត្រូវបានប្រើសម្រាប់ការផ្ទេរប្រាក់៖

source: <center>The columns selected are invalid. </center>There must an amount or quantity fields, symbol or security name, plus date and type field.<center>You possibly need to check the start and end line settings, or reset 'Skip setup'.</center>
km: <center> ជួរឈរដែលបានជ្រើសមិនត្រឹមត្រូវ។ </center> ត្រូវតែមានចំនួនទឹកប្រាក់ឬវាលបរិមាណនិមិត្តសញ្ញាឬឈ្មោះសុវត្ថិភាពបូករួមទាំងកាលបរិច្ឆេទនិងប្រភេទប្រភេទ។ <center> អ្នកចាំបាច់ត្រូវពិនិត្យមើលការចាប់ផ្តើមបន្ទាត់បញ្ចប់និងកំណត់ឡើងវិញ 'រំលងការរៀបចំ' ។ </center>

source: <center>buyList of transaction types was not found.</center><center>Check existence of correct resource file - 'csvimporterrc'.</center>
km: <center> ប្រភេទបញ្ជីទិញមិនត្រូវបានរកឃើញទេ។ </center><center> ពិនិត្យមើលអត្ថិភាពនៃឯកសារធនធានត្រឹមត្រូវ - 'csvimporterrc' ។ </center>

source: <center>For a brokerage item, enter the column</center><center>containing the Payee or Detail:</center>
km: <center> សម្រាប់ទំនិញឈ្មួញកណ្តាលបញ្ចូលជួរឈរ </center><center> មានផ្ទុកប្រាក់ឈ្នួលឬព័ត៌មានលំអិត៖ </center>

source: <center>No Detail field specified</center><center>and no security name supplied.</center><center>(Please check the parameters given)</center>
km: <center> គ្មានវាលលម្អិតបានបញ្ជាក់ </center><center> ហើយគ្មានឈ្មោះសុវត្ថិភាពណាមួយត្រូវបានផ្គត់ផ្គង់ទេ។ </center><center> (សូមពិនិត្យមើលប៉ារ៉ាម៉ែត្រដែលបានផ្តល់ជូន) </center>

source: <center>The transaction below has an unrecognised type or action.</center><center>Please select an appropriate entry, if available.</center><center>Otherwise, click Cancel to abort.</center>
km: <center> ប្រតិបត្តិការខាងក្រោមមានប្រភេទឬសកម្មភាពដែលមិនបានទទួលស្គាល់។ </center><center> សូមជ្រើសរើសធាតុដែលសមរម្យប្រសិនបើមាន។ </center><center> បើមិនដូច្នោះទេសូមចុចបោះបង់ដើម្បីបញ្ឈប់។ </center>

source: <center>Please select the decimal symbol used in your file. </center>
km: <center> សូមជ្រើសរើសនិមិត្តសញ្ញាដែលប្រើក្នុងឯកសាររបស់អ្នក។ </center>

source: Investment import
km: ការនាំចូលការវិនិយោគ

source: <center>Please enter a name or symbol for the security. </center>
km: <center> សូមបញ្ចូលឈ្មោះឬនិមិត្តសញ្ញាដើម្បីសុវត្ថិភាព។ </center>

source: The Security Name, and Date and Type columns are needed.<center>Also, the Price, Quantity and Amount columns.</center><center>Please try again.</center>
km: ឈ្មោះសុវត្ថិភាពនិងកាលបរិច្ឆេទនិងប្រភេទជួរឈរត្រូវការជាចាំបាច់។ <center> ដូចគ្នានេះផងដែរជួរតម្លៃបរិមាណនិងចំនួនទឹកប្រាក់។ </center><center> សូម​ព្យាយាម​ម្តង​ទៀត។ </center>

source: Brokerage Item
km: ធាតុឈ្មួញកណ្តាល

source: Parameters
km: ប៉ារ៉ាម៉ែត្រ

source: <center>Field name not recognised.</center><center>'<b>%1</b>'</center>Please re-enter your column selections.
km: <center> មិនស្គាល់ឈ្មោះវាល។ </center><center> ' <b> %1 </b> ' </center> សូមបញ្ចូលការជ្រើសរើសជួរឈររបស់អ្នកឡើងវិញ។
