Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: GPG encryption settings
km: ការកំណត់ការអ៊ិនគ្រីប GPG

source: This page allows you to set the parameters for encrypted file storage of your <b>KMyMoney</b> data based on <b>GPG</b>.<p> Access to the settings is disabled if <b>GPG</b> could not be detected on your system. In this case, please make sure that <b>GPG</b> is working properly for the current user.<p> The <i>additional recovery encryption</i> is only accessible, if the necessary key for <b>kmymoney-recover@users.sourceforge.net</b> with id 0x8AFDDC8E is found in your keyring.
km: ទំព័រនេះអនុញ្ញាតឱ្យអ្នកកំណត់ប៉ារ៉ាម៉ែត្រសម្រាប់ការផ្ទុកឯកសារដែលបានអ៊ិនគ្រីបរបស់អ្នក <b> ខេម៉ីម៉ាន់នី </b> ទិន្នន័យផ្អែកលើ <b> ជីភីអេស </b> ។ <p> ការចូលប្រើការកំណត់ត្រូវបានបិទប្រសិនបើ <b> ជីភីអេស </b> មិនអាចត្រូវបានរកឃើញនៅលើប្រព័ន្ធរបស់អ្នកទេ។ ក្នុងករណីនេះសូមប្រាកដថា <b> ជីភីអេស </b> កំពុងធ្វើការយ៉ាងត្រឹមត្រូវសម្រាប់អ្នកប្រើបច្ចុប្បន្ន។ <p> <i> ការអ៊ិនគ្រីបការងើបឡើងវិញបន្ថែម </i> អាចចូលដំណើរការបានតែបើកូនសោចាំបាច់សម្រាប់ <b> kmymoney-recover@users.sourceforge.net </b> ជាមួយលេខសម្គាល់ 0x8AFDDC8E ត្រូវបានរកឃើញនៅក្នុងលេខកូដរបស់អ្នក។

source: Use GPG encryption
km: ប្រើការអ៊ិនគ្រីប GPG

source: GPG encryption
km: ការអ៊ិនគ្រីប GPG

source: Your key
km: កូនសោរបស់អ្នក

source: This combo box lists all the secret keys you have in your keyring. Select the one you want to use for encryption when saving to a file.
km: ប្រអប់បន្សំនេះរាយរាល់កូនសោសម្ងាត់ទាំងអស់ដែលអ្នកមានក្នុងការវាយបញ្ចូលរបស់អ្នក។ ជ្រើសរើសយកមួយដែលអ្នកចង់ប្រើសម្រាប់អ៊ិនគ្រីបនៅពេលរក្សាទុកទៅឯកសារ។

source: Enter the id of the key you want to use for data encryption. This can either be an e-mail address or the hexadecimal key id. In case of the key id do not forget the leading 0x.
km: បញ្ចូលលេខសម្គាល់នៃកូនសោដែលអ្នកចង់ប្រើសម្រាប់ការអ៊ិនគ្រីបទិន្នន័យ។ នេះអាចជាអាសយដ្ឋានអ៊ីមែលឬលេខសម្គាល់លេខគោលដប់ប្រាំមួយ។ ក្នុងករណីលេខសម្គាល់សំខាន់កុំភ្លេច 0x នាំមុខ។

source: Additional keys
km: កូនសោបន្ថែម

source: This symbol denotes, if the key for the given user id has been found in your keyring. It is green when found, dark otherwise.
km: និមិត្តសញ្ញានេះបញ្ជាក់ថាប្រសិនបើលេខកូដសម្រាប់លេខសម្គាល់អ្នកប្រើដែលបានផ្តល់ឱ្យត្រូវបានរកឃើញនៅក្នុងពាក្យគន្លឹះរបស់អ្នក។ វាមានពណ៌បៃតងនៅពេលរកឃើញបើមិនដូច្នេះទេងងឹត។

source: This symbol denotes, if the KMyMoney recovery key has been found in your keyring. It is green when found, dark otherwise.
km: និមិត្តសញ្ញានេះមានន័យថាប្រសិនបើលេខកូដសង្រ្គោះរបស់ខេម៉ីយនត្រូវបានរកឃើញនៅក្នុងការវាយរបស់អ្នក។ វាមានពណ៌បៃតងនៅពេលរកឃើញបើមិនដូច្នេះទេងងឹត។

source: Recover Key available in keyring
km: រកឃើញគ្រាប់ចុចដែលមាននៅក្នុង keyring

source: You can specify to encrypt the data also with the KMyMoney recover key. Only the core KMyMoney developers are in posession of the respective private key required to read back such encrypted data.<p> This mechanism is provided for the case that you have lost your key and cannot access your data anymore. With this option activated, the KMyMoney developers can decrypt the data and supply you with it in a readable form. Please be prepared, that you have to answer a few detailed questions about the contents of your data before we will send it out.
km: អ្នកអាចបញ្ជាក់ដើម្បីអ៊ិនគ្រីបទិន្នន័យផងដែរដោយប្រើលេខកូដសង្គ្រោះគីខេមីយនី។ មានតែអ្នកអភិវឌ្ឍន៍ KMyMoney ស្នូលប៉ុណ្ណោះដែលមាននៅក្នុងលេខកូដកូនសោឯកជនរៀងៗខ្លួនដែលត្រូវការដើម្បីអានទិន្នន័យដែលបានអ៊ិនគ្រីបត្រឡប់មកវិញ។ <p> យន្តការនេះត្រូវបានផ្តល់ជូនក្នុងករណីដែលអ្នកបាត់កូនសោហើយមិនអាចចូលប្រើទិន្នន័យរបស់អ្នកតទៅទៀតបាន។ ជាមួយនឹងជម្រើសនេះត្រូវបានធ្វើឱ្យសកម្មអ្នកអភិវឌ្ឍន៍ KMyMoney អាចឌិគ្រីបទិន្នន័យនិងផ្គត់ផ្គង់អ្នកជាមួយនឹងទម្រង់ដែលអាចអានបាន។ សូមត្រៀមថាអ្នកត្រូវឆ្លើយសំនួរលំអិតមួយចំនួនអំពីខ្លឹមសារនៃទិន្នន័យរបស់អ្នកមុននឹងយើងនឹងផ្ញើវាចេញ។

source: Also encrypt with KMyMoney's recover key
km: អ៊ិនគ្រីបជាមួយកូនសោសង្គ្រោះរបស់ខេម៉ីនីផងដែរ

# Move item up
source: &Up
km: ឡើងលើ

source: Move selected item up
km: ផ្លាស់ទីធាតុដែលបានជ្រើសឡើងលើ

source: Use this to move the selected item up by one position in the list.
km: ប្រើវាដើម្បីផ្លាស់ទីធាតុដែលបានជ្រើសឡើងលើមួយទីតាំងក្នុងបញ្ជី។

source: &Down
km: ចុះក្រោម

source: Move selected item down
km: ផ្លាស់ទីធាតុដែលបានជ្រើសចុះក្រោម

source: Use this to move the selected item down by one position in the list.
km: ប្រើវាដើម្បីផ្លាស់ទីធាតុដែលបានជ្រើសចុះក្រោមមួយទីតាំងនៅក្នុងបញ្ជី។

source: Homepage Settings
km: ការកំណត់គេហទំព័រ

# @action move item up
source: Up
km: ឡើងលើ

# @action move item down
source: Down
km: ចុះក្រោម

source: Selected entries are shown on the home page of the application.<p> Use the buttons and checkboxes to customize the layout of the home page.
km: ធាតុដែលបានជ្រើសរើសត្រូវបានបង្ហាញនៅលើគេហទំព័រនៃពាក្យសុំ។ <p> ប្រើប៊ូតុងនិងប្រអប់ធីកដើម្បីប្តូរប្លង់ទំព័រដើម។

source: Homepage/Summary page font scaling
km: គេហទំព័រ / សង្ខេបការធ្វើមាត្រដ្ឋានពុម្ពអក្សរទំព័រ

source: Percentage of default font size:
km: ភាគរយនៃទំហំពុម្ពអក្សរលំនាំដើម៖

source: Remember font size when leaving the program if manually changed with mouse-wheel
km: ចងចាំទំហំពុម្ពអក្សរនៅពេលចាកចេញពីកម្មវិធីប្រសិនបើផ្លាស់ប្តូរដោយដៃដោយកង់ម៉ៅ

source: Account information display
km: បង្ហាញព័ត៌មានគណនី

source: Show Account Limit Information
km: បង្ហាញព័ត៌មានដែនកំណត់គណនី

source: Show balance-status of mapped online accounts
km: បង្ហាញស្ថានភាពសមតុល្យនៃគណនីតាមអ៊ីនធឺណិត

source: Show number of not marked transactions per account [!M]
km: បង្ហាញចំនួនប្រតិបត្តិការដែលមិនបានសម្គាល់ក្នុងគណនី [! ម៉ែល]

source: Show number of cleared transactions per account [C]
km: បង្ហាញចំនួនប្រតិបត្តិការបានទូទាត់ក្នុងមួយគណនី [C]

source: Show number of not reconciled (not marked + cleared) transactions per account [!R]
km: បង្ហាញចំនួនប្រតិបត្តិការដែលមិនបានផ្សះផ្សា (មិនបានគូសបញ្ជាក់ + លុបចោល) ក្នុងមួយគណនី [! R]

source: Register settings
km: ចុះឈ្មោះការកំណត់

# @title The way in which items will be displayed
source: Display
km: បង្ហាញ

source: Show a grid in the register
km: បង្ហាញក្រឡាចត្រង្គនៅក្នុងការចុះឈ្មោះ

source: Show all register entries in full detail
km: បង្ហាញធាតុចុះឈ្មោះទាំងអស់លម្អិត

source: Use the ledger lens
km: ប្រើកែវយួរដៃ

source: Using the ledger lens shows the details for the transaction that has focus in the ledger. Usually, when using the transaction form, only a one line summary is displayed for each transaction as the details are shown in the form.
km: ការប្រើកែវយួរដៃបង្ហាញពីព័ត៌មានលម្អិតសម្រាប់ប្រតិបត្តិការដែលផ្តោតលើសៀវភៅដឹកនាំ។ ជាធម្មតានៅពេលប្រើទម្រង់ប្រតិបត្តិការមានតែសេចក្តីសង្ខេបមួយខ្សែប៉ុណ្ណោះដែលត្រូវបានបង្ហាញសម្រាប់ប្រតិបត្តិការនីមួយៗនៅពេលដែលព័ត៌មានលម្អិតត្រូវបានបង្ហាញជាទម្រង់។

source: Show transaction form
km: បង្ហាញទម្រង់បែបបទប្រតិបត្តិការ

source: Always show a No. field
km: បង្ហាញវាលលេខជានិច្ច

source: Show group header between transactions
km: បង្ហាញបឋមកថាក្រុមរវាងប្រតិបត្តិការ

source: Draws a larger header above each group of transactions. The grouping depends on the current sort order.
km: គូរបឋមកថាធំជាងក្រុមប្រតិបត្តិការនីមួយៗ។ ការដាក់ក្រុមអាស្រ័យលើលំដាប់តម្រៀបបច្ចុប្បន្ន។

source: Show header for the previous and current fiscal year
km: បង្ហាញចំណងជើងសម្រាប់ឆ្នាំសារពើពន្ធមុននិងបច្ចុប្បន្ន

source: If a planned transaction is overdue, today's date is used by default as the posting date. With this option, the originally planned date is used instead.
km: ប្រសិនបើប្រតិបត្ដិការដែលបានគ្រោងទុកហួសកាលកំណត់កាលបរិច្ឆេទថ្ងៃនេះត្រូវបានប្រើតាមលំនាំដើមជាកាលបរិច្ឆេទប្រកាស។ ជាមួយនឹងជម្រើសនេះកាលបរិច្ឆេទដែលបានគ្រោងទុកដំបូងត្រូវបានប្រើជំនួសវិញ។

source: Display overdue schedules with planned date
km: បង្ហាញកាលវិភាគហួសកាលកំណត់ជាមួយនឹងកាលបរិច្ឆេទដែលបានគ្រោងទុក

source: Sorting
km: តម្រៀប

source: Normal view
km: ទិដ្ឋភាពធម្មតា

source: Reconciliation view
km: ទស្សនៈផ្សះផ្សា

source: Search view
km: ទិដ្ឋភាពស្វែងរក

source: Use the <i>left</i> and <i>right</i> buttons to add and remove sort options. Use the <i>up</i> and <i>down</i> buttons to modify the sort order. Double-Click a selected entry to toggle the sort order between <i>ascending</i> and <i>descending</i>.
km: ប្រើ <i> ឆ្វេង </i> និង <i> ត្រឹមត្រូវ </i> ប៊ូតុងដើម្បីបន្ថែមនិងយកជម្រើសតម្រៀបចេញ។ ប្រើ <i> ឡើង </i> និង <i> ចុះ </i> ប៊ូតុងដើម្បីកែប្រែលំដាប់តម្រៀប។ ចុចទ្វេដងលើធាតុដែលបានជ្រើសរើសដើម្បីបិទបើកលំដាប់តម្រៀបរវាង <i> ឡើង </i> និង <i> ចុះ </i>

source: Data entry
km: ការ​បញ្ចូល​ទិន្នន័យ

source: Auto increment check number
km: លេខឆែកបង្កើនស្វ័យប្រវត្តិកម្ម

source: Keep changes when selecting a different transaction/split
km: រក្សាការផ្លាស់ប្តូរនៅពេលជ្រើសរើសប្រតិបត្តិការ / បំបែកផ្សេងៗគ្នា

source: Use Enter to move between fields
km: ប្រើ Enter ដើម្បីផ្លាស់ទីរវាងវាល

source: Match names from start
km: ឈ្មោះផ្គូផ្គងតាំងពីដំបូង

source: Mark this option, if you always want to match names e.g. for payees from the start. If unset, any substring is matched.
km: សម្គាល់ជម្រើសនេះប្រសិនបើអ្នកតែងតែចង់ផ្គូរផ្គងឈ្មោះឧ។ សម្រាប់អ្នកបើកប្រាក់ខែតាំងពីដំបូង។ ប្រសិនបើមិនបានកំណត់ខ្សែអក្សរណាមួយត្រូវបានផ្គូរផ្គង។

source: Automatic reconciliation
km: ការផ្សះផ្សាដោយស្វ័យប្រវត្តិ

source: After entering the reconciliation data automatically detect the transactions that match that data (in some cases it might be not possible to do that).
km: បន្ទាប់ពីបញ្ចូលទិន្នន័យការផ្សះផ្សាររកឃើញប្រតិបត្តិការដែលត្រូវគ្នានឹងទិន្នន័យដោយស្វ័យប្រវត្តិ (ក្នុងករណីខ្លះវាមិនអាចធ្វើបានទេ) ។

source: Initial cursor position within the date field
km: ទីតាំងទស្សន៍ទ្រនិចដំបូងក្នុងចន្លោះកាលបរិច្ឆេទ

source: Day
km: ថ្ងៃ

source: Default reconciliation state
km: រដ្ឋផ្សះផ្សាលំនាំដើម

source: Default reconciliation state for transactions entered during reconciliation of an account
km: ស្ថានភាពការផ្សះផ្សាតាមលំនាំដើមសម្រាប់ប្រតិបត្តិការដែលបានបញ្ចូលក្នុងអំឡុងពេលការផ្សះផ្សាគណនី

source: Not reconciled
km: មិនផ្សះផ្សា

source: Reconciled
km: ផ្សះផ្សាឡើងវិញ

source: Autofill
km: បំពេញស្វ័យប្រវត្តិ

source: No Autofill
km: គ្មានការបំពេញស្វ័យប្រវត្តិទេ

source: Do not auto-fill transaction data at all.
km: កុំបំពេញទិន្នន័យប្រតិបត្តិការដោយស្វ័យប្រវត្តិ។

source: Same transaction if amount differs less than
km: ប្រតិបត្តិការដូចគ្នាប្រសិនបើចំនួនខុសគ្នាតិចជាង

source: Collect all transactions for the given payee. Treat all transactions that refer to the same category and have an amount with +/- X % as identical. If more than one transaction is found, a list of them is presented to the user. Selecting 0% will list all transactions.
km: ប្រមូលរាល់ប្រតិបត្តិការសម្រាប់អ្នកទទួលប្រាក់ដែលបានផ្តល់ឱ្យ។ ព្យាបាលរាល់ប្រតិបត្តិការទាំងអស់ដែលសំដៅទៅលើប្រភេទតែមួយនិងមានចំនួនទឹកប្រាក់ជាមួយ +/- X % ដូចគ្នា។ ប្រសិនបើរកឃើញប្រតិបត្តិការច្រើនជាងមួយត្រូវបានរកឃើញបញ្ជីរបស់ពួកគេត្រូវបានបង្ហាញដល់អ្នកប្រើប្រាស់។ ការជ្រើសរើស 0 % នឹងរាយរាល់ប្រតិបត្តិការទាំងអស់។

source: Two transactions are usually treated identical for autofill, if they refer the same accounts. They are treated as different transactions though, when their amount varies by more than the percentage given here.
km: ប្រតិបត្តិការពីរត្រូវបានចាត់ទុកជាធម្មតាសម្រាប់ការបំពេញស្វ័យប្រវត្តិប្រសិនបើពួកគេយោងលើគណនីតែមួយ។ ពួកគេត្រូវបានគេចាត់ទុកជាប្រតិបតិ្តការផ្សេងៗគ្នានៅពេលដែលចំនួនរបស់ពួកគេប្រែប្រួលលើសពីភាគរយដែលបានផ្តល់នៅទីនេះ។

# Same transaction if amount differs less than percent.
source: percent.
km: ភាគរយ។

source: With previously most often used transaction for the payee
km: ជាមួយនឹងប្រតិបត្តិការដែលត្រូវបានប្រើញឹកញាប់បំផុតសម្រាប់អ្នកបង់ប្រាក់

source: The data of the last transaction assigned to the category used most often for this payee is autofilled into the transaction editor.
km: ទិន្នន័យនៃប្រតិបត្តិការចុងក្រោយដែលត្រូវបានកំណត់ទៅប្រភេទដែលត្រូវបានប្រើញឹកញាប់បំផុតសម្រាប់អ្នកទទួលប្រាក់នេះត្រូវបានបញ្ចូលទៅក្នុងកម្មវិធីនិពន្ធប្រតិបត្តិការ។

source: Use memos from previous transaction
km: ប្រើអនុសរណៈពីប្រតិបត្តិការមុន ៗ

source: If this option is checked the memos from the previous transaction will be used otherwise the memos will not be considered when the transaction is autofilled.
km: ប្រសិនបើជម្រើសនេះត្រូវបានធីកអនុសរណៈពីប្រតិបត្តិការមុននឹងត្រូវបានប្រើបើមិនដូច្នេះទេអនុសរណៈនឹងមិនត្រូវបានពិចារណានៅពេលប្រតិបត្តិការត្រូវបានបំពេញដោយស្វ័យប្រវត្តិ។

source: Match transactions within days
km: ប្រតិបត្តិការប្រតិបត្តិការក្នុងរយៈពេលប៉ុន្មានថ្ងៃ

source: Search for matching transactions within the range of the posting date of the imported transaction +/- the number of given days.
km: ស្វែងរកប្រតិបត្តិការដែលត្រូវគ្នានៅក្នុងជួរនៃកាលបរិច្ឆេទប្រកាសនៃប្រតិបត្តិការដែលបាននាំចូល +/- ចំនួនថ្ងៃដែលបានផ្តល់។

source: Ask for a new payee's default category
km: ស្នើសុំប្រភេទលំនាំដើមរបស់អ្នកបង់ប្រាក់ថ្មី

source: Whenever a new payee is detected during import of a statement, the user will be asked to assign a default category for this user when this option is selected.
km: នៅពេលដែលរកឃើញអ្នកបង់ប្រាក់ថ្មីកំឡុងពេលនាំចូលរបាយការណ៍អ្នកប្រើនឹងត្រូវបានស្នើសុំឱ្យចាត់ថ្នាក់ប្រភេទលំនាំដើមសម្រាប់អ្នកប្រើប្រាស់នេះនៅពេលជម្រើសនេះត្រូវបានជ្រើសរើស។

source: File %1 does not exist
km: មិនមានឯកសារ %1 ទេ

source: it is not a plain file
km: វាមិនមែនជាឯកសារធម្មតាទេ

source: it is not readable
km: វាមិនអាចអានបានទេ

source: it is empty
km: វាទទេ

source: There is a problem with file %1
km: មានបញ្ហាជាមួយឯកសារ %1

source: Report Settings
km: ការកំណត់របាយការណ៍

source: Maximum number of legend items to display
km: ចំនួនអតិបរមានៃធាតុតាងដើម្បីបង្ហាញ

source: maximum number of items in diagram legends
km: ចំនួនធាតុអតិបរមានៅក្នុងរឿងព្រេងដ្យាក្រាម

source: Charts line width
km: ទទឹងបន្ទាត់គំនូសតាង

source: Line width for diagrams, in pixels
km: ទទឹងបន្ទាត់សម្រាប់ដ្យាក្រាមគិតជាភីកសែល

source: Charts palette
km: ក្ដារលាយគំនូសតាង

# @item KDChart color palette
source: Default
km: លំនាំដើម

# @item KDChart color palette
source: Rainbow
km: ឥន្ធនូ

# @item KDChart color palette
source: Subdued
km: បង្ក្រាប

source: Default CSS file
km: ឯកសារ CSS លំនាំដើម

source: default style sheet
km: សន្លឹករចនាប័ទ្មលំនាំដើម

source: *.css|CSS files *|All files
km: * .css | ឯកសារ CSS * | ឯកសារទាំងអស់

source: Schedule Settings
km: ការកំណត់កាលវិភាគ

source: Startup options
km: ជម្រើសចាប់ផ្តើម

source: Check schedules on startup
km: ពិនិត្យកាលវិភាគនៅពេលចាប់ផ្តើម

source: Enter transactions this number of days in advance
km: បញ្ចូលប្រតិបត្តិការចំនួនថ្ងៃនេះជាមុន

source: Processing Days
km: ថ្ងៃដំណើរការ

source: Use holiday calendar for region
km: ប្រើប្រតិទិនឈប់សម្រាកសម្រាប់តំបន់

# @item no holiday region selected
source: (None)
km: (គ្មាន)

source: Number of days to preview schedules in ledger
km: ចំនួនថ្ងៃដើម្បីមើលកាលវិភាគជាមុននៅក្នុងសៀវភៅណែនាំ

source: <center>Processing schedule for %1.</center>
km: <center> កាលវិភាគដំណើរការសម្រាប់ %1 ។ </center>

source: <center>Check number <b>%1</b> has already been used in account <b>%2</b>.</center><center>Do you want to replace it with the next available number?</center>
km: <center> ពិនិត្យលេខ <b> %1 </b> ត្រូវបានប្រើរួចហើយនៅក្នុងគណនី <b> %2 </b> ។ </center><center> តើអ្នកចង់ជំនួសវាដោយលេខដែលមានបន្ទាប់ទេ? </center>

source: Duplicate number
km: លេខស្ទួន

source: This transaction has more than two splits and is originally based on a different currency (%1). Using this account to modify the transaction may result in rounding errors. Do you want to continue?
km: ប្រតិបត្តិការនេះមានច្រើនជាងពីរពុះហើយដើមឡើយផ្អែកលើរូបិយប័ណ្ណផ្សេងគ្នា (%1) ។ ការប្រើប្រាស់គណនីនេះដើម្បីកែប្រែប្រតិបត្តិការអាចនាំឱ្យមានកំហុសជុំ។ តើអ្នកចង់បន្តទេ?

source: At least one of the selected transactions has more than two splits and is originally based on a different currency (%1). Using this account to modify the transactions may result in rounding errors. Do you want to continue?
km: យ៉ាងហោចណាស់ប្រតិបត្តិការមួយក្នុងចំណោមប្រតិបត្តិការដែលបានជ្រើសរើសមានច្រើនជាងពីរពុះហើយដើមឡើយផ្អែកលើរូបិយប័ណ្ណខុសគ្នា (%1) ។ ការប្រើប្រាស់គណនីនេះដើម្បីកែប្រែប្រតិបត្តិការអាចបណ្តាលឱ្យមានកំហុសជុំ។ តើអ្នកចង់បន្តទេ?

source: Check number <b>%1</b> has already been used in account <b>%2</b>.<center>Do you want to replace it with the next available number?</center>
km: ពិនិត្យលេខ <b> %1 </b> ត្រូវបានប្រើរួចហើយនៅក្នុងគណនី <b> %2 </b> ។ <center> តើអ្នកចង់ជំនួសវាដោយលេខដែលមានបន្ទាប់ទេ? </center>

source: Storing transactions
km: រក្សាទុកប្រតិបត្តិការ

source: &Enter
km: បញ្ចូល

source: Accepts the entered data and stores it
km: ទទួលយកទិន្នន័យដែលបានបញ្ចូលហើយរក្សាទុកវា

source: Use this to enter the transaction into the ledger.
km: ប្រើវាដើម្បីបញ្ចូលប្រតិបត្តិការទៅក្នុងសៀវភៅដៃ។

source: &Schedule
km: កាលវិភាគ

source: Accepts the entered data and stores it as schedule
km: ទទួលយកទិន្នន័យដែលបានបញ្ចូលហើយរក្សាទុកវាតាមកាលវិភាគ

source: Use this to schedule the transaction for later entry into the ledger.
km: ប្រើវាដើម្បីកំណត់ពេលប្រតិបត្តិការសម្រាប់ការចូលលើកក្រោយៗទៀត។

source: The transaction you are about to enter has a post date in the future.<br/><br/>Do you want to enter it in the ledger or add it to the schedules?
km: ប្រតិបត្តិការដែលអ្នករៀបនឹងចូលមានកាលបរិច្ឆេទប្រកាសនាពេលអនាគត។ <br/><br/> តើអ្នកចង់បញ្ចូលវាទៅក្នុងសៀវភៅកត់ឬបញ្ចូលវាទៅក្នុងកាលវិភាគទេ?

# Dialog caption for 'Enter or schedule' dialog
source: Enter or schedule?
km: បញ្ចូលឬរៀបចំកាលវិភាគ?

source: The balance of account <b>%1</b> dropped below the warning balance of %2.
km: សមតុល្យគណនី <b> %1 </b> បានធ្លាក់ចុះខាងក្រោមតុល្យភាពនៃការព្រមានរបស់ %2 ។

source: The balance of account <b>%1</b> dropped below the minimum balance of %2.
km: សមតុល្យគណនី <b> %1 </b> ទម្លាក់នៅខាងក្រោមសមតុល្យអប្បបរមារបស់ %2 ។

source: The balance of account <b>%1</b> dropped below the maximum credit warning limit of %2.
km: សមតុល្យគណនី <b> %1 </b> បានធ្លាក់ចុះនៅក្រោមដែនកំណត់ព្រមានឥណទានអតិបរមានៃ %2 ។

source: The balance of account <b>%1</b> dropped below the maximum credit limit of %2.
km: សមតុល្យគណនី <b> %1 </b> បានធ្លាក់ចុះក្រោមចំនួនកំណត់ឥណទានអតិបរមានៃ %2 ។

source: Payer/Receiver
km: អ្នកបង់ប្រាក់ / អ្នកទទួល

source: Category/Account
km: ប្រភេទ / គណនី

source: Transfer from
km: ផ្ទេរពី

source: Transfer to
km: ផ្ទេរ​ទៅ

source: Select autofill transaction
km: ជ្រើសរើសប្រតិបត្តិការបំពេញស្វ័យប្រវត្តិ

source: Cannot enter transaction with postdate prior to account's opening date.
km: មិនអាចបញ្ចូលប្រតិបត្តិការជាមួយកាលបរិច្ឆេទក្រោយថ្ងៃបើកគណនីបានទេ។

source: Do you want to replace memo<p><i>%1</i></p>with memo<p><i>%2</i></p>in the other split?
km: តើអ្នកចង់ជំនួសអនុស្សរណៈទេ <p><i> %1 </i></p> ជាមួយអនុសរណៈ <p><i> %2 </i></p> នៅក្នុងការបំបែកផ្សេងទៀត?

source: Copy memo
km: ចម្លងអនុស្សរណៈ

source: First transaction does not match requirement for matching
km: ប្រតិបត្តិការដំបូងមិនត្រូវនឹងតម្រូវការសម្រាប់ការផ្គូផ្គង

source: Splits for %1 have conflicting values (%2,%3)
km: ការបែងចែកសំរាប់ %1 មានតំលៃផ្ទុយគ្នា (%2, %3)

source: The transaction dates are one day apart. Do you want to match them anyway?
km: កាលបរិច្ឆេទប្រតិបត្តិការគឺនៅដាច់ពីគ្នាមួយថ្ងៃ។ ទោះយ៉ាងណាអ្នកចង់ផ្គូផ្គងពួកវាដែរឬទេ?

source: Unable to match all splits (%1)
km: មិនអាចផ្គូផ្គងបំបែកទាំងអស់ (%1)

source: This is the consistency check log, use the context menu to copy or save it.
km: នេះគឺជាកំណត់ហេតុពិនិត្យភាពស្ថិតស្ថេរប្រើម៉ឺនុយបរិបទដើម្បីចម្លងឬរក្សាទុកវា។

source: Copy to clipboard
km: ចម្លងទៅក្ដារតម្បៀតខ្ទាស់

source: Save to file
km: រក្សាទុកទៅឯកសារ

source: Open database...
km: បើកមូលដ្ឋានទិន្នន័យ ...

source: Save as database...
km: រក្សាទុកជាឃ្លាំងទិន្នន័យ ...

source: Backup...
km: បម្រុងទុក ...

source: Statement file...
km: ឯកសាររបាយការណ៍ ...

source: Account Template...
km: គំរូគណនី ...

source: Personal Data...
km: ទិន្នន័យ​ផ្ទាល់ខ្លួន...

source: Dump Memory
km: ចាក់អង្គចងចាំចោល

source: File-Information...
km: ឯកសារ - ព័ត៌មាន ...

source: Find transaction...
km: ស្វែងរកប្រតិបត្តិការ ...

source: Show Transaction Detail
km: បង្ហាញលម្អិតអំពីប្រតិបត្តិការ

source: Hide reconciled transactions
km: លាក់ប្រតិបត្តិការផ្សះផ្សា

source: Hide unused categories
km: លាក់ប្រភេទដែលមិនបានប្រើ

source: Show all accounts
km: បង្ហាញគណនីទាំងអស់

source: New institution...
km: ស្ថាប័នថ្មី ...

source: Edit institution...
km: កែស្ថាប័ន ...

source: Delete institution...
km: លុបស្ថាប័ន ...

source: New account...
km: គណនី​ថ្មី...

source: Open ledger
km: សៀវភៅបើកចំហ

source: Reconcile...
km: ផ្សះផ្សា ...

# Finish reconciliation
source: Finish
km: បញ្ចប់

source: Postpone reconciliation
km: ពន្យារពេលការផ្សះផ្សា

source: Edit account...
km: កែគណនី ...

source: Delete account...
km: លុប​គណនី...

source: Close account
km: បិទគណនី

source: Reopen account
km: បើកគណនីឡើងវិញ

source: Transaction report
km: របាយការណ៍ប្រតិបត្តិការ

source: Show balance chart...
km: បង្ហាញតារាងតុល្យការ ...

source: Map to online account...
km: ផែនទីទៅគណនីអនឡាញ ...

source: Unmap account...
km: ផ្ដាច់គណនី ...

# Update online accounts menu
source: Update
km: ធ្វើបច្ចុប្បន្នភាព

source: Update account...
km: ធ្វើបច្ចុប្បន្នភាពគណនី ...

source: Update all accounts...
km: ធ្វើបច្ចុប្បន្នភាពគណនីទាំងអស់ ...

source: New credit transfer
km: ការផ្ទេរឥណទានថ្មី

source: New category...
km: ប្រភេទថ្មី ...

source: Edit category...
km: កែសម្រួលប្រភេទ ...

source: Delete category...
km: លុបប្រភេទ ...

source: QIF Profile Editor...
km: កម្មវិធីនិពន្ធពត៌មាន QIF ...

source: Currencies...
km: រូបិយប័ណ្ណ ...

source: Prices...
km: តម្លៃ ...

source: Update Stock and Currency Prices...
km: ធ្វើបច្ចុប្បន្នភាពភាគហ៊ុននិងតម្លៃរូបិយប័ណ្ណ ...

source: Consistency Check
km: ពិនិត្យភាពស្ថិតស្ថេរ

source: Performance-Test
km: ការអនុវត្ត - តេស្ត

source: Generate Database SQL
km: បង្កើតមូលដ្ឋានទិន្នន័យ SQL

source: Calculator...
km: ម៉ាស៊ីនគិតលេខ ...

source: Enable all messages
km: បើកសារទាំងអស់

source: KDE language settings...
km: ការកំណត់ភាសារបស់ KDE ...

source: &Show tip of the day
km: បង្ហាញចុងម៉ោង

# New transaction button
source: New
km: ថ្មី

# Edit transaction button
source: Edit
km: កែសម្រួល

# Enter transaction
source: Enter
km: បញ្ចូល

# Edit split button
source: Edit splits
km: កែសម្រួលការបំបែក

# Cancel transaction edit
source: Cancel
km: បោះបង់

# Delete transaction
source: Delete
km: លុប

# Duplicate transaction
source: Duplicate
km: ស្ទួន

# Button text for match transaction
source: Match
km: ការប្រកួត

# Accept 'imported' and 'matched' transaction
source: Accept
km: ព្រមទទួល

# Toggle reconciliation flag
source: Toggle
km: បិទ / បើក

# Mark transaction cleared
source: Cleared
km: ជម្រះ

# Mark transaction reconciled
source: Reconciled
km: ផ្សះផ្សាឡើងវិញ

# Mark transaction not reconciled
source: Not reconciled
km: មិនផ្សះផ្សា

# Select all transactions
source: Select all
km: ជ្រើស​យក​ទាំងអស់

source: Go to account
km: ចូលទៅគណនី

source: Go to payee
km: ទៅអ្នកបង់ប្រាក់

source: Create scheduled transaction...
km: បង្កើតប្រតិបត្តិការតាមកាលវិភាគ ...

source: Assign next number
km: កំណត់លេខបន្ទាប់

# Combine transactions
source: Combine
km: ផ្សំ

source: Copy splits
km: ចំលងពុះ

source: New investment...
km: ការវិនិយោគថ្មី ...

source: Edit investment...
km: កែសម្រួលការវិនិយោគ ...

source: Delete investment...
km: លុបការវិនិយោគ ...

source: Online price update...
km: បច្ចុប្បន្នភាពតម្លៃតាមអ៊ីនធឺណិត ...

source: Manual price update...
km: បច្ចុប្បន្នភាពតម្លៃដោយដៃ ...

source: New scheduled transaction
km: ប្រតិបត្តិការថ្មីដែលបានគ្រោងទុក

source: Edit scheduled transaction
km: កែសម្រួលប្រតិបត្តិការតាមកាលវិភាគ

source: Delete scheduled transaction
km: លុបប្រតិបត្តិការតាមកាលវិភាគ

source: Duplicate scheduled transaction
km: ប្រតិបត្តិការដែលបានគ្រោងទុកស្ទួន

source: Enter next transaction...
km: បញ្ចូលប្រតិបត្តិការបន្ទាប់ ...

source: Skip next transaction...
km: រំលងប្រតិបត្តិការបន្ទាប់ ...

source: New payee
km: អ្នកបង់ប្រាក់ថ្មី

source: Rename payee
km: ប្តូរឈ្មោះអ្នកបង់ប្រាក់

source: Delete payee
km: លុបអ្នកបង់ប្រាក់

source: Merge payees
km: បញ្ចូលអ្នកបង់ប្រាក់

source: New tag
km: ស្លាកថ្មី

source: Rename tag
km: ប្តូរឈ្មោះស្លាក

source: Delete tag
km: លុបស្លាក

source: New budget
km: ថវិកាថ្មី

source: Rename budget
km: ប្តូរឈ្មោះថវិកា

source: Delete budget
km: លុបថវិកា

source: Copy budget
km: ចម្លងថវិកា

source: Change budget year
km: ផ្លាស់ប្តូរឆ្នាំថវិកា

source: Budget based on forecast
km: ថវិកាផ្អែកលើការព្យាករណ៍

source: Rename currency
km: ប្តូរឈ្មោះរូបិយប័ណ្ណ

source: New price...
km: តម្លៃថ្មី ...

source: Edit price...
km: កែសម្រួលតម្លៃ ...

source: Online Price Update...
km: បច្ចុប្បន្នភាពតម្លៃតាមអ៊ីនធឺណិត ...

source: Delete price...
km: លុបតំលៃ ...
