Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: Unable to setup online parameters for account '%1'
km: មិនអាចតំឡើងប៉ារ៉ាម៉ែត្រលើបណ្តាញសម្រាប់គណនី '%1'

source: Do you really want to remove the mapping of account <b>%1</b> to an online account? Depending on the details of the online banking method used, this action cannot be reverted.
km: តើអ្នកពិតជាចង់លុបចោលផែនទីគណនី <b> %1 </b> ទៅគណនីអនឡាញ? ដោយផ្អែកលើព័ត៌មានលំអិតនៃវិធីធនាគារតាមអ៊ិនធរណេតសកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ។

source: Remove mapping to online account
km: យកការគូសផែនទីទៅគណនីលើអ៊ីនធឺណិត

source: Unable to unmap account from online account: %1
km: មិនអាចបង្រួមគណនីពីគណនីតាមអ៊ិនធឺរណែតបានទេ: %1

source: (Brokerage)
km: (ឈ្មួញជើងសា)

source: You try to map a brokerage account to an online account. This is usually not advisable. In general, the investment account should be mapped to the online account. Please cancel if you intended to map the investment account, continue otherwise
km: អ្នកព្យាយាមគូសផែនទីគណនីឈ្មួញកណ្តាលទៅគណនីអនឡាញ។ នេះជាធម្មតាមិនត្រូវបានណែនាំទេ។ ជាទូទៅគណនីវិនិយោគគួរតែត្រូវបានបញ្ចូលទៅក្នុងគណនីតាមអ៊ីនធឺណិត។ សូមបោះបង់ប្រសិនបើអ្នកមានបំណងគូសផែនទីគណនីវិនិយោគសូមបន្តបើមិនដូច្នេះទេ

source: Mapping brokerage account
km: គូសផែនទីគណនីឈ្មួញកណ្តាល

source: Select online banking plugin
km: ជ្រើសរើសកម្មវិធីជំនួយធនាគារតាមអ៊ីនធឺណិត

source: Unable to map account to online account: %1
km: មិនអាចគូសផែនទីគណនីទៅគណនីអនឡាញទេ៖ %1

source: &Institution
km: ស្ថាប័ន

source: &Account
km: គណនី

source: &Category
km: ប្រភេទ

source: &Transaction
km: ប្រតិបត្តិការ

source: Mark transaction as...
km: សម្គាល់ប្រតិបត្តិការថាជា ...

source: Mark transaction
km: សម្គាល់ប្រតិបត្តិការ

source: T&ools
km: ឧបករណ៍

source: Account options
km: ជម្រើសគណនី

source: Category options
km: ជម្រើសប្រភេទ

source: Institution options
km: ជម្រើសស្ថាប័ន

source: Payee options
km: ជម្រើសអ្នកបង់ប្រាក់

source: Tag options
km: ជម្រើសស្លាក

source: Budget options
km: ជម្រើសថវិកា

source: Investment options
km: ជម្រើសវិនិយោគ

source: Scheduled transactions options
km: ជម្រើសប្រតិបត្តិការដែលបានគ្រោងទុក

source: Transaction options
km: ជម្រើសប្រតិបត្តិការ

source: Move transaction to...
km: ផ្លាស់ទីប្រតិបត្តិការទៅ ...

source: Select account
km: ជ្រើសរើសគណនី

source: Currency options
km: ជម្រើសរូបិយប័ណ្ណ

source: Price options
km: ជម្រើសតម្លៃ

source: Credit transfer options
km: ជម្រើសផ្ទេរប្រាក់

source: Main Toolbar
km: របារឧបករណ៍មេ

source: Checking
km: ពិនិត្យ

source: Savings
km: ការសន្សំ

source: Credit Card
km: កាត​ឥណទាន

source: Cash
km: សាច់ប្រាក់

source: Loan
km: ប្រាក់កម្ចី

source: Certificate of Deposit
km: វិញ្ញាបនប័ត្រនៃការដាក់ប្រាក់

source: Investment
km: ការវិនិយោគ

source: Money Market
km: ផ្សារប្រាក់

source: Investment Loan
km: ប្រាក់កម្ចីវិនិយោគ

source: Equity
km: សមធម៌

source: &New Schedule...
km: កាលវិភាគថ្មី ...

source: Create a new schedule.
km: បង្កើតកាលវិភាគថ្មី។

source: Use this to create a new schedule.
km: ប្រើវាដើម្បីបង្កើតកាលវិភាគថ្មី។

source: &Filter
km: ត្រង

source: Filter out accounts
km: ច្រោះគណនី

source: Use this to filter out accounts
km: ប្រើវាដើម្បីច្រោះគណនី

source: Preferred accounts
km: គណនីដែលចូលចិត្ត

source: Payment accounts
km: គណនីទូទាត់

source: Favorite reports
km: របាយការណ៍ដែលខ្ញុំចូលចិត្ត

source: Forecast (schedule)
km: ការព្យាករណ៍ (កាលវិភាគ)

source: Net worth forecast
km: ការព្យាករណ៍តម្លៃសុទ្ធ

source: Forecast (history)
km: ការព្យាករណ៍ (ប្រវត្តិសាស្រ្ត)

source: Assets and Liabilities
km: ទ្រព្យសម្បត្តិនិងបំណុល

source: Budget
km: ថវិកា

source: CashFlow
km: លំហូរ​សាច់ប្រាក់

# Reconciliation state 'Not reconciled'
source: Not reconciled
km: មិនផ្សះផ្សា

# Reconciliation state 'Cleared'
source: Cleared
km: ជម្រះ

# Reconciliation state 'Reconciled'
source: Reconciled
km: ផ្សះផ្សាឡើងវិញ

# Reconciliation state 'Frozen'
source: Frozen
km: កក

# Unknown reconciliation state
source: Unknown
km: មិនស្គាល់

# Go to next page of the wizard
source: &Next
km: បន្ទាប់

source: Loading %1...
km: កំពុងផ្ទុក %1 ...

source: Compiled with the following settings:
km: ចងក្រងជាមួយការកំណត់ដូចខាងក្រោម៖

source: KMyMoney, the Personal Finance Manager for KDE. Please consider contributing to this project with code and/or suggestions.
km: KMyMoney ដែលជាអ្នកគ្រប់គ្រងហិរញ្ញវត្ថុផ្ទាល់ខ្លួនរបស់ KDE ។ សូមពិចារណាចូលរួមចំណែកជាមួយគម្រោងនេះដោយមានលេខកូដនិង / ឬសំណូមពរ។

source: (c) 2000-2017 The KMyMoney development team
km: (គ) ២០០០-២០១៧ ក្រុមអភិវឌ្ឍន៍ខេអិមមីនី

source: Initial idea, much initial source code, Project admin
km: គំនិតដំបូងកូដប្រភពដើមច្រើនអ្នកគ្រប់គ្រងគម្រោង

source: Thomas Baumgart
km: ថូម៉ាស Baumgart

source: Core engine, Release Manager, Project admin
km: ម៉ាស៊ីនស្នូលប្រធានការដោះលែងគម្រោងគ្រប់គ្រង

source: Forecast, Reports
km: ការព្យាករណ៍, របាយការណ៍

source: Cristian Oneț
km: គ្រីស្ទីន Oneț

source: Developer
km: អ្នកអភិវឌ្ឍន៍

source: Christian Dávid
km: គ្រីស្ទសាសនាដាវីដ

source: Ace Jones
km: អាត់ចូន

source: Reporting logic, OFX Import
km: ការរាយការណ៍តក្កវិជ្ជាការនាំចូល OFX

source: Database backend, maintainer stable branch
km: ផ្នែកខាងក្រោយនៃប្រព័ន្ធទិន្នន័យសាខាមានស្ថេរភាព

source: Felix Rodriguez
km: ហ្វីលីច Rodriguez

source: Project Admin
km: រដ្ឋបាលគំរោង

source: John C
km: ចនស៊ី

source: Database backend
km: កម្មវិធីខាងក្រោយមូលដ្ឋានទិន្នន័យ

source: Initial investment support
km: ការគាំទ្រការវិនិយោគដំបូង

source: Javier Campos Morales
km: លោក Javier Campos សីលធម៌

source: Developer & Artist
km: អ្នកអភិវឌ្ឍន៍អារីស្តូត

source: Robert Wadley
km: រ៉ូបឺតវ៉ាដលី

source: Icons & splash screen
km: អេក្រង់ Iconssplash

source: Patches and port to kde4
km: បំណះនិងច្រកទៅ kde4

source: Wolfgang Rohdewald
km: វ៉ូហ្គោហ្គោរ៉ូដឌែល

source: Patches
km: បំណះ

source: Marko Käning
km: ម៉ាកហ្គូកូននីង

source: Patches, packaging and KF5-CI for OS X
km: បំណះការវេចខ្ចប់និង KF5-CI សំរាប់ប្រព័ន្ធ OS X

source: Allan Anderson ✝
km: អាឡិនអាន់ឌឺសុន✝

source: CSV import/export
km: នាំចូល / នាំចេញស៊ីអេសវី

source: Documentation and user support
km: ឯកសារនិងការគាំទ្រអ្នកប្រើប្រាស់

source: language to be used
km: ភាសាដែលត្រូវប្រើ

source: do not open last used file
km: កុំបើកឯកសារដែលបានប្រើចុងក្រោយ

source: enable performance timers
km: បើកដំណើរការកម្មវិធីកំណត់ពេលដំណើរការ

source: do not globally catch uncaught exceptions
km: កុំចាប់យកករណីលើកលែងជាសកល

source: turn on program traces
km: បើកដានកម្មវិធី

source: dump the names of all defined KAction objects to stdout and quit
km: បោះបង់ឈ្មោះរបស់វត្ថុ KAction ដែលបានកំណត់ទាំងអស់ឱ្យនៅជាប់និងឈប់

source: file to open
km: បើកឯកសារ

source: The monetary decimal symbol is not correctly set in the KDE System Settings module Country/Region & Language. Please set it to a reasonable value and start KMyMoney again.
km: និមិត្តសញ្ញាទសភាគរូបិយវត្ថុមិនត្រូវបានកំណត់យ៉ាងត្រឹមត្រូវនៅក្នុងម៉ូឌុលកំណត់ប្រព័ន្ធរបស់ប្រទេស / តំបន់ភាសា។ សូមកំណត់វាឱ្យសមនឹងតម្លៃហើយចាប់ផ្តើម KMyMoney ម្តងទៀត។

source: Invalid settings
km: ការកំណត់មិនត្រឹមត្រូវ

source: Uncaught error. Please report the details to the developers
km: កំហុសមិនអាចយល់បាន។ សូមរាយការណ៍ព័ត៌មានលម្អិតទៅអ្នកអភិវឌ្ឍន៍

source: %1 in file %2 line %3
km: %1 ក្នុងឯកសារ %2 line %3

source: Another instance of KMyMoney is already running. Do you want to quit?
km: ឧទាហរណ៍មួយទៀតរបស់ខេអិមមីនីកំពុងដំណើរការរួចហើយ។ តើអ្នកចង់លាឈប់ទេ?

# Column heading for category in tax report
source: Tax
km: ពន្ធ

# Column heading for VAT category
source: VAT
km: អាករ

source: Total Balance
km: សមតុល្យសរុប

source: Total Value
km: តម្លៃសរុប

source: Favorites
km: ចំណូលចិត្ត

source: Asset accounts
km: គណនីទ្រព្យ

source: Liability accounts
km: គណនេយ្យភាពទទួលខុសត្រូវ

source: Income categories
km: ប្រភេទប្រាក់ចំណូល

source: Expense categories
km: ប្រភេទចំណាយ

source: Equity accounts
km: គណនីសមធម៌

source: Accounts with no institution assigned
km: គណនីដែលគ្មានស្ថាប័នត្រូវបានកំណត់

source: Information to find issues.
km: ព័ត៌មានដើម្បីរកបញ្ហា។

source: Information stored for provability.
km: ព័ត៌មានត្រូវបានរក្សាទុកសម្រាប់ភាពអាចជឿទុកចិត្តបាន។

source: Informative message without certain significance.
km: សារផ្តល់ព័ត៌មានដោយគ្មានសារៈសំខាន់។

source: Warning message.
km: សារព្រមាន។

source: Origin
km: ប្រភពដើម

source: Action
km: សកម្មភាព

source: Destination
km: ទិសដៅ

source: Not able to display this job.
km: មិនអាចបង្ហាញការងារនេះទេ។

source: Could not find a plugin to display this job or it does not contain any data.
km: មិនអាចរកកម្មវិធីជំនួយដើម្បីបង្ហាញការងារនេះឬវាមិនមានទិន្នន័យទេ។

source: Job is being processed at the moment.
km: ការងារកំពុងត្រូវបានដំណើរការនៅពេលនេះ។

# Arg 1 is a date/time
source: This job was accepted by the bank on %1.
km: ការងារនេះត្រូវបានទទួលយកដោយធនាគារនៅលើ %1 ។

# Arg 1 is a date/time
source: Sending this job failed (tried on %1).
km: ការផ្ញើការងារនេះបានបរាជ័យ (ព្យាយាមលើ %1) ។

source: Sending this job was manually aborted.
km: ការបញ្ជូនការងារនេះត្រូវបានបញ្ឈប់ដោយដៃ។

# Arg 1 is a date/time
source: The bank rejected this job on %1.
km: ធនាគារបានបដិសេធការងារនេះនៅលើ %1 ។

# Arg 1 is a date/time
source: The bank accepted this job on %1.
km: ធនាគារបានទទួលយកការងារនេះនៅលើ %1 ។

source: This job needs further editing and cannot be sent therefore.
km: ការងារនេះត្រូវការការកែសម្រួលបន្ថែមទៀតហើយដូច្នេះមិនអាចត្រូវបានផ្ញើទេ។

source: This job is ready for sending.
km: ការងារនេះរួចរាល់សម្រាប់ការផ្ញើ។

source: The plugin to show this information could not be found.
km: កម្មវិធីជំនួយដើម្បីបង្ហាញព័ត៌មាននេះមិនអាចរកឃើញទេ។

source: Account %1 contains an opening balance. Please use KMyMoney version 0.8 or later and earlier than version 0.9 to correct the problem.
km: គណនី %1 មានសមតុល្យបើក។ សូមប្រើ KMyMoney ជំនាន់ ០.៨ រឺខ្ពស់ជាងនេះនិងលឿនជាងជំនាន់ ០.៩ ដើម្បីកែបញ្ហា។

# Brokerage (suffix for account names)
source: Brokerage
km: ឈ្មួញកណ្តាល

# Unknown account type
source: Unknown
km: មិនស្គាល់

source: Cannot remove transaction that references a closed account.
km: មិនអាចលុបចោលប្រតិបត្តិការដែលយោងតាមគណនីដែលបានបិទទេ។

source: * Problem with account '%1'
km: * មានបញ្ហាជាមួយគណនី '%1'

source: * Loop detected between this account and account '%1'.
km: * រង្វិលជុំត្រូវបានរកឃើញរវាងគណនីនេះនិងគណនី '%1' ។

source: Reparenting account '%2' to top level account '%1'.
km: លេចចេញគណនី '%2' ទៅគណនីលំដាប់កំពូល '%1' ។

source: * Parent account '%1' belongs to a different group.
km: * គណនីមេ '%1' ជាកម្មសិទ្ធិរបស់ក្រុមផ្សេង។

source: New parent account is the top level account '%1'.
km: គណនីមេថ្មីគឺជាគណនីកម្រិតខ្ពស់ '%1' ។

source: * Parent account '%1' does not contain '%2' as sub-account.
km: * គណនីមេ '%1' មិនមាន '%2' ជាគណនីរង។

source: * The parent with id %1 does not exist anymore.
km: * ឪពុកម្តាយដែលមានលេខសម្គាល់ %1 មិនមានទៀតទេ។

source: * Child account with id %1 does not exist anymore.
km: * គណនីកុមារដែលមានលេខសម្គាល់ %1 មិនមានទៀតទេ។

source: The child account list will be reconstructed.
km: បញ្ជីគណនីកុមារនឹងត្រូវបង្កើតឡើងវិញ។

source: * The payee with id %1 referenced by the loan does not exist anymore.
km: * អ្នកបង់ប្រាក់ដែលមានលេខសម្គាល់ %1 ដែលត្រូវបានយោងដោយប្រាក់កម្ចីមិនមានទៀតទេ។

source: The payee will be removed.
km: អ្នកបង់ប្រាក់នឹងត្រូវដកចេញ។

source: * Older versions of KMyMoney stored an OFX password for this account in cleartext.
km: * KMyMoney ជំនាន់ចាស់បានរក្សាទុកលេខសំងាត់ OFX សំរាប់គណនីនេះ។

source: Please open it in the account editor (Account/Edit account) once and press OK.
km: សូមបើកវានៅក្នុងកម្មវិធីកែគណនី (គណនី / កែគណនី) ហើយចុចយល់ព្រម។

source: This will store the password in the KDE wallet and remove the cleartext version.
km: វានឹងទុកលេខសំងាត់នៅក្នុងកាបូបរបស់ KDE ហើយលុបចោលនូវឃ្លាដែលលុបចោល។

source: * Unable to update account data in engine.
km: * មិនអាចធ្វើបច្ចុប្បន្នភាពទិន្នន័យគណនីនៅក្នុងម៉ាស៊ីន។

source: * Reconstructing the child lists for
km: * រៀបចំបញ្ជីឈ្មោះកុមារឡើងវិញ

source: * Unable to update account data for account %1 in engine
km: * មិនអាចធ្វើបច្ចុប្បន្នភាពទិន្នន័យគណនីសម្រាប់គណនី %1 នៅក្នុងម៉ាស៊ីន

source: * Payee %1 recreated with fixed id
km: * អ្នកទទួលប្រាក់ %1 បង្កើតឡើងវិញជាមួយលេខសម្គាល់ថេរ

source: * transaction '%1' has no splits.
km: * ប្រតិបត្តិការ '%1' មិនមានការបែងចែកទេ។

source: * Payee id updated in split of transaction '%1'.
km: * លេខសម្គាល់អ្នកបង់ប្រាក់បានធ្វើបច្ចុប្បន្នភាពនៅក្នុងការបំបែកប្រតិបត្តិការ '%1' ។

source: * Opening date of Account '%1' cannot be changed to support transaction '%2' post date.
km: * កាលបរិច្ឆេទបើកគណនី '%1' មិនអាចផ្លាស់ប្តូរដើម្បីគាំទ្រប្រតិបត្តិការកាលបរិច្ឆេទ '%2' ទេ។

source: * Transaction '%1' post date '%2' is older than opening date '%4' of account '%3'.
km: * ប្រតិបត្តិការ '%1' កាលបរិច្ឆេទប្រកាស '%2' ចាស់ជាងកាលបរិច្ឆេទបើក '%4' នៃគណនី '%3' ។

source: Account opening date updated.
km: កាលបរិច្ឆេទបើកគណនីត្រូវបានធ្វើបច្ចុប្បន្នភាព។

# Finance
source: * shares set to value in split of transaction '%1'.
km: * ភាគហ៊ុនត្រូវបានកំណត់តម្លៃនៅក្នុងការបែងចែកប្រតិបត្តិការ '%1' ។

# Finance
source: * value set to shares in split of transaction '%1'.
km: * កំណត់តម្លៃទៅជាភាគហ៊ុនក្នុងការបំបែកប្រតិបត្តិការ '%1' ។

source: * Split %2 in transaction '%1' contains a reference to invalid account %3. Please fix manually.
km: * បំបែក %2 ក្នុងប្រតិបត្តិការ '%1' មានឯកសារយោងទៅគណនីមិនត្រឹមត្រូវ %3 ។ សូមជួសជុលដោយដៃ។

source: * action marked as interest in split of transaction '%1'.
km: * សកម្មភាពត្រូវបានសម្គាល់ថាជាចំណាប់អារម្មណ៍ក្នុងការបំបែកប្រតិបត្តិការ '%1' ។

source: * Transaction '%1' has an invalid post date.
km: * ប្រតិបត្តិការ '%1' មានកាលបរិច្ឆេទប្រកាសមិនត្រឹមត្រូវ។

source: The post date was updated to '%1'.
km: កាលបរិច្ឆេទប្រកាសត្រូវបានធ្វើបច្ចុប្បន្នភាពទៅ '%1' ។

source: * Transaction '%1' has a post date '%2' before one of the referenced account's opening date.
km: * ប្រតិបត្តិការ '%1' មានកាលបរិច្ឆេទប្រកាស '%2' មុនកាលបរិច្ឆេទមួយនៃកាលបរិច្ឆេទបើកគណនីដែលបានយោង។

source: Referenced accounts: %1
km: គណនីយោង៖ %1

source: The post date was not updated to '%1'.
km: កាលបរិច្ឆេទប្រកាសមិនត្រូវបានធ្វើបច្ចុប្បន្នភាពទៅ '%1' ។

source: * Payee id updated in split of schedule '%1'.
km: * លេខសម្គាល់អ្នកបង់ប្រាក់ត្រូវបានធ្វើបច្ចុប្បន្នភាពក្នុងការបំបែកកាលវិភាគ '%1' ។

# Finance
source: * Split in scheduled transaction '%1' contained value != 0 and shares == 0.
km: * ពុះក្នុងប្រតិបត្តិការដែលបានកំណត់ពេល '%1' មានផ្ទុកតំលៃ! = ០ និងភាគហ៊ុន == ០ ។

# Finance
source: Shares set to value.
km: ភាគហ៊ុនកំណត់ទៅតម្លៃ។

source: * Removed bankid from split in scheduled transaction '%1'.
km: * យកធនាគារចេញពីការបំបែកនៅក្នុងប្រតិបត្តិការដែលបានកំណត់ពេល '%1' ។

# Finance
source: * shares set to value in split in schedule '%1'.
km: * ភាគហ៊ុនត្រូវបានកំណត់ជាតម្លៃបំបែកជាកាលវិភាគ '%1' ។

# Finance
source: * value set to shares in split in schedule '%1'.
km: * កំណត់តម្លៃទៅជាចំណែកចែកចេញជាកាល '%1' ។

source: * Split %2 in schedule '%1' contains a reference to invalid account %3. Please fix manually.
km: * បំបែក %2 តាមកាលវិភាគ '%1' មានឯកសារយោងទៅគណនីមិនត្រឹមត្រូវ %3 ។ សូមជួសជុលដោយដៃ។

source: * Payee id updated in report '%1'.
km: * លេខសម្គាល់អ្នកបង់ប្រាក់ត្រូវបានធ្វើបច្ចុប្បន្នភាពនៅក្នុងរបាយការណ៍ '%1' ។

source: * Payee '%1' removed.
km: * អ្នកបង់ប្រាក់ '%1' ត្រូវបានដកចេញ។

source: * Potential problem with investments/currencies
km: * បញ្ហាដែលអាចកើតមានជាមួយការវិនិយោគ / រូបិយប័ណ្ណ

source: * The account '%1' in currency '%2' has no price set for the opening date '%3'.
km: * គណនី '%1' ជារូបិយប័ណ្ណ '%2' មិនមានកំណត់តម្លៃសម្រាប់កាលបរិច្ឆេទបើក '%3' ទេ។

source: Please enter a price for the currency on or before the opening date.
km: សូមបញ្ចូលតម្លៃសម្រាប់រូបិយប័ណ្ណនៅឬមុនកាលបរិច្ឆេទបើក។

source: * The investment '%1' has no price set for the opening date '%2'.
km: * ការវិនិយោគ '%1' មិនមានតម្លៃកំណត់សម្រាប់កាលបរិច្ឆេទបើក '%2' ទេ។

source: Please enter a price for the investment on or before the opening date.
km: សូមបញ្ចូលតម្លៃសម្រាប់ការវិនិយោគនៅឬមុនកាលបរិច្ឆេទបើក។

source: * Problem with budget '%1'
km: * មានបញ្ហាជាមួយថវិកា '%1'

source: * The account with id %1 referenced by the budget does not exist anymore.
km: * គណនីដែលមានលេខសំងាត់ %1 ដែលត្រូវបានយោងដោយថវិកាមិនមានទៀតទេ។

source: The account reference will be removed.
km: ឯកសារយោងគណនីនឹងត្រូវដកចេញ។

source: Finished: data is consistent.
km: បញ្ចប់៖ ទិន្នន័យមានភាពស៊ីសង្វាក់គ្នា។

source: %1 problem corrected.
km: បានកែបញ្ហា %1 ។

source: %1 problem still present.
km: បញ្ហា %1 នៅតែមាន។

source: Finished: %1 %2
km: បញ្ចប់៖ %1 %2

source: Opening Balances
km: សមតុល្យបើក

# Frequency of schedule
source: Any
km: ណាមួយ

# Frequency of schedule
source: Once
km: ម្តង

# Frequency of schedule
source: Daily
km: រាល់ថ្ងៃ

# Frequency of schedule
source: Weekly
km: ប្រចាំសប្តាហ៍

# Frequency of schedule
source: Fortnightly
km: រៀងរាល់ពីរសប្តាហ៍

# Frequency of schedule
source: Every other week
km: រៀងរាល់សប្តាហ៍ផ្សេងទៀត

# Frequency of schedule
source: Every half month
km: រៀងរាល់កន្លះខែម្តង

# Frequency of schedule
source: Every three weeks
km: រៀងរាល់បីសប្តាហ៍ម្តង

# Frequency of schedule
source: Every four weeks
km: រៀងរាល់បួនសប្តាហ៍ម្តង

# Frequency of schedule
source: Every thirty days
km: រៀងរាល់សាមសិបថ្ងៃ

# Frequency of schedule
source: Monthly
km: ប្រចាំខែ

# Frequency of schedule
source: Every eight weeks
km: រៀងរាល់ប្រាំបីសប្តាហ៍

# Frequency of schedule
source: Every two months
km: រៀងរាល់ពីរខែម្តង

# Frequency of schedule
source: Every three months
km: រៀងរាល់បីខែម្តង

# Frequency of schedule
source: Quarterly
km: ប្រចាំត្រីមាស

# Frequency of schedule
source: Every four months
km: រៀងរាល់បួនខែម្តង

# Frequency of schedule
source: Twice yearly
km: ពីរដងក្នុងមួយឆ្នាំ

# Frequency of schedule
source: Yearly
km: ប្រចាំឆ្នាំ

# Frequency of schedule
source: Every other year
km: រៀងរាល់ឆ្នាំផ្សេងទៀត

# Schedule occurrence period
source: Any
km: ណាមួយ

# Schedule occurrence period
source: Once
km: ម្តង

# Schedule occurrence period
source: Day
km: ថ្ងៃ

# Schedule occurrence period
source: Week
km: សប្តាហ៍

# Schedule occurrence period
source: Half-month
km: កន្លះខែ

# Schedule occurrence period
source: Month
km: ខែ

# Schedule occurrence period
source: Year
km: ឆ្នាំ

# Scheduled transaction type
source: Bill
km: វិក័យប័ត្រ

# Scheduled transaction type
source: Deposit
km: ការដាក់ប្រាក់

# Scheduled transaction type
source: Transfer
km: ផ្ទេរ

# Scheduled transaction type
source: Loan payment
km: ការទូទាត់ប្រាក់កម្ចី

# Scheduled transaction type
source: Unknown
km: មិនស្គាល់

# Scheduled Transaction payment type
source: Direct debit
km: ឥណពន្ធផ្ទាល់

# Scheduled Transaction payment type
source: Direct deposit
km: ការ​ដាក់​ប្រាក់​ដោយ​ផ្ទាល់

# Scheduled Transaction payment type
source: Manual deposit
km: ការដាក់ប្រាក់ដោយដៃ

# Scheduled Transaction payment type
source: Other
km: ផ្សេងទៀត

# Scheduled Transaction payment type
source: Write check
km: សរសេរមូលប្បទានប័ត្រ

# Scheduled Transaction payment type
source: Standing order
km: សណ្តាប់ធ្នាប់ឈរ

# Scheduled Transaction payment type
source: Bank transfer
km: ការផ្ទេរប្រាក់តាមធនាគារ

# Scheduled Transaction payment type
source: Any (Error)
km: ណាមួយ (កំហុស)

source: None
km: គ្មាន

source: Unknown
km: មិនស្គាល់

source: IBAN and BIC
km: IBAN និង BIC

source: National Account Number
km: លេខគណនីជាតិ

source: Cannot add currency with existing id %1
km: មិនអាចបន្ថែមរូបិយប័ណ្ណជាមួយលេខសម្គាល់ដែលមានស្រាប់ %1

source: Cannot modify currency with unknown id %1
km: មិនអាចកែប្រែរូបិយប័ណ្ណជាមួយលេខសម្គាល់ដែលមិនស្គាល់ %1

source: Cannot remove currency with unknown id %1
km: មិនអាចដករូបិយប័ណ្ណចេញដោយលេខសម្គាល់ដែលមិនស្គាល់ %1

source: Cannot retrieve currency with unknown id '%1'
km: មិនអាចទាញយករូបិយប័ណ្ណដែលមានលេខសម្គាល់ដែលមិនស្គាល់ '%1'

# Reconciliation status 'Not Reconciled'
source: not reconciled
km: មិនផ្សះផ្សា

# Reconciliation status 'Cleared'
source: cleared
km: ជម្រះ

# Reconciliation status 'Reconciled'
source: reconciled
km: ផ្សះផ្សា

# Reconciliation status 'Frozen'
source: frozen
km: កក

# Reconciliation status unknown
source: unknown
km: មិនស្គាល់

source: Database apparently in use Opened by %1 on %2 at %3. Open anyway?
km: មូលដ្ឋានទិន្នន័យជាក់ស្តែងកំពុងប្រើ បើកដោយ %1 នៅលើ %2 នៅ %3 ។ បើកអញ្ចឹង?

source: SQLite file %1 does not exist
km: ឯកសារ SQLite %1 មិនមានទេ

source: Automatic database creation for type %1 is not currently implemented. Please create database %2 manually
km: ការបង្កើតមូលដ្ឋានទិន្នន័យដោយស្វ័យប្រវត្តិសម្រាប់ប្រភេទ %1 បច្ចុប្បន្នមិនត្រូវបានអនុវត្តទេ។ សូមបង្កើតមូលដ្ឋានទិន្នន័យ %2 ដោយដៃ

source: Error in create database %1; do you have create permissions?
km: កំហុសក្នុងការបង្កើតមូលដ្ឋានទិន្នន័យ %1; តើអ្នកមានសិទ្ធិបង្កើតទេ?

source: Inserting online jobs.
km: បញ្ចូលការងារតាមអ៊ិនធរណេត។

source: Could not save one onlineJob.
km: មិនអាចរក្សាទុក ការងារតាមអ៊ីនធឺណិត បានទេ។

source: Loading securities...
km: កំពុងដំណើរការមូលប័ត្រ ...

source: Loading currencies...
km: កំពុងផ្ទុករូបិយប័ណ្ណ ...

source: Loading reports...
km: កំពុងផ្ទុករបាយការណ៍ ...

source: Unknown XML tag %1 found in line %2
km: ស្លាក XML ដែលមិនស្គាល់ %1 រកឃើញក្នុងបន្ទាត់ %2

source: Exception while creating a %1 element: %2
km: ការលើកលែងខណៈពេលបង្កើតធាតុ %1៖ %2

source: Loading file information...
km: កំពុងផ្ទុកព័ត៌មានឯកសារ ...

source: Loading user information...
km: កំពុងផ្ទុកព័ត៌មានអ្នកប្រើប្រាស់ ...

source: Saving accounts...
km: កំពុងរក្សាទុកគណនី ...

source: Saving transactions...
km: កំពុងរក្សាទុកប្រតិបត្តិការ ...

source: Saving reports...
km: កំពុងរក្សាទុករបាយការណ៍ ...

source: Saving budgets...
km: សន្សំថវិកា ...

source: Saving online banking orders...
km: ការរក្សាទុកការបញ្ជាទិញតាមអ៊ិនធរណេត ...

source: A valid BIC is 8 or 11 characters long.
km: BIC មានសុពលភាពគឺ ៨ ឬ ១១ តួអក្សរ។

source: The given BIC is not assigned to any credit institute.
km: BIC ដែលបានផ្តល់ឱ្យមិនត្រូវបានកំណត់ទៅវិទ្យាស្ថានឥណទានណាមួយឡើយ។

source: IBAN & BIC
km: ក្រុមហ៊ុន IBANBIC

source: This IBAN is too short.
km: IBAN នេះខ្លីពេក។

source: This IBAN is invalid.
km: IBAN នេះមិនមានសុពលភាពទេ។

source: National Account
km: គណនីជាតិ

source: account number
km: លេខ​គណនី

source: institution code
km: លេខកូដស្ថាប័ន

source: There are no entries in this account.
km: មិនមានធាតុចូលក្នុងគណនីនេះទេ។

source: Invalid account
km: គណនីមិនត្រឹមត្រូវ

source: Csv Export
km: Csv នាំចេញ

source: From this dialog you are able to export transactions to a comma separated file, (known as a CSV file, because of the extension). However, you are able to specify an alternative separator below. Please enter the path to the CSV file or select it by clicking on the Browse button. You can choose the file's path, and the account. Choose Account to export all the transactions between the specified dates, or just choose to export Categories.
km: ពីប្រអប់នេះអ្នកអាចនាំចេញប្រតិបត្តិការទៅឯកសារបំបែកដោយក្បៀស (ដែលគេស្គាល់ថាជាឯកសារស៊ីអេសអេសដោយសារផ្នែកបន្ថែម) ។ ទោះយ៉ាងណាក៏ដោយអ្នកអាចបញ្ជាក់សញ្ញាបំបែកជំនួសខាងក្រោម។ សូមបញ្ចូលផ្លូវទៅឯកសារ CSV ឬជ្រើសរើសវាដោយចុចលើប៊ូតុងរុករក។ អ្នកអាចជ្រើសរើសផ្លូវរបស់ឯកសារនិងគណនី។ ជ្រើសរើសគណនីដើម្បីនាំចេញរាល់ប្រតិបត្តិការរវាងកាលបរិច្ឆេទដែលបានបញ្ជាក់ឬគ្រាន់តែជ្រើសរើសនាំចេញប្រភេទ។

source: Field Separator
km: អ្នកបំបែកវាល

source: Comma (,)
km: ក្បៀស (,)

source: Semicolon (;)
km: ចំណុចក្បៀស (;)

source: Tab (\t)
km: ផ្ទាំង ( )

source: &CSV...
km: ស៊ីអេសវី ...

# CSV Exporter dialog title
source: CSV Exporter
km: អ្នកនាំចេញស៊ីអេសវី

source: Unexpected exception '%1' thrown in %2, line %3 caught in MyMoneyCsvWriter::write()
km: ករណីលើកលែងដែលមិនបានរំពឹងទុក '%1' បោះចោលក្នុង %2, បន្ទាត់ %3 ចាប់បាននៅក្នុង MyMoneyCsvWriter :: សរសេរ ()

source: Export completed.
km: ការនាំចេញបានបញ្ចប់។

source: Account Type:
km: ប្រភេទ​គណនី:

source: Action/Type
km: សកម្មភាព / ប្រភេទ

source: Account/Cat
km: គណនេយ្យ / ឆ្មា

source: Transaction number '%1' is missing an account assignment. Date '%2', Payee '%3'. Transaction dropped.
km: លេខប្រតិបត្តិការ '%1' បានបាត់កិច្ចការគណនី។ កាលបរិច្ឆេទ '%2', អ្នកទទួលប្រាក់ '%3' ។ ប្រតិបត្តិការបានធ្លាក់ចុះ។

source: splitCategory
km: បំបែកប្រភេទ

source: splitMemo
km: បំបែកអនុសរណៈ

source: splitAmount
km: បំបែកចំនួនទឹកប្រាក់

source: Transaction number '%1' is missing an account assignment. Date '%2', Amount '%3'. Transaction dropped.
km: លេខប្រតិបត្តិការ '%1' បានបាត់កិច្ចការគណនី។ កាលបរិច្ឆេទ '%2', ចំនួនទឹកប្រាក់ '%3' ។ ប្រតិបត្តិការបានធ្លាក់ចុះ។

source: Banking Wizard Page
km: ទំព័រអ្នកជំនួយការធនាគារ
