Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: Transactions by Payee
km: ប្រតិបត្តិការដោយអ្នកទទួលប្រាក់

source: Transactions by Tag
km: ប្រតិបត្តិការតាមស្លាក

source: Transactions by Month
km: ប្រតិបត្តិការតាមខែ

source: Transactions by Week
km: ប្រតិបត្តិការតាមសប្តាហ៍

source: Loan Transactions
km: ប្រតិបត្តិការប្រាក់កម្ចី

source: Transactions by Reconciliation Status
km: ប្រតិបត្តិការដោយស្ថានភាពផ្សះផ្សា

source: Cash Flow
km: លំហូរ​សាច់ប្រាក់

source: Cash Flow Transactions This Month
km: ប្រតិបត្តិការលំហូរសាច់ប្រាក់ក្នុងខែនេះ

source: Investment Holdings by Account
km: ការកាន់កាប់ការវិនិយោគដោយគណនី

source: Investment Holdings by Type
km: ការកាន់កាប់ដោយប្រភេទ

source: Investment Performance by Type
km: ការអនុវត្តវិនិយោគតាមប្រភេទ

source: Investment Holdings Pie
km: ចំណតវិនិយោគ

source: Investment Worth Graph
km: ក្រាហ្វិចតម្លៃវិនិយោគ

source: Investment Price Graph
km: ក្រាបតម្លៃវិនិយោគ

source: Investment Moving Average Price Graph
km: ការវិនិយោគការផ្លាស់ប្តូរក្រាហ្វតម្លៃមធ្យម

source: Investment Moving Average
km: ការផ្លាស់ប្តូរការវិនិយោគជាមធ្យម

source: Investment Moving Average vs Actual
km: ការផ្លាស់ប្តូរការវិនិយោគជាមធ្យម vs ជាក់ស្តែង

source: Taxes
km: ពន្ធ

source: Tax Transactions by Category
km: ប្រតិបត្តិការពន្ធតាមប្រភេទ

source: Tax Transactions by Payee
km: ប្រតិបត្តិការពន្ធដោយអ្នកបង់ប្រាក់

source: Tax Transactions by Category Last Fiscal Year
km: ប្រតិបត្តិការពន្ធតាមប្រភេទឆ្នាំសារពើពន្ធចុងក្រោយ

source: Tax Transactions by Payee Last Fiscal Year
km: ប្រតិបត្តិការពន្ធដោយអ្នកបង់ប្រាក់កាលពីឆ្នាំសារពើពន្ធចុងក្រោយ

source: Budgeting
km: ថវិកា

source: Budgeted vs. Actual This Year
km: ថវិកាទល់នឹងជាក់ស្តែងនៅឆ្នាំនេះ

source: Budgeted vs. Actual This Year (YTM)
km: ថវិកានិងជាក់ស្តែងឆ្នាំនេះ (YTM)

source: Yearly Budgeted vs. Actual
km: ថវិកាប្រចាំឆ្នាំទល់នឹងជាក់ស្តែង

source: Monthly Budget
km: ថវិកាប្រចាំខែ

source: Yearly Budget
km: ថវិកាប្រចាំឆ្នាំ

source: Yearly Budgeted vs Actual Graph
km: ថវិកាប្រចាំឆ្នាំនិងក្រាហ្វិចជាក់ស្តែង

source: Forecast By Month
km: ព្យាករណ៍តាមខែ

source: Forecast Next Quarter
km: ព្យាករណ៍ត្រីមាសបន្ទាប់

source: Income and Expenses Forecast This Year
km: ការព្យាករណ៍ប្រាក់ចំណូលនិងចំណាយនៅឆ្នាំនេះ

source: Net Worth Forecast Graph
km: ក្រាហ្វិចព្យាករណ៍តម្លៃសុទ្ធ

source: General Information
km: ព័ត៌មាន​ទូទៅ

source: Schedule Information
km: ព័ត៌មានអំពីតារាងពេលវេលា

source: Schedule Summary Information
km: ព័ត៌មានសង្ខេបកាលវិភាគ

source: Account Information
km: ព​ត៌​មាន​គណនី

source: Loan Information
km: ព័ត៌មានប្រាក់កម្ចី

source: Unable to load accounts:
km: មិនអាចផ្ទុកគណនី៖

source: Bills
km: វិក្កយបត្រ

source: Loans
km: ប្រាក់កម្ចី

# Finished schedule
source: Finished
km: ចប់ហើយ

source: Error activating context menu
km: កំហុសក្នុងការធ្វើឱ្យសកម្មម៉ឺនុយបរិបទ

source: Error executing item
km: កំហុសក្នុងការប្រតិបត្តិធាតុ

source: Unable to filter account
km: មិនអាចច្រោះគណនី

source: Filter Accounts
km: ច្រោះគណនី

source: List View
km: បញ្ជីទិដ្ឋភាព

source: Type/Name
km: ប្រភេទ / ឈ្មោះ

source: Frequency
km: ភាពញឹកញាប់

source: Calendar View
km: ទិដ្ឋភាពប្រតិទិន

# @item Show all tags
source: All
km: ទាំងអស់

# @item Show only used tags
source: Used
km: បានប្រើ

# @item Show only unused tags
source: Unused
km: មិនបានប្រើ

# @item Show only opened tags
source: Opened
km: បានបើក

# @item Show only closed tags
source: Closed
km: បានបិទ

source: Creates a new tag
km: បង្កើតស្លាកថ្មី

source: Use this to create a new tag.
km: ប្រើវាដើម្បីបង្កើតស្លាកថ្មី។

source: Rename the current selected tag
km: ប្តូរឈ្មោះស្លាកដែលបានជ្រើសរើសបច្ចុប្បន្ន

source: Use this to start renaming the selected tag.
km: ប្រើវាដើម្បីចាប់ផ្តើមប្តូរឈ្មោះស្លាកដែលបានជ្រើសរើស។

source: Delete the current selected tag
km: លុបស្លាកដែលបានជ្រើសរើសបច្ចុប្បន្ន

source: Use this to delete the selected tag.
km: ប្រើវាដើម្បីលុបស្លាកដែលបានជ្រើស។

# Update tag
source: Update
km: ធ្វើបច្ចុប្បន្នភាព

source: A tag with the name '%1' already exists. It is not advisable to have multiple tags with the same identification name. Are you sure you would like to rename the tag?
km: មានស្លាកដែលមានឈ្មោះថា“ %1” មានរួចហើយ។ វាមិនត្រូវបានគេណែនាំឱ្យមានស្លាកច្រើនដែលមានឈ្មោះដូចគ្នា។ តើអ្នកប្រាកដជាចង់ប្តូរឈ្មោះស្លាកឬ?

source: Unable to modify tag
km: មិនអាចកែប្រែស្លាកបានទេ

source: Your tags
km: ស្លាករបស់អ្នក

source: Tag configuration
km: ការកំណត់រចនាសម្ព័ន្ធស្លាក

source: Tag color:
km: ពណ៌ស្លាក:

source: Home Page
km: គេហទំព័រ

source: Welcome to KMyMoney
km: សូមស្វាគមន៍មកកាន់ KMyMoney

source: The free, easy to use, personal finance manager for KDE
km: អ្នកគ្រប់គ្រងហិរញ្ញវត្ថុផ្ទាល់ខ្លួនដោយឥតគិតថ្លៃងាយស្រួលប្រើ

source: Go to My Financial Summary
km: ចូលទៅកាន់សេចក្តីសង្ខេបហិរញ្ញវត្ថុរបស់ខ្ញុំ

source: Start with one of the following activities...
km: ចាប់ផ្តើមជាមួយសកម្មភាពមួយក្នុងចំណោមសកម្មភាពខាងក្រោម ...

source: Get started and setup accounts
km: ចាប់ផ្តើមនិងរៀបចំគណនី

source: Open an existing data file
km: បើកឯកសារទិន្នន័យដែលមានស្រាប់

source: Learn how to use KMyMoney
km: រៀនពីរបៀបប្រើ KMyMoney

source: Visit our website
km: ចូលមើលគេហទំព័ររបស់យើង

source: Get help from our community
km: ទទួលជំនួយពីសហគមន៍របស់យើង

source: See what's new in this version
km: មើលអ្វីដែលថ្មីនៅក្នុងកំណែនេះ

source: What's new in this version
km: តើមានអ្វីថ្មីនៅក្នុងកំណែនេះ

source: What's new in KMyMoney %1
km: តើមានអ្វីថ្មីនៅក្នុង KMyMoney %1

source: Return to the Welcome page
km: ត្រឡប់ទៅទំព័រស្វាគមន៍

source: We are pleased to announce a major step forward for what has been described as "the BEST personal finance manager for FREE users".
km: យើងមានសេចក្តីសោមនស្សសូមប្រកាសនូវជំហានឆ្ពោះទៅមុខសម្រាប់អ្វីដែលត្រូវបានពិពណ៌នាថាជា " អ្នកគ្រប់គ្រងហិរញ្ញវត្ថុផ្ទាល់ខ្លួនល្អបំផុតសម្រាប់អ្នកប្រើប្រាស់ឥតគិតថ្លៃ " ។

source: What's new in this version:
km: តើមានអ្វីថ្មីនៅក្នុងកំណែនេះ៖

source: Let us know what you think. We hope that you enjoy using the application.
km: អនុញ្ញាតឱ្យយើងដឹងពីអ្វីដែលអ្នកគិត។ យើងសង្ឃឹមថាអ្នករីករាយនឹងប្រើកម្មវិធីនេះ។

source: Please let us know about any abnormal behavior in the program by selecting <a href="/action?id=help_report_bug">"Report bug..."</a> from the help menu or by sending an e-mail to the developers mailing list.
km: សូមប្រាប់យើងអំពីឥរិយាបទមិនប្រក្រតីណាមួយនៅក្នុងកម្មវិធីដោយជ្រើសរើស <a href= " /action?id=help_report_bug " > " រាយការណ៍កំហុស ... " </a> ពីម៉ឺនុយជំនួយឬដោយការផ្ញើអ៊ីមែលទៅបញ្ជីសំបុត្ររួមរបស់អ្នកអភិវឌ្ឍន៍។

source: The KMyMoney Development Team
km: ក្រុមអភិវឌ្ឍន៍ខេអិមមីនី

source: Added support for online SEPA transactions
km: បានបន្ថែមការគាំទ្រសម្រាប់ប្រតិបត្តិការ SEPA តាមអ៊ីនធឺណិត

source: A plugin to import data using Weboob was added
km: កម្មវិធីបន្ថែមដើម្បីនាំចូលទិន្នន័យដោយប្រើ Weboob ត្រូវបានបន្ថែម

source: Improved payee matching when importing transactions
km: ធ្វើឱ្យប្រសើរឡើងនូវការផ្គូផ្គងអ្នកបង់ប្រាក់នៅពេលនាំចូលប្រតិបត្តិការ

source: When an account cannot be closed, a tooltip explains the reason
km: នៅពេលដែលគណនីមិនអាចត្រូវបានបិទព័ត៌មានជំនួយពន្យល់ពីមូលហេតុ

source: Transaction tags were added
km: ស្លាកប្រតិបត្តិការត្រូវបានបន្ថែម

source: Proper input methods support was added
km: ការគាំទ្រវិធីសាស្ត្របញ្ចូលត្រឹមត្រូវត្រូវបានបន្ថែម

source: Improved the transaction form
km: ទម្រង់បែបបទធ្វើឱ្យប្រសើរឡើង

source: Added a frozen column to improve visualizing forecast details
km: បន្ថែមជួរឈរដែលបង្កកដើម្បីធ្វើឱ្យប្រសើរឡើងនូវព័ត៌មានលម្អិតនៃការព្យាករណ៍

source: Improved multiple records management actions (payees, transactions)
km: ធ្វើឱ្យប្រសើរឡើងនូវសកម្មភាពគ្រប់គ្រងកំណត់ត្រាជាច្រើន (អ្នកបង់ប្រាក់ប្រតិបត្តិការ)

source: Better performance of the user interface
km: ដំណើរការល្អប្រសើរនៃចំណុចប្រទាក់អ្នកប្រើ

source: Homepage can show accounts online banking status
km: គេហទំព័រអាចបង្ហាញស្ថានភាពគណនីតាមអ៊ិនធរណេត

source: Improved the icon theme
km: ធ្វើឱ្យប្រសើរឡើងស្បែករូបតំណាង

source: CSV importer was improved
km: អ្នកនាំចូល CSV ត្រូវបានធ្វើឱ្យប្រសើរឡើង

source: CSV exporter added
km: អ្នកនាំចេញស៊ីអេសអេសបន្ថែម

source: OFX plugin now allows custom application version
km: កម្មវិធីជំនួយ OFX ឥលូវអនុញ្ញាតិអោយមានកំណែកម្មវិធីផ្ទាល់ខ្លួន

source: Please select the account number type
km: សូមជ្រើសរើសប្រភេទលេខគណនី

source: Account Types
km: ប្រភេទគណនី

source: Detailed description
km: ការពិពណ៌នាលំអិត

# @title header of the account name column
source: Name
km: ឈ្មោះ

source: You have entered budget values using a different base which would result in a monthly budget of <b>%1</b>. Should this value be used to fill the monthly budget?
km: អ្នកបានបញ្ចូលតម្លៃថវិកាដោយប្រើមូលដ្ឋានផ្សេងគ្នាដែលនឹងនាំឱ្យមានថវិកាប្រចាំខែ <b> %1 </b> ។ តើតម្លៃនេះគួរតែត្រូវបានប្រើដើម្បីបំពេញថវិកាប្រចាំខែទេ?

# Auto assignment (caption)
source: Auto assignment
km: ចាត់តាំងដោយស្វ័យប្រវត្តិ

source: You have entered budget values using a different base which would result in a yearly budget of <b>%1</b>. Should this value be used to fill the monthly budget?
km: អ្នកបានបញ្ចូលតម្លៃថវិកាដោយប្រើមូលដ្ឋានផ្សេងគ្នាដែលនឹងមានលទ្ធផលជាថវិកាប្រចាំឆ្នាំ <b> %1 </b> ។ តើតម្លៃនេះគួរតែត្រូវបានប្រើដើម្បីបំពេញថវិកាប្រចាំខែទេ?

source: You have entered budget values using a different base which would result in an individual monthly budget of <b>%1</b>. Should this value be used to fill the monthly budgets?
km: អ្នកបានបញ្ចូលតម្លៃថវិកាដោយប្រើមូលដ្ឋានផ្សេងគ្នាដែលនឹងនាំឱ្យមានថវិកាប្រចាំខែនីមួយៗ <b> %1 </b> ។ តើតម្លៃនេះគួរតែត្រូវបានប្រើដើម្បីបំពេញថវិកាប្រចាំខែទេ?

source: Period
km: រយៈពេល

# @action timeframe of the budget
source: Monthly
km: ប្រចាំខែ

# @action timeframe of the budget
source: Yearly
km: ប្រចាំឆ្នាំ

# @action timeframe of the budget. month-by-month budget
source: Individual
km: បុគ្គល

# Select all accounts
source: All
km: ទាំងអស់

# No account
source: None
km: គ្មាន

source: Use this button to skip this transaction
km: ប្រើប៊ូតុងនេះដើម្បីរំលងប្រតិបត្តិការនេះ

source: Record this transaction into the register
km: កត់ត្រាប្រតិបត្តិការនេះទៅក្នុងបញ្ជី

source: Use this button to record this transaction
km: ប្រើប៊ូតុងនេះដើម្បីកត់ត្រាប្រតិបត្តិការនេះ

source: %1 of %2
km: %1 នៃ %2

source: Payment on %2 for %3 with %1 transaction remaining occurring %4.
km: ការទូទាត់នៅលើ %2 សម្រាប់ %3 ជាមួយប្រតិបត្តិការ %1 ដែលកំពុងកើតឡើង %4 ។

source: Payment on %1 for %2 occurring %3.
km: ការទូទាត់នៅលើ %1 សម្រាប់ %2 ដែលកើតឡើង %3 ។

source: %1 day overdue
km: %1 ហួសកាលបរិច្ឆេទ

source: (%1 occurrence.)
km: (ការកើតឡើង %1 ។ )

source: Select Style
km: ជ្រើសរើសស្ទីល

source: Choose Style
km: ជ្រើសរើសស្ទីល

source: Next year
km: ឆ្នាំក្រោយ

source: Previous year
km: ឆ្នាំមុន

source: Next month
km: ខែក្រោយ

source: Previous month
km: ខែមុន

source: Select a week
km: ជ្រើសរើសមួយសប្តាហ៍

source: Select a month
km: ជ្រើសរើសមួយខែ

source: Select a year
km: ជ្រើសរើសមួយឆ្នាំ

source: Week XX
km: សប្តាហ៍ទី XX

source: Week %1
km: សប្តាហ៍ %1

source: Close
km: បិទ

# Sunday
source: Sun
km: ព្រះអាទិត្យ

# Saturday
source: Sat
km: សៅរ៍

source: Week %1 for year %2.
km: សប្តាហ៍ %1 សម្រាប់ឆ្នាំ %2 ។

source: Closed tags can't be used.
km: ស្លាកដែលបិទមិនអាចត្រូវបានប្រើ។

source: Closed tag
km: បិទស្លាក

source: The tag is already present.
km: ស្លាកមានរួចហើយ។

source: Duplicate tag
km: ស្លាកស្ទួន

# Activity for income categories
source: Received
km: បានទទួល

# Activity for expense categories
source: Paid
km: បង់លុយ

source: Pay to
km: បង់ទៅ

source: From
km: ពី

# Finance
source: Buy shares
km: ទិញភាគហ៊ុន

# Finance
source: Sell shares
km: លក់ភាគហ៊ុន

source: Dividend
km: ភាគលាភ

source: Reinvest dividend
km: បែងចែកភាគលាភឡើងវិញ

source: Yield
km: ទិន្នផល

# Finance
source: Add shares
km: បន្ថែមភាគហ៊ុន

# Finance
source: Remove shares
km: យកភាគហ៊ុនចេញ

# Finance
source: Split shares
km: ចែកភាគហ៊ុន

source: Interest Income
km: ចំណូលការប្រាក់

source: All dates
km: កាលបរិច្ឆេទទាំងអស់

source: As of today
km: ដូចថ្ងៃនេះ

source: Today
km: ថ្ងៃនេះ

source: Current month
km: ខែបច្ចុប្បន្ន

source: Current quarter
km: ត្រីមាសបច្ចុប្បន្ន

source: Current year
km: ឆ្នាំ​បច្ចុប្បន្ន

source: Current fiscal year
km: ឆ្នាំសារពើពន្ធបច្ចុប្បន្ន

source: Month to date
km: ខែដល់កាលបរិច្ឆេទ

source: Year to date
km: ឆ្នាំទៅកាលបរិច្ឆេទ

source: Year to month
km: ពីមួយឆ្នាំទៅមួយខែ

source: Last month
km: ខែមុន

source: Last year
km: ឆ្នាំមុន

source: Last fiscal year
km: ឆ្នាំសារពើពន្ធចុងក្រោយ

source: Last 7 days
km: ៧ ថ្ងៃចុងក្រោយ

source: Last 30 days
km: ៣០ ថ្ងៃចុងក្រោយ

source: Last 3 months
km: ៣ ខែចុងក្រោយ

source: Last quarter
km: ត្រីមាសចុងក្រោយ

source: Last 6 months
km: ៦ ខែចុងក្រោយ

source: Last 11 months
km: ១១ ខែចុងក្រោយ

source: Last 12 months
km: ១២ ខែចុងក្រោយ

source: Next 7 days
km: ៧ ថ្ងៃបន្ទាប់

source: Next 30 days
km: ៣០ ថ្ងៃបន្ទាប់

source: Next 3 months
km: ៣ ខែបន្ទាប់

source: Next quarter
km: ត្រីមាសបន្ទាប់

source: Next 6 months
km: ៦ ខែបន្ទាប់

source: Next 12 months
km: ១២ ខែបន្ទាប់

source: Next 18 months
km: ១៨ ខែបន្ទាប់

source: Last 3 months to next 3 months
km: ៣ ខែទៅ ៣ ខែបន្ទាប់

source: User defined
km: អ្នកប្រើប្រាស់កំណត់

source: Report Tab
km: ផ្ទាំងរបាយការណ៍

source: <p>On this tab, you set the basic properties of this report.</p>
km: <p> នៅលើផ្ទាំងនេះអ្នកកំណត់លក្ខណៈសម្បត្តិជាមូលដ្ឋាននៃរបាយការណ៍នេះ។ </p>

source: Report Name
km: ឈ្មោះរបាយការណ៍

source: <p>Choose a name for this report.</p>
km: <p> ជ្រើសរើសឈ្មោះសម្រាប់របាយការណ៍នេះ។ </p>

source: <p>Enter a comment to help you remember the details of this report.</p>
km: <p> បញ្ចូលមតិយោបល់ដើម្បីជួយអ្នកឱ្យចងចាំព័ត៌មានលម្អិតនៃរបាយការណ៍នេះ។ </p>

source: Convert values to base currency
km: បម្លែងតម្លៃទៅរូបិយប័ណ្ណគោល

# Convert 'em!!
source: <p>Select this option to convert all values in the report to your base currency.</p><p>Leave it unchecked if you would like to see values in their original currency.</p><p>If currencies are not converted, then subtotals will not be shown.</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីប្តូរតម្លៃទាំងអស់នៅក្នុងរបាយការណ៍ទៅជារូបិយប័ណ្ណគោលរបស់អ្នក។ </p><p> កុំទុកវាចោលបើអ្នកចង់ឃើញតម្លៃជារូបិយប័ណ្ណដើម។ </p><p> ប្រសិនបើរូបិយប័ណ្ណមិនត្រូវបានប្តូរទេនោះប្រាក់ដកនឹងមិនត្រូវបានបង្ហាញទេ។ </p>

source: Mark as a favorite report
km: សម្គាល់ថាជារបាយការណ៍ដែលអ្នកចូលចិត្ត

source: <p>Select this option to notate this report as one of your favorites.</p><p>All your favorite reports are grouped in one place on the report list for easy access.</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីកំណត់របាយការណ៍នេះជាចំណូលចិត្តមួយរបស់អ្នក។ </p><p> រាល់របាយការណ៍ដែលអ្នកចូលចិត្តត្រូវបានដាក់ជាក្រុមនៅកន្លែងតែមួយក្នុងបញ្ជីរបាយការណ៍ដើម្បីងាយស្រួល។ </p>

source: Skip value if price is zero
km: រំលងតម្លៃប្រសិនបើតម្លៃសូន្យ

source: <p> This option is for investments reports only which show prices instead of balances as all other reports do. </p> <p> Select this option to include prices only if there is an actual price for the date. If not, 0 will be shown. In the graph, the value will be skipped. </p> <p> If this option is off the last existing price is shown for a period, if it is on, in a table the value is '0' shown and in a chart a linear interpolation for the missing values will be performed. <br>Example: <br>There are prices for January and March, but there is no price for February. <ul> <li><b>OFF</b>: shows the price for February as the last price of January <li><b>ON</b>: in a table the value is '0', in a chart a linear interpolation for the February-price will be performed (so it makes a kind of average-value using the January- and the March-price in the chart) </ul> </p>
km: <p> ជម្រើសនេះគឺសម្រាប់របាយការណ៍វិនិយោគតែប៉ុណ្ណោះដែល បង្ហាញតម្លៃជំនួសឱ្យសមតុល្យដូចរបាយការណ៍ផ្សេងទៀត។ </p> <p> ជ្រើសរើសជំរើសនេះដើម្បីរួមបញ្ចូលតែតម្លៃប៉ុណ្ណោះប្រសិនបើមានតម្លៃពិតប្រាកដសម្រាប់កាលបរិច្ឆេទ។ បើមិនដូច្នោះទេលេខ ០ នឹងត្រូវបានបង្ហាញ។ នៅក្នុងក្រាហ្វតម្លៃនឹងរំលង។ </p> <p> ប្រសិនបើជម្រើសនេះត្រូវបានបិទតម្លៃដែលមានស្រាប់ចុងក្រោយត្រូវបានបង្ហាញក្នុងរយៈពេលមួយប្រសិនបើ នៅលើតារាងតម្លៃត្រូវបានបង្ហាញ '០' ហើយក្នុងគំនូសតាងមួយការបកប្រែលីនេអ៊ែរ សម្រាប់តម្លៃដែលបាត់នឹងត្រូវបានអនុវត្ត។ <br> ឧទាហរណ៍ៈ <br> មានតម្លៃសម្រាប់ខែមករានិងមីនាប៉ុន្តែមិនមានតម្លៃសម្រាប់ ខែកុម្ភៈទេ។ <ul> <li><b> បិទ </b> ៖ បង្ហាញតម្លៃសម្រាប់ខែកុម្ភៈជាតម្លៃចុងក្រោយរបស់ មករា <li><b> បើក </b> ៖ នៅក្នុងតារាងតម្លៃគឺ ០ ហើយនៅក្នុងគំនូសតាងការបកប្រែលីនេអ៊ែរ សម្រាប់តម្លៃខែកុម្ភៈនឹងត្រូវបានអនុវត្ត (ដូច្នេះវាបង្កើតប្រភេទនៃតម្លៃមធ្យមដោយប្រើខែមករា - និងតម្លៃ ខែមីនាក្នុងតារាង) ) </ul> </p>

source: Rows/Columns Tab
km: ផ្ទាំងជួរដេក / ជួរឈរ

source: <p>On this tab, you configure how you'd like the rows and columns to be selected and organized.</p>
km: <p> នៅលើផ្ទាំងនេះអ្នកកំណត់របៀបដែលអ្នកចង់ជ្រើសរើសជួរនិងជួរឈរដែលត្រូវជ្រើសរើសនិងរៀបចំ។ </p>

source: <p>Choose what kind of accounts to display as the rows of this report.</p>
km: <p> ជ្រើសរើសប្រភេទគណនីណាដែលត្រូវបង្ហាញជាជួរដេកនៃរបាយការណ៍នេះ។ </p>

# @item all accounts
source: All
km: ទាំងអស់

source: Columns
km: ជួរឈរ

source: <p>Choose how large of a time period each column should encompass</p>
km: <p> ជ្រើសរើសថាតើរយៈពេលប៉ុន្មានដែលជួរឈរនីមួយៗគួរស្ថិតនៅ </p>

source: Rows
km: ជួរដេក

source: Show totals column
km: បង្ហាញជួរឈរសរុប

source: Average days
km: ថ្ងៃមធ្យម

source: Include scheduled transactions
km: រួមបញ្ចូលប្រតិបត្តិការដែលបានគ្រោងទុក

source: Include transfers
km: រួមបញ្ចូលទាំងការផ្ទេរប្រាក់

source: Include unused accounts/categories
km: រួមបញ្ចូលគណនី / ប្រភេទដែលមិនបានប្រើ

source: Organize by:
km: រៀបចំដោយ៖

source: <p>Choose how to group the transactions in this report</p>
km: <p> ជ្រើសរើសវិធីដើម្បីដាក់ប្រតិបត្តិការប្រតិបត្តិការនៅក្នុងរបាយការណ៍នេះ </p>

source: Show Columns
km: បង្ហាញជួរឈរ

source: <p>Choose which columns should be shown in the report.</p><p>The date and transaction amount are always shown.</p>
km: <p> ជ្រើសរើសជួរឈរណាមួយដែលគួរត្រូវបានបង្ហាញនៅក្នុងរបាយការណ៍។ </p><p> កាលបរិច្ឆេទនិងចំនួនប្រតិបត្តិការតែងតែបង្ហាញ។ </p>

source: <p>Select this option to show the Memo column</p>
km: <p> ជ្រើសរើសជំរើសនេះដើម្បីបង្ហាញជួរឈរអនុសរណៈ </p>

source: <p>Select this option to show the Shares column for investments</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរភាគហ៊ុនសម្រាប់ការវិនិយោគ </p>

source: <p>Select this option to show the Price column for investments</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរតម្លៃសម្រាប់ការវិនិយោគ </p>

source: <p>Select this option to show the Reconciled column</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរផ្សះផ្សា </p>

source: <p>Select this option to show the Account column</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរគណនី </p>

source: <p>Select this option to show the Number column</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរលេខ </p>

source: <p>Select this option to show the Tag column</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរស្លាក </p>

source: <p>Select this option to show the Payee column</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរអ្នកបង់ប្រាក់ </p>

source: <p>Select this option to show the Category column</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរប្រភេទ </p>

source: <p>Select this option to show the Action column</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរសកម្មភាព </p>

source: <p>Select this option to show the Running balance column</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញជួរឈរដែលកំពុងដំណើរការ </p>

source: Include only Loan accounts
km: រួមបញ្ចូលតែគណនីប្រាក់កម្ចី

source: Include only Investment accounts
km: រួមបញ្ចូលតែគណនីវិនិយោគប៉ុណ្ណោះ

source: <p>Check this box to include only those categories which have been marked to "Include on Tax Reports"</p>
km: <p> ធីកប្រអប់នេះដើម្បីរួមបញ្ចូលតែប្រភេទដែលត្រូវបានសម្គាល់ទៅ " រួមបញ្ចូលលើរបាយការណ៍ពន្ធ " </p>

source: Hide Split Transaction Details
km: លាក់ពត៌មានលំអិតប្រតិបត្តិការពុះ

source: Do not display the individual transactions that make up a split transaction
km: កុំបង្ហាញប្រតិបត្តិការបុគ្គលដែលបង្កើតជាប្រតិបត្តិការបំបែក

source: Include only Tax categories
km: រួមបញ្ចូលតែប្រភេទពន្ធ

source: Chart Tab
km: ផ្ទាំងគំនូសតាង

source: <p>On this tab, you configure the chart drawn for this report.</p>
km: <p> នៅលើផ្ទាំងនេះអ្នកកំណត់រចនាសម្ព័ន្ធគំនូសតាងដែលត្រូវបានគូរសម្រាប់របាយការណ៍នេះ។ </p>

source: <p>Select what form you would like the chart to be drawn as.</p>
km: <p> ជ្រើសរើសទម្រង់ណាមួយដែលអ្នកចង់អោយតារាងគូរ។ </p>

source: Chart Type
km: ប្រភេទគំនូសតាង

source: Chart Palette
km: ក្ដារលាយគំនូសតាង

source: <p>Select this option to show horizontal and vertical grid lines on the chart.</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបង្ហាញបន្ទាត់ក្រឡាចត្រង្គផ្ដេកនិងបញ្ឈរនៅលើគំនូសតាង។ </p>

source: Show grid lines
km: បង្ហាញបន្ទាត់ក្រឡាចត្រង្គ

source: <p>Select this option to draw the numeric values for data points next to their plot location.</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីគូរតម្លៃលេខសម្រាប់ចំណុចទិន្នន័យនៅជាប់ទីតាំងគ្រោងរបស់ពួកគេ។ </p>

source: Draw values on chart
km: គូរតម្លៃនៅលើគំនូសតាង

source: <p>Select this option to cause the report to be shown as a chart when you first open the report. Otherwise, it will come up as a text report.</p>
km: <p> ជ្រើសជម្រើសនេះដើម្បីបណ្តាលឱ្យរបាយការណ៍ត្រូវបានបង្ហាញជាគំនូសតាងនៅពេលអ្នកបើករបាយការណ៍ដំបូង។ បើមិនដូច្នោះទេវានឹងលេចចេញជារបាយការណ៍អត្ថបទ។ </p>

source: Show as chart by default
km: បង្ហាញជាគំនូសតាងតាមលំនាំដើម

source: <p>Select what width should be used to draw the line on the chart</p>
km: <p> ជ្រើសរើសទទឹងគួរប្រើដើម្បីគូរបន្ទាត់លើគំនូសតាង </p>

source: Line width
km: ទទឹងបន្ទាត់

# type of graphic chart
source: Line
km: បន្ទាត់

# type of graphic chart
source: Bar
km: បារ

# type of graphic chart
source: Stacked Bar
km: បារជង់

# type of graphic chart
source: Pie
km: ចំណិត

# type of graphic chart
source: Ring
km: រោទិ៍

# chart palette
source: Use application setting
km: ប្រើការកំណត់កម្មវិធី

# chart palette
source: Default
km: លំនាំដើម

# chart palette
source: Rainbowed
km: ឥន្ទធនូ

# chart palette
source: Subdued
km: បង្ក្រាប

source: ReportControl
km: របាយការណ៍ត្រួតពិនិត្យ

source: Configure this report
km: កំណត់រចនាសម្ព័ន្ធរបាយការណ៍នេះ

source: Create a new report based on this one
km: បង្កើតរបាយការណ៍ថ្មីដោយផ្អែកលើរបាយការណ៍នេះ

source: Copy
km: ចម្លង

source: Copy this report to the clipboard
km: ចម្លងរបាយការណ៍នេះទៅក្តារតម្បៀតខ្ទាស់

source: Export this report as an HTML or CSV file
km: នាំចេញរបាយការណ៍នេះជាឯកសារ HTML ឬ CSV

source: Permanently delete this report
km: លុបរបាយការណ៍នេះជាអចិន្ត្រៃយ៍

source: Close this window
km: បិទផ្ទាំងកម្មវិធីនេះ

source: Select Schedules
km: ជ្រើសរើសកាលវិភាគ

source: %1 Bill.
km: %1 វិក័យប័ត្រ

source: %1 Deposit.
km: %1 ការដាក់ប្រាក់។

source: %1 Transfer.
km: %1 ផ្ទេរ។

source: icon
km: រូបតំណាង

source: Feedback content
km: មាតិកាប្រតិកម្ម

source: Continue with next page
km: បន្តជាមួយទំព័របន្ទាប់

source: Finish wizard
km: បញ្ចប់អ្នកជំនួយការ

# Go to previous page of the wizard
source: &Back
km: ថយក្រោយ

# Finish the wizard
source: &Finish
km: បញ្ចប់

source: No Title specified
km: គ្មានចំណងជើងបានបញ្ជាក់

source: Step %1 of %2
km: ជំហាន %1 នៃ %2

source: n of n
km: n នៃ n

# @label name of the schedule
source: Name:
km: ឈ្មោះ៖

source: Enter...
km: បញ្ចូល ...

source: &Close
km: បិទ

# Filter widget label
source: Fi&lter:
km: តម្រង៖

# Unknown sort order
source: Unknown
km: មិនស្គាល់

source: Post date
km: កាលបរិច្ឆេទប្រកាស

source: Date entered
km: កាលបរិច្ឆេទបានបញ្ចូល

source: Entry order
km: ធាតុចូល

source: Reconcile state
km: រដ្ឋផ្សះផ្សា

# Deposits onto account
source: Deposits
km: ការដាក់ប្រាក់

# Payments towards credit card
source: Payments
km: ការទូទាត់

# Payments made from account
source: Payments
km: ការទូទាត់

# Payments made with credit card
source: Charges
km: ការគិតប្រាក់

# Reconcile state 'Not reconciled'
source: Not reconciled
km: មិនផ្សះផ្សា

# Reconcile state 'Cleared'
source: Cleared
km: ជម្រះ

# Reconcile state 'Reconciled'
source: Reconciled
km: ផ្សះផ្សាឡើងវិញ

# Reconcile state 'Frozen'
source: Frozen
km: កក

# Unknown reconcile state
source: Unknown
km: មិនស្គាល់

# Cheque Number
source: No.
km: លេខ

# Payment made from account
source: Payment
km: ការទូទាត់

# Deposit into account
source: Deposit
km: ការដាក់ប្រាក់

# Payment made with credit card
source: Charge
km: សាក

# Payment towards credit card
source: Payment
km: ការទូទាត់

# Decrease of asset/liability value
source: Decrease
km: ថយចុះ

# Increase of asset/liability value
source: Increase
km: កើនឡើង

source: Prior transactions possibly filtered
km: ប្រតិបត្តិការមុនត្រូវបានច្រោះ
