Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: Edit...
km: កែសម្រួល ...

# To duplicate a split
source: Duplicate
km: ស្ទួន

source: Delete...
km: លុប ...

source: will be calculated
km: នឹងត្រូវបានគណនា

source: You are about to delete the selected split. Do you really want to continue?
km: អ្នករៀបនឹងលុបការបំបែកដែលបានជ្រើស។ តើអ្នកពិតជាចង់បន្តទេ?

source: Continue
km: បន្ត

source: You need to assign a category to this split before it can be entered.
km: អ្នកត្រូវកំណត់ប្រភេទមួយទៅការបំបែកនេះមុនពេលវាអាចត្រូវបានបញ្ចូល។

source: Enter split
km: បញ្ចូលការបំបែក

source: Accounts
km: គណនី

source: Is a sub account
km: គឺជាគណនីរង

# default price mode
source: (default)
km: (លំនាំដើម)

# Finance
source: Price per share
km: តម្លៃក្នុងមួយភាគហ៊ុន

# Finance
source: Total for all shares
km: សរុបសម្រាប់ភាគហ៊ុនទាំងអស់

source: VAT account
km: គណនីអាករ

source: You have not specified a name. Please fill in this field.
km: អ្នកមិនបានបញ្ជាក់ឈ្មោះទេ។ សូមបំពេញក្នុងប្រអប់នេះ។

source: Please select a parent account.
km: សូមជ្រើសរើសគណនីមេ។

source: (No Institution)
km: (គ្មានស្ថាប័ន)

source: A category named <b>%1</b> already exists. You cannot create a second category with the same name.
km: ប្រភេទដែលមានឈ្មោះ <b> %1 </b> ធ្លាប់​មាន​រួចហើយ។ អ្នកមិនអាចបង្កើតប្រភេទទីពីរដែលមានឈ្មោះដូចគ្នាបានទេ។

source: You have selected to suppress the display of unused categories in the KMyMoney configuration dialog. The category you just created will therefore only be shown if it is used. Otherwise, it will be hidden in the accounts/categories view.
km: អ្នកបានជ្រើសដើម្បីបង្ក្រាបការបង្ហាញប្រភេទដែលមិនបានប្រើនៅក្នុងប្រអប់កំណត់រចនាសម្ព័ន្ធ KMyMoney ។ ប្រភេទដែលអ្នកទើបតែបានបង្កើតនឹងត្រូវបានបង្ហាញប្រសិនបើវាត្រូវបានប្រើ។ បើមិនដូច្នោះទេវានឹងត្រូវបានលាក់នៅក្នុងទិដ្ឋភាពគណនី / ប្រភេទ។

source: Hidden categories
km: ប្រភេទលាក់

source: Is a sub account of %1
km: គឺជាគណនីរងនៃ %1

source: Asset
km: ទ្រព្យ

source: Liability
km: ការទទួលខុសត្រូវ

source: Income
km: ប្រាក់ចំណូល

source: Expense
km: ចំណាយ

source: Cannot add institution
km: មិនអាចបន្ថែមស្ថាប័នបានទេ

source: Option has been disabled because there are transactions assigned to this account
km: ជម្រើសត្រូវបានបិទពីព្រោះមានប្រតិបត្តិការដែលត្រូវបានកំណត់ចំពោះគណនីនេះ

source: Option has been disabled because there is another account flagged to be an opening balance account for this currency
km: ជម្រើសត្រូវបានបិទពីព្រោះមានគណនីមួយផ្សេងទៀតដែលបានដាក់ទង់ថាជាគណនីសមតុល្យបើកសម្រាប់រូបិយប័ណ្ណនេះ

source: New Account Dialog
km: ប្រអប់គណនីថ្មី

# Account general settings
source: General
km: ទូទៅ

# account name
source: Name:
km: ឈ្មោះ៖

source: Opening information
km: បើកព័ត៌មាន

source: Currency:
km: រូបិយប័ណ្ណ៖

source: Date:
km: កាលបរិច្ឆេទ៖

source: Balance:
km: សមតុល្យ៖

source: Last check number:
km: លេខឆែកចុងក្រោយ៖

source: Notes:
km: កំណត់សំគាល់ៈ

source: No auto-VAT-assignment
km: គ្មានការកំណត់តម្លៃបន្ថែមដោយស្វ័យប្រវត្តិ

source: Price entry
km: ការបញ្ចូលតម្លៃ

source: Preferred Account
km: គណនីចំណូលចិត្ត

source: <html><head/><body><p>Flag this account to be an opening balance account</p></body></html>
km: <html><head/><body><p> ដាក់ទង់គណនីនេះជាគណនីសមតុល្យបើក </p></body></html>

source: Opening Balance Account
km: បើកគណនីសមតុល្យ

source: Institution
km: ស្ថាប័ន

# create new institution
source: New...
km: ថ្មី ...

source: Number:
km: ចំនួន:

source: BIC
km: ប៊ីស៊ី

source: Hierarchy
km: ឋានានុក្រម

source: Subaccount
km: ចំនួនរង

source: Limits
km: ដែនកំណត់

source: This page allows to setup certain limits. KMyMoney will warn you when the account balance reaches a limit.
km: ទំព័រនេះអនុញ្ញាតឱ្យរៀបចំដែនកំណត់ជាក់លាក់។ KMyMoney នឹងព្រមានអ្នកនៅពេលសមតុល្យគណនីឈានដល់កម្រិតកំណត់។

source: Absolute limit
km: ដែនកំណត់ដាច់ខាត

source: Maximum credit limit
km: ដែនកំណត់ឥណទានអតិបរមា

source: Minimum balance
km: សមតុល្យអប្បបរមា

source: Early warning
km: ការព្រមានមុន

source: Tax
km: ពន្ធ

source: VAT details
km: ព័ត៌មានលម្អិតពន្ធអាករ

source: VAT category
km: ប្រភេទអាករ

source: VAT percentage
km: ភាគរយអាករ

source: Enable auto VAT assignment
km: បើកដំណើរការការកំណត់តម្លៃបន្ថែមដោយស្វ័យប្រវត្តិ

source: Amount entered
km: ចំនួនទឹកប្រាក់ដែលបានបញ្ចូល

source: Gross amount
km: ចំនួនសរុប

source: Net a&mount
km: ចំនួនសុទ្ធ

source: Include on Tax Reports
km: រួមបញ្ចូលលើរបាយការណ៍ពន្ធ

source: The institution name field is empty. Please enter the name.
km: វាលឈ្មោះស្ថាប័នគឺទទេ។ សូមបញ្ចូលឈ្មោះ។

source: Adding New Institution
km: បន្ថែមស្ថាប័នថ្មី

source: New Institution Dialog
km: ប្រអប់ស្ថាប័នថ្មី

source: Institution Details
km: ព័ត៌មានលំអិតរបស់ស្ថាប័ន

# institution name column
source: Name:
km: ឈ្មោះ៖

source: City:
km: ទីក្រុង៖

source: Street:
km: ផ្លូវ៖

source: Postal Code:
km: លេខ​កូដ​ប្រៃ​ស​ណី​យ:

source: Telephone/Fax:
km: ទូរស័ព្ទ / ទូរសារ៖

source: Routing Number:
km: លេខផ្លូវ៖

source: Please specify a budget name
km: សូមបញ្ជាក់ឈ្មោះថវិកា

source: New Budget
km: ថវិកាថ្មី

# header of the budget name column
source: Name
km: ឈ្មោ

source: Year
km: ឆ្នាំ

source: New Equity
km: សមធម៌ថ្មី

source: Trading Symbol of the stock or mutual fund, not required.
km: និមិត្តសញ្ញាជួញដូរភាគហ៊ុនឬមូលនិធិទៅវិញទៅមកមិនចាំបាច់ទេ។

source: Name of the company, or mutual fund.
km: ឈ្មោះក្រុមហ៊ុនឬមូលនិធិទៅវិញទៅមក។

source: Unable to load data, because no contact has been associated with the owner of the standard address book.
km: មិនអាចផ្ទុកទិន្នន័យបានទេពីព្រោះមិនមានទំនាក់ទំនងណាមួយត្រូវបានផ្សារភ្ជាប់ជាមួយនឹងម្ចាស់សៀវភៅអាសយដ្ឋានស្តង់ដារ។

source: Address book import
km: ការនាំចូលសៀវភៅអាសយដ្ឋាន

source: New File Dialog
km: ប្រអប់ឯកសារថ្មី

source: Use this dialog to enter personal information about yourself. All information is optional and is provided to personalize your KMyMoney file.
km: ប្រើប្រអប់នេះដើម្បីបញ្ចូលព័ត៌មានផ្ទាល់ខ្លួនអំពីខ្លួនអ្នក។ ព័ត៌មានទាំងអស់គឺស្រេចចិត្តហើយត្រូវបានផ្តល់ឱ្យផ្ទាល់ខ្លួននូវ ឯកសារ KMyMoney របស់អ្នក។

source: County/State:
km: ខោនធី / រដ្ឋ៖

# Email address
source: Email:
km: អ៊ីមែល៖

source: Your name:
km: ឈ្មោះ​របស់​អ្នក:

source: Telephone:
km: ទូរស័ព្ទ៖

source: Town:
km: ទីប្រជុំជន៖

source: Load from Addressbook
km: ផ្ទុកពីសៀវភៅអាសយដ្ឋាន

source: During the change of the order your previous entries could not be converted.
km: ក្នុងអំឡុងពេលនៃការផ្លាស់ប្តូរលំដាប់ដែលធាតុមុនរបស់អ្នកមិនអាចបំលែងបាន។

source: This credit-transfer was sent to your bank at %1 therefore cannot be edited anymore. You may create a copy for editing.
km: ការផ្ទេរប្រាក់នេះត្រូវបានផ្ញើទៅធនាគាររបស់អ្នកនៅ %1 ដូច្នេះមិនអាចកែប្រែបានទៀតទេ។ អ្នកអាចបង្កើតច្បាប់ចម្លងសម្រាប់កែសម្រួល។

source: This credit-transfer is not editable. You may create a copy for editing.
km: ការផ្ទេរប្រាក់នេះមិនអាចកែប្រែបានទេ។ អ្នកអាចបង្កើតច្បាប់ចម្លងសម្រាប់កែសម្រួល។

source: Order Account
km: គណនីបញ្ជាទិញ

source: Account Balance
km: សមតុល្យ​គណនី

source: Credit Transfer
km: ការផ្ទេរប្រាក់

source: <html><head/><body><p>This account does not support online banking.</p><p>If you think this is an error, please check if the plugin for this type of credit transfer and your online banking plugins are available.</p></body></html>
km: <html><head/><body><p> គណនីនេះមិនគាំទ្រដល់សេវាកម្មធនាគារតាមអ៊ីនធឺណិតទេ។ </p><p> ប្រសិនបើអ្នកគិតថានេះជាកំហុសសូមពិនិត្យមើលថាតើកម្មវិធីជំនួយសម្រាប់ការផ្ទេរប្រាក់ប្រភេទនេះនិងកម្មវិធីជំនួយធនាគារតាមអ៊ីនធឺណិតអាចប្រើបានទេ។ </p></body></html>

source: Enqueue
km: សញ្ជ័យ

source: Send
km: ផ្ញើ

source: To be able to merge previous selected payees, please select a payee from the list below or create a new one.
km: ដើម្បីអាចច្របាច់បញ្ចូលអ្នកបង់ប្រាក់ដែលបានជ្រើសរើសពីមុនសូមជ្រើសរើសអ្នកទទួលប្រាក់ពីបញ្ជីខាងក្រោមឬបង្កើតថ្មី។

source: The transactions associated with the selected payees need to be re-assigned to a different payee before the selected payees can be deleted. Please select a payee from the list below.
km: ប្រតិបត្តិការដែលទាក់ទងនឹងអ្នកបង់ប្រាក់ដែលបានជ្រើសរើសចាំបាច់ត្រូវប្រគល់ឱ្យអ្នកទទួលប្រាក់ផ្សេងមុនពេលលុបចោលនូវអ្នកបង់ប្រាក់ដែលបានជ្រើសរើស។ សូមជ្រើសរើសអ្នកបង់ប្រាក់ពីបញ្ជីខាងក្រោម។

source: This dialog does not allow new payees to be created. Please pick a payee from the list.
km: ប្រអប់នេះមិនអនុញ្ញាតឱ្យបង្កើតអ្នកបង់ប្រាក់ថ្មីទេ។ សូមជ្រើសរើសអ្នកបង់ប្រាក់ពីបញ្ជី។

source: Payee creation
km: ការបង្កើតអ្នកទទួលប្រាក់

source: Reassign payees
km: ចាត់តាំងអ្នកបង់ប្រាក់

source: Available payees:
km: អ្នកបង់ប្រាក់ដែលមាន៖

source: Assign deleted names to the above selected payee's matching list
km: ចាត់ឈ្មោះដែលត្រូវបានលុបចោលទៅក្នុងបញ្ជីផ្គូផ្គងរបស់អ្នកបង់ប្រាក់ដែលបានជ្រើសរើសខាងលើ

source: Report Configuration
km: កំណត់រចនាសម្ព័ន្ធរបាយការណ៍

# @info:tooltip for report configuration apply button
source: Apply the configuration changes to the report
km: អនុវត្តការផ្លាស់ប្តូរការកំណត់រចនាសម្ព័ន្ធចំពោះរបាយការណ៍

source: Report
km: របាយការណ៍

source: Rows/Columns
km: ជួរដេក / ជួរឈរ

source: Chart
km: គំនូសតាង

# @item the columns will display monthly data
source: Monthly
km: ប្រចាំខែ

# All accounts
source: All
km: ទាំងអស់

source: Top-Level
km: កម្រិតកំពូល

source: Groups
km: ក្រុម

source: Totals
km: សរុប

source: Income & Expenses
km: ចំណូលចំណាយ

source: Assets & Liabilities
km: ទ្រព្យសម្បត្តិដែលអាចទទួលយកបាន

# @item the columns will display daily data
source: Daily
km: រាល់ថ្ងៃ

# @item the columns will display weekly data
source: Weekly
km: ប្រចាំសប្តាហ៍

# @item the columns will display bi-monthly data
source: Bi-Monthly
km: ប្រចាំខែ

# @item the columns will display quarterly data
source: Quarterly
km: ប្រចាំត្រីមាស

# @item the columns will display yearly data
source: Yearly
km: ប្រចាំឆ្នាំ

source: Top Categories
km: ប្រភេទកំពូល ៗ

source: Top Accounts
km: គណនីកំពូល

source: Month
km: ខែ

source: Week
km: សប្តាហ៍

source: Qt SQL driver %1 is no longer installed on your system
km: កម្មវិធីបញ្ជា Qt SQL %1 លែងតំឡើងនៅលើប្រព័ន្ធរបស់អ្នកទៀតហើយ

source: KMyMoney - Select Database
km: KMyMoney - ជ្រើសរើសមូលដ្ឋានទិន្នន័យ

source: PLEASE NOTE
km: សូម​ចំណាំ

source: This software is still in an experimental stage, and there are still some known response time problems. Please be patient; we are working on them. As always, please make sure you have adequate backups of your data.
km: សូហ្វវែរនេះកំពុងស្ថិតក្នុងដំណាក់កាលពិសោធន៍នៅឡើយហើយនៅតែមានបញ្ហាពេលវេលាឆ្លើយតបមួយចំនួនដែលគេដឹង។ សូម​អត់ធ្មត់; យើងកំពុងធ្វើការលើពួកគេ។ ដូចរាល់ដងសូមប្រាកដថាអ្នកមានព័ត៌មានបម្រុងទុកគ្រប់គ្រាន់។

source: File (SQLite only)
km: ឯកសារ (តែ SQLite)

# @title user name of the database
source: Username
km: ឈ្មោះ​អ្នកប្រើប្រាស់

source: Preload &all data
km: ផ្ទុកទិន្នន័យទាំងអស់ជាមុន

source: Select Transaction
km: ជ្រើសរើសប្រតិបត្តិការ

source: Select a transaction and press the OK button or use Cancel to select none.
km: ជ្រើសរើសប្រតិបត្តិការហើយចុចប៊ូតុងយល់ព្រមឬប្រើបោះបង់ដើម្បីជ្រើសរើស។

source: Sort options
km: តម្រៀបជម្រើស

source: Use default
km: ការ​ប្រើ​ប្រាស់​លំនាំ​ដើម

source: Correct splits
km: បំបែកត្រឹមត្រូវ

source: How do you want to proceed?
km: តើអ្នកចង់ធ្វើដូចម្តេច?

source: Continue to edit splits
km: បន្តកែសម្រួលការបែងចែក

source: Change total amount of transaction to %1.
km: ផ្លាស់ប្តូរចំនួនប្រតិបត្តិការសរុបទៅ %1 ។

source: Distribute difference of %1 among all splits.
km: ចែកចាយភាពខុសគ្នានៃ %1 ក្នុងចំណោមការបែងចែកទាំងអស់។

source: Leave %1 unassigned.
km: ទុកឱ្យ %1 មិនបានដាក់។

source: Clear &All
km: លុបចេញ​ទាំងអស់

source: Clear all splits
km: ជម្រះការបំបែកទាំងអស់

source: Use this to clear all splits of this transaction
km: ប្រើវាដើម្បីលុបការបែងចែកទាំងអស់នៃប្រតិបត្តិការនេះ

source: Clear &Zero
km: ជម្រះសូន្យ

source: Removes all splits that have a value of zero
km: យកការបំបែកទាំងអស់ដែលមានតំលៃសូន្យចេញ

source: &Merge
km: បញ្ចូលគ្នា

source: Merges splits with the same category to one split
km: ការបញ្ចូលគ្នាបញ្ចូលគ្នាជាមួយប្រភេទតែមួយទៅមួយបំបែក

source: In case you have multiple split entries to the same category and you like to keep them as a single split, press this button. The amount for identical categories will be added and stored in a single split for that category.
km: ក្នុងករណីដែលអ្នកមានធាតុបំបែកជាច្រើនទៅប្រភេទតែមួយហើយអ្នកចង់រក្សាទុកវាជាការបំបែកតែមួយចុចប៊ូតុងនេះ។ ចំនួនទឹកប្រាក់សម្រាប់ប្រភេទដូចគ្នាបេះបិទនឹងត្រូវបានបន្ថែមនិងរក្សាទុកនៅក្នុងការបំបែកតែមួយសម្រាប់ប្រភេទនោះ។

source: The total amount of this transaction is %1 while the sum of the splits is %2. The remaining %3 are unassigned.
km: ចំនួនទឹកប្រាក់សរុបនៃប្រតិបត្តិការនេះគឺ %1 ខណៈពេលដែលផលបូកនៃការបែងចែកគឺ %2 ។ %3 ដែលនៅសេសសល់មិនត្រូវបានចាត់តាំង។

source: Change &total amount of transaction to %1.
km: ផ្លាស់ប្តូរចំនួនប្រតិបត្តិការសរុបទៅ %1 ។

source: &Distribute difference of %1 among all splits.
km: ចែកចាយភាពខុសគ្នានៃ %1 ក្នុងចំណោមការបែងចែកទាំងអស់។

source: &Leave total amount of transaction at %1.
km: ទុកចំនួនប្រតិបត្តិការសរុបនៅ %1 ។

source: &Leave %1 unassigned.
km: ទុកឱ្យ %1 មិនបានដាក់។

source: You are about to delete all splits of this transaction. Do you really want to continue?
km: អ្នករៀបនឹងលុបការបំបែកទាំងអស់នៃប្រតិបត្តិការនេះ។ តើអ្នកពិតជាចង់បន្តទេ?

source: Split transaction
km: បំបែកប្រតិបត្តិការ

source: <b>11,00<b>
km: <b> ១១,០០ <b>

source: <b>111,00<b>
km: <b> ១១១,០០ <b>

source: Unassigned
km: មិនបានចាត់តាំង

source: Sum of splits
km: ផលបូកនៃការបែងចែក

source: This dialog does not allow new tags to be created. Please pick a tag from the list.
km: ប្រអប់នេះមិនអនុញ្ញាតឱ្យបង្កើតស្លាកថ្មីទេ។ សូមជ្រើសស្លាកពីបញ្ជី។

source: Tag creation
km: ការបង្កើតស្លាក

source: Reassign tags
km: ដាក់ស្លាកឡើងវិញ

source: The transactions associated with the selected tags need to be re-assigned to a different tag before the selected tags can be deleted. Please select a tag from the list below.
km: ប្រតិបត្តិការដែលទាក់ទងនឹងស្លាកដែលបានជ្រើសរើសចាំបាច់ត្រូវផ្តល់ទៅឱ្យស្លាកផ្សេងវិញមុនពេលស្លាកដែលបានជ្រើសរើសអាចត្រូវបានលុបចោល។ សូមជ្រើសរើសស្លាកពីបញ្ជីខាងក្រោម។

source: Available tags:
km: ស្លាកដែលមាន៖

source: Template Export Attributes
km: គុណលក្ខណៈនាំចេញគំរូ

source: Short description
km: ការពិពណ៌នាខ្លី

source: Long Description
km: ការពិពណ៌នាវែង

source: Title
km: ចំណងជើង

source: New price entry
km: ការបញ្ចូលតម្លៃថ្មី

# New profile
source: &New
km: ថ្មី

source: Use this to create a new QIF import/export profile
km: ប្រើវាដើម្បីបង្កើតទម្រង់នាំចូល / នាំចេញ QIF ថ្មី

source: QIF Profile Editor
km: កម្មវិធីនិពន្ធពត៌មាន QIF

source: QIF Profile Selector
km: ឧបករណ៍ជ្រើសរើសទម្រង់ QIF

source: The default QIF profile
km: ទម្រង់ QIF លំនាំដើម

source: Enter new profile name
km: បញ្ចូលឈ្មោះប្រវត្តិរូបថ្មី

source: Do you really want to delete profile '%1'?
km: តើអ្នកពិតជាចង់លុបប្រវត្តិរូប '%1' ឬ?

# @title QIF profile general information
source: General
km: ទូទៅ

source: Void mark
km: សញ្ញាវង្វេងបាត់

source: Opening Balance text
km: ការបើកអត្ថបទសមតុល្យ

source: Type field text
km: វាយអត្ថបទវាល

source: Account delimiter
km: ដែនកំណត់គណនី

source: Description
km: ការពិពណ៌នា

source: Attempt to match similar transactions
km: ប៉ុនប៉ងផ្គូរផ្គងប្រតិបត្តិការស្រដៀងគ្នា

source: Filter
km: ត្រង

source: Output filter location
km: ទីតាំងតម្រងលទ្ធផល

source: Input filter file type
km: ប្រភេទឯកសារតម្រងបញ្ចូល

source: Input filter location
km: បញ្ចូលទីតាំងតម្រង

source: The format of the dates in the QIF file.
km: ទ្រង់ទ្រាយនៃកាលបរិច្ឆេទនៅក្នុងឯកសារ QIF ។

source: Date Format
km: ទ្រង់ទ្រាយកាលបរិច្ឆេទ

source: If a QIF file contains date entries with years represented with two digits then either an apostrophe or a slash may be used to delimit the year in the dates for certain centuries. This enables 1905 to be distinguished from 2005. Specify here which range of years will have year delimited by an apostrophe (eg. for Quicken this is usually 1900-1949).
km: ប្រសិនបើឯកសារ QIF មានធាតុកាលបរិច្ឆេទជាមួយឆ្នាំដែលមានលេខពីរខ្ទង់នោះសញ្ញាអក្សររត់ឬសញ្ញាទ្រេតអាចត្រូវបានប្រើដើម្បីកំណត់ឆ្នាំក្នុងកាលបរិច្ឆេទសម្រាប់សតវត្សជាក់លាក់។ នេះបញ្ជាក់ថាឆ្នាំ ១៩០៥ អាចត្រូវបានគេសម្គាល់ពីឆ្នាំ ២០០៥។ បញ្ជាក់នៅទីនេះថាតើឆ្នាំណាដែលនឹងត្រូវបានកំណត់ព្រំដែនឆ្នាំដោយនិក្ខេបបទ (ឧទាហរណ៍សំរាប់ឃ្វីននេះជាទូទៅគឺឆ្នាំ ១៩០០-១៩៤៩) ។

source: Apostrophe Handling
km: Handrophe Handling

source: Amounts
km: បរិមាណ

# @title header of the QIF field name column
source: Field
km: វាល

source: Decimal Symbol
km: និមិត្តសញ្ញាទសភាគ

source: Thousand Delimiter
km: អ្នកកំណត់ព្រំដែនពាន់នាក់

source: SortColumnInvisible
km: តម្រៀបជួរឈរមិនអាចមើលឃើញ

source: Split-Value
km: ពុះ - តម្លៃ

source: Commission
km: គណៈកម្មការ

source: Thousands Separator
km: អ្នកបំបែកខ្ទង់ពាន់

# @action create new profile
source: New
km: ថ្មី

source: Rename
km: ប្តូរឈ្មោះ

source: Reset
km: កំណត់ឡើងវិញ

source: Color settings
km: ការកំណត់ពណ៌

source: Foreground
km: ផ្ទៃខាងមុខ

source: Text colors
km: ពណ៌អត្ថបទ

source: Grid color
km: ពណ៌ក្រឡាចត្រង្គ

source: Erroneous transaction
km: ប្រតិបត្តិការមិនត្រឹមត្រូវ

source: Value with missing conversion rate
km: តម្លៃជាមួយនឹងអត្រាបម្លែងបាត់

source: Negative value
km: តម្លៃអវិជ្ជមាន

# @title background colors
source: Background
km: សាវតា

source: Use system colors
km: ប្រើពណ៌ប្រព័ន្ធ

source: List background colors
km: រាយពណ៌ផ្ទៃខាងក្រោយ

# @label normal color
source: Normal
km: ធម្មតា

# @label alternate color
source: Alternate
km: ជំនួស

source: Special background colors
km: ពណ៌ផ្ទៃខាងក្រោយពិសេស

source: Ledger group separator
km: អ្នកបំបែកក្រុមលីតឌឺ

source: Required field
km: វាលដែលត្រូវការ

source: Imported transaction
km: ប្រតិបត្តិការដែលបាននាំចូល

source: Matched transaction
km: ប្រតិបត្តិការត្រូវគ្នា

source: Font settings
km: ការកំណត់ពុម្ពអក្សរ

source: Use system fonts
km: ប្រើពុម្ពអក្សរប្រព័ន្ធ

source: Individual font settings
km: ការកំណត់ពុម្ពអក្សរនីមួយៗ

source: Cell font
km: ពុម្ពអក្សរក្រឡា

source: Header font
km: ពុម្ពអក្សរក្បាល

source: Forecast Settings
km: ការកំណត់ព្យាករណ៍

source: Number of Days of Account Cycle:
km: ចំនួនថ្ងៃនៃវដ្តគណនី៖

source: Day of Month to start Forecast:
km: ថ្ងៃនៃខែដើម្បីចាប់ផ្តើមព្យាករណ៍៖

source: Number of Days to Forecast:
km: ចំនួនថ្ងៃដែលត្រូវព្យាករណ៍៖

source: Forecast Method
km: វិធីសាស្ត្រព្យាករណ៍

source: Scheduled and Future Transactions
km: គ្រោងការណ៍និងប្រតិបត្តិការអនាគត

source: History-based
km: ផ្អែកលើប្រវត្តិសាស្ត្រ

source: History-based settings
km: ការកំណត់ផ្អែកលើប្រវត្តិ

source: Number of Cycles to use in Forecast:
km: ចំនួនវដ្តដែលត្រូវប្រើក្នុងការព្យាករណ៍៖

source: History Forecast Method
km: វិធីសាស្រ្តព្យាករណ៍ប្រវត្តិសាស្រ្ត

source: Simple Moving Average
km: ការផ្លាស់ប្តូរមធ្យមសាមញ្ញ

source: Weighted Moving Average
km: ទំងន់ផ្លាស់ទីមធ្យម

source: Linear Regression
km: តំរែតំរង់លីនេអ៊ែរ

source: Choose file path
km: ជ្រើសរើសផ្លូវឯកសារ

source: General Settings
km: ការកំណត់​ទូទៅ

# @title global settings
source: Global
km: សកល

source: Precision settings
km: ការកំណត់ភាពជាក់លាក់

source: Price precision
km: ភាពត្រឹមត្រូវនៃតម្លៃ

source: digits
km: ខ្ទង់

source: Autosave options
km: ជម្រើសរក្សាទុកដោយស្វ័យប្រវត្តិ

source: Autosave periodically
km: រក្សាទុកដោយស្វ័យប្រវត្តិជាទៀងទាត់

source: minutes
km: នាទី

source: Autosave when file is modified upon close
km: រក្សាទុកដោយស្វ័យប្រវត្តិនៅពេលឯកសារត្រូវបានកែប្រែនៅពេលបិទ

source: Setup number of backups to keep (local file only)
km: តំឡើងចំនួនព័ត៌មានបម្រុងទុកដើម្បីរក្សាទុក (តែឯកសារមូលដ្ឋាន)

source: Whenever the current data is saved into a local file, KMyMoney keeps the selected number of previous states of the file. Set it to 0 to turn the feature off.
km: រាល់ពេលដែលទិន្នន័យបច្ចុប្បន្នត្រូវបានរក្សាទុកទៅក្នុងឯកសារមូលដ្ឋាន KMyMoney រក្សាចំនួនរដ្ឋដែលបានជ្រើសរើសនៃឯកសារមុន។ កំណត់វាទៅ ០ ដើម្បីបិទលក្ខណៈពិសេស។

source: Number of backups to keep (0=off)
km: ចំនួននៃការបម្រុងទុកដែលត្រូវរក្សាទុក (០ = បិទ)

source: Fiscal Year
km: ឆ្នាំសារពើពន្ធ

source: Your fiscal year starts on
km: ឆ្នាំសារពើពន្ធរបស់អ្នកចាប់ផ្តើម

source: January
km: មករា

source: February
km: ខែកុម្ភៈ

source: March
km: មីនា

source: April
km: ខែមេសា

source: May
km: ឧសភា

source: June
km: មិថុនា

source: July
km: ខែកក្កដា

# @item the month August
source: August
km: សីហា

source: September
km: ខែកញ្ញា

source: October
km: តុលា

source: November
km: វិច្ឆិកា

source: December
km: ធ្នូ

source: External programs
km: កម្មវិធីខាងក្រៅ

source: Calculator
km: ម៉ាស៊ីនគិតលេខ

source: Views
km: ទស្សនៈ

source: Startup page options
km: ជម្រើសទំព័រចាប់ផ្តើម

source: Start with homepage
km: ចាប់ផ្តើមជាមួយគេហទំព័រ

source: Start with last selected view
km: ចាប់ផ្តើមជាមួយទិដ្ឋភាពដែលបានជ្រើសរើសចុងក្រោយ

source: Type of the KMyMoney view
km: ប្រភេទនៃទិដ្ឋភាព KMyMoney

source: List
km: បញ្ជី

source: Tree
km: ដើមឈើ

source: Tabbed
km: ផ្ទាំង

source: Show title bar on each page
km: បង្ហាញរបារចំណងជើងនៅលើទំព័រនីមួយៗ

source: Synchronize account selection of ledger and investment view
km: ធ្វើសមកាលកម្មការជ្រើសរើសគណនីសៀវភៅគោលនិងទស្សនៈវិនិយោគ

source: Accounts / Categories
km: គណនី / ប្រភេទ

source: This option hides all categories in the categories view that are not used in at least a single transaction. They are still shown in the category selection lists.
km: ជម្រើសនេះលាក់រាល់ប្រភេទទាំងអស់នៅក្នុងទិដ្ឋភាពប្រភេទដែលមិនត្រូវបានប្រើយ៉ាងហោចណាស់ប្រតិបត្តិការតែមួយ។ ពួកវានៅតែត្រូវបានបង្ហាញនៅក្នុងបញ្ជីជ្រើសរើសប្រភេទ។

source: Do not show unused categories
km: កុំបង្ហាញប្រភេទដែលមិនប្រើ

source: This option hides all accounts that have been closed by the user in views and selection lists. You can use <b>View/Show all accounts</b> to temporarily show hidden accounts in the views.
km: ជម្រើសនេះលាក់គណនីទាំងអស់ដែលត្រូវបានបិទដោយអ្នកប្រើប្រាស់នៅក្នុងបញ្ជីមើលនិងបញ្ជីជ្រើសរើស។ អ្នកអាចប្រើ <b> មើល / បង្ហាញគណនីទាំងអស់ </b> ដើម្បីបង្ហាញគណនីដែលលាក់នៅក្នុងបណ្តោះអាសន្ន។

source: Do not show closed accounts
km: កុំបង្ហាញគណនីបិទ

source: Show equity accounts
km: បង្ហាញគណនីសមធម៌

source: This option will display the categories in the accounts view also.
km: ជម្រើសនេះនឹងបង្ហាញប្រភេទនៅក្នុងទិដ្ឋភាពគណនីផងដែរ។

source: Show categories in the accounts list view
km: បង្ហាញប្រភេទនៅក្នុងទិដ្ឋភាពបញ្ជីគណនី

source: This option hides all finished schedules in the schedules view.
km: ជម្រើសនេះលាក់កាលវិភាគដែលបានបញ្ចប់ទាំងអស់នៅក្នុងទិដ្ឋភាពកាលវិភាគ។

source: Do not show finished schedules
km: កុំបង្ហាញកាលវិភាគដែលបានបញ្ចប់

source: Do not show transactions prior to
km: កុំបង្ហាញប្រតិបត្តិការមុន

source: This option hides all reconciled transactions in the ledger view.
km: ជម្រើសនេះលាក់រាល់ប្រតិបត្តិការដែលមានការផ្សះផ្សានៅក្នុងទិដ្ឋភាពសៀវភៅដឹកនាំ។

source: Do not show reconciled transactions
km: កុំបង្ហាញប្រតិបត្តិការផ្សះផ្សា

source: Support
km: គាំទ្រ

source: Logging
km: ការកាប់ឈើ

source: Log path
km: ផ្លូវកំណត់ហេតុ

source: On choosing a log file path please keep in mind that log files may contain sensitive data (e.g. passwords in clear-text etc).
km: នៅពេលជ្រើសរើសផ្លូវឯកសារកំណត់ហេតុសូមចងចាំថាឯកសារកំណត់ហេតុអាចមានទិន្នន័យរសើប (ឧទាហរណ៍ពាក្យសម្ងាត់ជាអត្ថបទច្បាស់។ ល។ ) ។

source: Log imported statements
km: កំណត់ហេតុនាំចូល

source: Log OFX transactions
km: ប្រតិបត្តិការ OFX កំណត់ហេតុ

source: Other logging options
km: ជម្រើសកាប់ឈើផ្សេងទៀត

source: Set environment variable GWEN_LOGLEVEL=Debug for further debug logging
km: កំណត់អថេរបរិស្ថាន GWENLOGLEVEL = បំបាត់កំហុសសម្រាប់ការចុះកំណត់ហេតុកំហុសបន្ថែមទៀត

source: Set environment variable AQBANKING_LOGLEVEL=debug for further logging
km: កំណត់អថេរបរិស្ថាន AQBANKINGLOGLEVEL = បំបាត់កំហុសសម្រាប់ការកាប់ឈើបន្ថែមទៀត

source: <p>You have turned on the GPG encryption support. This means, that new files will be stored encrypted.</p><p>Existing files will not be encrypted automatically. To achieve encryption of existing files, please use the <b>File/Save as...</b> feature and store the file under a different name.<br/>Once confident with the result, feel free to delete the old file and rename the encrypted one to the old name.</p>
km: <p> អ្នកបានបើកការគាំទ្រការអ៊ិនគ្រីប GPG ។ មធ្យោបាយនេះ, ថាឯកសារថ្មីនឹងត្រូវបានរក្សាទុកអ៊ិនគ្រីប។ </p><p> ឯកសារដែលមានស្រាប់នឹងមិនត្រូវបានអ៊ិនគ្រីបដោយស្វ័យប្រវត្តិទេ។ ដើម្បីសម្រេចបាននូវការអ៊ិនគ្រីបឯកសារដែលមានស្រាប់សូមប្រើឯកសារ <b> ឯកសារ / រក្សាទុកជា ... </b> លក្ខណៈពិសេសនិងរក្សាទុកឯកសារក្រោមឈ្មោះផ្សេង។ <br/> នៅពេលមានទំនុកចិត្តជាមួយនឹងលទ្ធផលសូមមានអារម្មណ៍ដោយឥតគិតថ្លៃដើម្បីលុបឯកសារចាស់ហើយប្តូរឈ្មោះឯកសារដែលបានអ៊ិនគ្រីបទៅជាឈ្មោះចាស់។ </p>

source: GPG encryption activated
km: ការដាក់លេខកូដ GPG ត្រូវបានធ្វើឱ្យសកម្ម
