Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

source: KMyMoney creates a schedule for this payment and reminds you whenever a payment must be made. Please select the account to/from which payments will be made and the category the interest will be assigned to.<p> If you selected to record all payments this date has already been supplied. If you selected to record only this years payments, then the <b>First payment due date</b> is the date of the first payment made in this year.
km: ខេអិមមីនីបង្កើតកាលវិភាគសម្រាប់ការបង់ប្រាក់នេះហើយរំyouកអ្នករាល់ពេលដែលការទូទាត់ត្រូវតែធ្វើឡើង។ សូមជ្រើសរើសគណនីទៅ / ពីការទូទាត់ណាមួយដែលនឹងត្រូវបានធ្វើនិងប្រភេទការប្រាក់នឹងត្រូវបានកំណត់។ <p> ប្រសិនបើអ្នកបានជ្រើសរើសដើម្បីកត់ត្រារាល់ការបង់ប្រាក់កាលបរិច្ឆេទនេះត្រូវបានផ្គត់ផ្គង់រួចហើយ។ ប្រសិនបើអ្នកបានជ្រើសរើសដើម្បីកត់ត្រាការបង់ប្រាក់នៅឆ្នាំនេះបន្ទាប់មកលេខ <b> កាលបរិច្ឆេទទូទាត់ដំបូង </b> គឺជាកាលបរិច្ឆេទនៃការទូទាត់ប្រាក់លើកដំបូងនៅឆ្នាំនេះ។

source: Interest category
km: ប្រភេទចំណាប់អារម្មណ៍

source: The category the interest part of the payment will be assigned to. If you borrow money you usually have to pay interest, so this should be an expense category. If you lend the money, you receive the interest. In this case, select an income category here.
km: ប្រភេទផ្នែកការប្រាក់នៃការទូទាត់នឹងត្រូវបានកំណត់។ ប្រសិនបើអ្នកខ្ចីលុយអ្នកច្រើនតែត្រូវបង់ការប្រាក់ដូច្នេះនេះគួរតែជាប្រភេទចំណាយ។ ប្រសិនបើអ្នកឱ្យប្រាក់អ្នកនឹងទទួលបានការប្រាក់។ ក្នុងករណីនេះសូមជ្រើសរើសប្រភេទប្រាក់ចំណូលនៅទីនេះ។

source: Payment account
km: គណនីទូទាត់

source: Select the account from which you make your periodical payments or where you receive regular payments in case you lend the money. In most cases, this is a checking account.
km: ជ្រើសរើសគណនីដែលអ្នកទូទាត់តាមកាលកំណត់ឬកន្លែងដែលអ្នកទទួលការទូទាត់ទៀងទាត់ក្នុងករណីដែលអ្នកអោយខ្ចីប្រាក់។ ក្នុងករណីភាគច្រើននេះគឺជាគណនីត្រួតពិនិត្យ។

source: First payment due on
km: ការទូទាត់មុនពេលកំណត់

source: KMyMoney New Account Setup
km: រៀបចំគណនីថ្មីខេខេម៉ីនី

source: Broker
km: ឈ្មួញកណ្តាល

source: Payout
km: ការសង

source: Parent Account
km: គណនីមេ

source: Credit card payment
km: ការទូទាត់កាតឥណទាន

source: Loan payment for %1
km: ការទូទាត់ប្រាក់កម្ចីសម្រាប់ %1

source: Loan payment
km: ការទូទាត់ប្រាក់កម្ចី

source: Amortization
km: ការរំលោះ

source: Please make sure to enter the correct conversion for the selected opening date. If you requested an online quote it might be provided for a different date.
km: សូមប្រាកដថាបានបញ្ចូលការបំលែងត្រឹមត្រូវសម្រាប់កាលបរិច្ឆេទបើកដែលបានជ្រើសរើស។ ប្រសិនបើអ្នកស្នើសុំសម្រង់តាមអ៊ីនធឺណិតវាអាចត្រូវបានផ្តល់ជូនសម្រាប់កាលបរិច្ឆេទផ្សេង។

source: Check date
km: កាលបរិច្ឆេទពិនិត្យ

source: 1 %1 equals %2
km: 1 %1 ស្មើ %2

source: Conversion rate is not positive
km: អត្រានៃការប្រែចិត្តជឿមិនមានលក្ខណៈវិជ្ជមានទេ

source: No account name supplied
km: មិនមានការផ្តល់ឈ្មោះគណនីទេ

source: Credit Card %1 monthly payment
km: កាតឥណទាន %1 ការទូទាត់ប្រចាំខែ

source: Finish entry and create account
km: បញ្ចប់ការបញ្ចូលនិងបង្កើតគណនី

source: Finish entry and create account and schedule
km: បញ្ចប់ការបញ្ចូលនិងបង្កើតគណនីនិងកាលវិភាគ

source: Next due date is prior to opening date
km: កាលបរិច្ឆេទកំណត់បន្ទាប់គឺមុនកាលបរិច្ឆេទបើក

source: No account selected
km: គ្មានគណនីត្រូវបានជ្រើសរើសទេ

source: No amount for payment selected
km: មិនមានចំនួនទឹកប្រាក់សម្រាប់ការទូទាត់ដែលបានជ្រើសរើស

source: No payee for payment selected
km: មិនមានអ្នកបង់ប្រាក់សម្រាប់ការទូទាត់ដែលបានជ្រើសរើសទេ

source: No name assigned for schedule
km: គ្មានឈ្មោះដែលបានកំណត់សម្រាប់កាលវិភាគទេ

source: No payee supplied
km: មិនមានអ្នកផ្តល់ប្រាក់ខែទេ

source: No opening balance supplied
km: មិនមានតុល្យភាពបើកទេ

source: An interest change can only happen after the first payment
km: ការផ្លាស់ប្តូរការប្រាក់អាចកើតឡើងតែបន្ទាប់ពីការទូទាត់លើកដំបូង

source: Months
km: ខែ

source: Years
km: ឆ្នាំ

source: KMyMoney has calculated the amount of the loan as %1.
km: ខេអិមមីនីបានគណនាចំនួនប្រាក់កម្ចីជា %1 ។

source: KMyMoney has calculated the interest rate to %1%.
km: ខេអិមមីនីបានគណនាអត្រាការប្រាក់ទៅ %1 % ។

source: KMyMoney has calculated a periodic payment of %1 to cover principal and interest.
km: ខេអិមម៉ាន់នីបានគណនាការទូទាត់តាមពេលវេលា %1 ដើម្បីទូទាត់ការប្រាក់និងការប្រាក់។

source: The number of payments has been decremented and the balloon payment has been modified to %1.
km: ចំនួននៃការទូទាត់ត្រូវបានថយចុះហើយការទូទាត់ប៉េងប៉ោងត្រូវបានកែប្រែទៅជា %1 ។

source: The balloon payment has been modified to %1.
km: ការទូទាត់ប៉េងប៉ោងត្រូវបានកែប្រែទៅជា %1 ។

source: KMyMoney has calculated the term of your loan as %1.
km: ខេអិមមីនីបានគណនារយៈពេលនៃប្រាក់កម្ចីរបស់អ្នកជា %1 ។

source: KMyMoney has calculated a balloon payment of %1 for this loan.
km: ខេអិមមីនីបានគណនាការទូទាត់ប៉េងប៉ោង %1 សម្រាប់ប្រាក់កម្ចីនេះ។

source: KMyMoney has successfully verified your loan information.
km: ខេមីមីនីបានផ្ទៀងផ្ទាត់ព័ត៌មានប្រាក់កម្ចីរបស់អ្នកដោយជោគជ័យ។

source: You have entered mis-matching information. Please modify your figures or leave one value empty to let KMyMoney calculate it for you
km: អ្នកបានបញ្ចូលព័ត៌មានដែលត្រូវគ្នា។ សូមកែប្រែតួលេខរបស់អ្នកឬទុកតំលៃមួយអោយនៅទទេដើម្បីអោយ KMyMoney ធ្វើការគណនាសំរាប់អ្នក

source: Calculation error
km: កំហុសក្នុងការគណនា

source: Accept this or modify the loan information and recalculate.
km: ទទួលយកនេះឬកែប្រែព័ត៌មានប្រាក់កម្ចីនិងគណនាឡើងវិញ។

source: Calculation successful
km: ការគណនាបានជោគជ័យ

source: one month
km: មួយ​ខែ

source: one year
km: មួយ​ឆ្នាំ

source: one payment
km: ការទូទាត់មួយ

source: Press Calculate to verify the values
km: ចុចគណនាដើម្បីផ្ទៀងផ្ទាត់តម្លៃ

source: Not all details supplied
km: មិនមានពត៌មានលំអិតទាំងអស់ត្រូវបានផ្គត់ផ្គង់ទេ

source: Create a new asset account
km: បង្កើតគណនីទ្រព្យថ្មី

source: If the asset account does not yet exist, press this button to create it.
km: ប្រសិនបើគណនីទ្រព្យសម្បត្តិមិនទាន់មានសូមចុចប៊ូតុងនេះដើម្បីបង្កើតវា។

source: Account information
km: ព​ត៌​មាន​គណនី

# Account name
source: Name: %1
km: ឈ្មោះ៖ %1

source: Subaccount of %1
km: ចំនួនរងនៃ %1

source: Type: %1
km: ប្រភេទ: %1

source: Currency: %1
km: រូបិយប័ណ្ណ: %1

source: Opening date: %1
km: កាលបរិច្ឆេទបើក៖ %1

source: Conversion rate: %1
km: អត្រាបំលែង: %1

source: Opening balance: %1
km: សមតុល្យបើក: %1

source: Institution: %1
km: ស្ថាប័ន៖ %1

source: Number: %1
km: លេខ៖ %1

source: Brokerage Account
km: គណនីឈ្មួញជើងសា

# Account name
source: Name: %1 (Brokerage)
km: ឈ្មោះ៖ %1 (ឈ្មួញជើងសា)

source: Loan information
km: ព័ត៌មានប្រាក់កម្ចី

source: Amount borrowed: %1
km: ចំនួនទឹកប្រាក់ដែលបានខ្ចី: %1

source: Amount lent: %1
km: ចំនួនទឹកប្រាក់ដែលត្រូវបានផ្តល់ជូន: %1

source: Interest rate: %1 %
km: អត្រាការប្រាក់៖ %1 %

source: Interest rate is %1
km: អត្រាការប្រាក់គឺ %1

source: Principal and interest: %1
km: គោលការណ៍និងចំណាប់អារម្មណ៍: %1

source: Additional Fees: %1
km: ថ្លៃឈ្នួលបន្ថែម៖ %1

source: Payment frequency: %1
km: ភាពញឹកញាប់នៃការទូទាត់: %1

source: Payment account: %1
km: គណនីទូទាត់: %1

source: Payout information
km: ព័ត៌មានទូទាត់

source: Refinance: %1
km: ការឆ្លុះបញ្ចាំង: %1

source: Transfer amount to %1
km: ផ្ទេរចំនួនទឹកប្រាក់ទៅ %1

source: Transfer amount from %1
km: ចំនួនទឹកប្រាក់ផ្ទេរពី %1

source: Payment date: %1
km: កាលបរិច្ឆេទទូទាត់៖ %1

source: Schedule information
km: ព័ត៌មានអំពីកាលវិភាគ

# Schedule name
source: Name: %1
km: ឈ្មោះ៖ %1

source: Occurrence: Monthly
km: កើតឡើង៖ ប្រចាំខែ

source: Paid from %1
km: បង់ប្រាក់ពី %1

source: Pay to %1
km: បង់ទៅ %1

source: Amount: %1
km: ចំនួនទឹកប្រាក់: %1

source: First payment due on %1
km: ការទូទាត់ប្រាក់លើកដំបូងនៅលើ %1

source: Payment method: %1
km: វិធីទូទាត់: %1

source: Occurrence: %1
km: កើតឡើង៖ %1

source: For credit card accounts you can create a monthly schedule which will automatically remind you about the payment. Please fill in the details about this payment here.
km: សម្រាប់គណនីកាតឥណទានអ្នកអាចបង្កើតកាលវិភាគប្រចាំខែដែលនឹងរំលឹកអ្នកដោយស្វ័យប្រវត្តិអំពីការទូទាត់។ សូមបំពេញព័ត៌មានលំអិតអំពីការបង់ប្រាក់នេះនៅទីនេះ។

source: Yes, remind me when the payment is due
km: បាទ / ចាសសូមរំmeកខ្ញុំនៅពេលការទូទាត់ត្រូវដល់

source: Name of schedule
km: ឈ្មោះកាលវិភាគ

source: Estimated monthly payment
km: ការទូទាត់ប្រចាំខែប៉ាន់ស្មាន

source: Due date of next payment
km: កាលបរិច្ឆេទដល់កំណត់នៃការទូទាត់បន្ទាប់

source: Payment should be made from account
km: ការទូទាត់គួរតែត្រូវបានធ្វើឡើង ពីគណនី

source: Investment details
km: ព័ត៌មានលម្អិតអំពីការវិនិយោគ

source: Enter the details below and click <b>Next</b> to continue entering the online update details.
km: បញ្ចូលព័ត៌មានលម្អិតខាងក្រោមហើយចុច <b> បន្ទាប់ </b> ដើម្បីបន្តបញ្ចូលព័ត៌មានលំអិតបច្ចុប្បន្នភាពតាមអ៊ីនធឺណិត។

source: Trading symbol
km: និមិត្តសញ្ញាជួញដូរ

source: Enter the ticker symbol (e.g. RHAT).
km: បញ្ចូលនិមិត្តសញ្ញាគូសធីក (ឧទាហរណ៍ RHAT) ។

source: Full name
km: ឈ្មោះ​ពេញ

source: Trading market
km: ទីផ្សារជួញដូរ

source: Identification
km: ការកំណត់អត្តសញ្ញាណ

source: Enter the CUSIP/ISIN/WKN identification number here
km: បញ្ចូលលេខសម្គាល់ CUSIP / ISIN / WKN នៅទីនេះ

source: Trading Currency
km: រូបិយប័ណ្ណជួញដូរ

source: Investment Type
km: ប្រភេទវិនិយោគ

source: This wizard allows you to create a new investment.
km: អ្នកជំនួយការនេះអនុញ្ញាតឱ្យអ្នកបង្កើតការវិនិយោគថ្មី។

source: The first step in this process requires to select the type of investment. The following steps collect more details about the investment from you.
km: ជំហានដំបូងនៃដំណើរការនេះតម្រូវឱ្យជ្រើសរើសប្រភេទវិនិយោគ។ ជំហានខាងក្រោមប្រមូលព័ត៌មានលម្អិតបន្ថែមអំពីការវិនិយោគពីអ្នក។

source: Type of investment
km: ប្រភេទនៃការវិនិយោគ

source: Investment detail wizard
km: អ្នកជំនួយការលម្អិតការវិនិយោគ

source: Security detail wizard
km: អ្នកជំនួយការលម្អិតសុវត្ថិភាព

source: This wizard allows you to modify the selected investment.
km: អ្នកជំនួយការនេះអនុញ្ញាតឱ្យអ្នកកែប្រែការវិនិយោគដែលបានជ្រើសរើស។

source: This wizard allows you to modify the selected security.
km: អ្នកជំនួយការនេះអនុញ្ញាតឱ្យអ្នកកែប្រែសុវត្ថិភាពដែលបានជ្រើសរើស។

source: The selected symbol is already on file. Do you want to reuse the existing security?
km: និមិត្តសញ្ញាដែលបានជ្រើសរើសមាននៅក្នុងឯកសាររួចហើយ។ តើអ្នកចង់ប្រើសុវត្ថិភាពដែលមានស្រាប់ឡើងវិញទេ?

source: Security found
km: រកឃើញសុវត្ថិភាព

source: Unable to create all objects for the investment
km: មិនអាចបង្កើតវត្ថុទាំងអស់សម្រាប់ការវិនិយោគបានទេ

source: New Investment wizard
km: អ្នកជំនួយការវិនិយោគថ្មី

source: Online Update
km: ការធ្វើបច្ចុប្បន្នភាពលើអ៊ីនធឺណិត

source: Select an online source and click <b>Finish</b> to store the investment data. If you do not want to use online updates, just leave the data as is.
km: ជ្រើសប្រភពលើអ៊ីនធឺណិតហើយចុច <b> បញ្ចប់ </b> ដើម្បីរក្សាទុកទិន្នន័យវិនិយោគ។ ប្រសិនបើអ្នកមិនចង់ប្រើបច្ចុប្បន្នភាពតាមអ៊ិនធរណេតទេគ្រាន់តែទុកទិន្នន័យឱ្យនៅដដែល។

source: Use Finance::Quote
km: ប្រើហិរញ្ញវត្ថុ :: ដកស្រង់

source: Online Source
km: ប្រភពលើអ៊ីនធឺណិត

source: Factor
km: កត្តា

source: &Additional fees...
km: ថ្លៃសេវាបន្ថែម ...

source: Enter additional fees
km: បញ្ចូលថ្លៃសេវាបន្ថែម

source: Use this to add any additional fees other than principal and interest contained in your periodical payments.
km: ប្រើវាដើម្បីបន្ថែមថ្លៃបន្ថែមផ្សេងទៀតក្រៅពីប្រាក់ដើមនិងការប្រាក់ដែលមាននៅក្នុងការបង់ប្រាក់តាមកាលកំណត់របស់អ្នក។

source: If your regular payment contains any additional fees, click on the button "Additional fees" to enter them.
km: ប្រសិនបើការទូទាត់ទៀងទាត់របស់អ្នកមានថ្លៃបន្ថែមណាមួយសូមចុចលើប៊ូតុង " ថ្លៃបន្ថែម " ដើម្បីបញ្ចូលវា។

source: = periodical payment:
km: = ការទូទាត់តាមកាលកំណត់៖

source: Principal + Interest:
km: នាយកសាលា + ចំណាប់អារម្មណ៍៖

source: If no additional fees are included in your periodical payment or you have entered all such fees, then click on "Next".
km: ប្រសិនបើគ្មានថ្លៃឈ្នួលបន្ថែមត្រូវបានរួមបញ្ចូលនៅក្នុងការទូទាត់តាមកាលកំណត់របស់អ្នកឬអ្នកបានបញ្ចូលថ្លៃសេវាទាំងអស់បន្ទាប់មកចុចលើ " បន្ទាប់ " ។

source: Use this to create a new account to which the initial payment should be made
km: ប្រើវាដើម្បីបង្កើតគណនីថ្មីមួយដែលការទូទាត់ដំបូងគួរតែត្រូវបានធ្វើឡើង

source: Press this to create a new asset account
km: ចុចវាដើម្បីបង្កើតគណនីទ្រព្យថ្មី

source: Calculation Overview
km: ទិដ្ឋភាពទូទៅនៃការគណនា

source: KMyMoney has calculated the loan as shown in the overview below. You can accept these values by selecting "Next" or change them by choosing "Back" to return to the input field for the information you want to change.
km: KMyMoney បានគណនាប្រាក់កម្ចីដូចដែលបានបង្ហាញនៅក្នុងទិដ្ឋភាពទូទៅខាងក្រោម។ អ្នកអាចទទួលយកតម្លៃទាំងនេះដោយជ្រើសរើស " Next " ឬផ្លាស់ប្តូរវាដោយជ្រើសរើស " Back " ដើម្បីត្រឡប់ទៅវាលបញ្ចូលសម្រាប់ព័ត៌មានដែលអ្នកចង់ផ្លាស់ប្តូរ។

source: Loan amount:
km: ចំនួនប្រាក់កម្ចី៖

source: Interest rate:
km: អត្រា​ការ​ប្រាក់:

source: Term:
km: ពាក្យ៖

source: Final amortization payment
km: ការទូទាត់រំលោះចុងក្រោយ

source: Duration
km: រយៈពេល

source: Please enter the term of this loan or leave the field empty to calculate it. The term is the time that is required to fully repay the loan. This time might be different from the time your loan contract is signed for.
km: សូមបញ្ចូលរយៈពេលនៃប្រាក់កម្ចីនេះឬទុកវាលទំនេរដើម្បីគណនាវា។ រយៈពេលគឺជាពេលវេលាដែលត្រូវសងប្រាក់កម្ចីឱ្យបានពេញលេញ។ ពេលនេះប្រហែលជាខុសគ្នាពីពេលដែលកិច្ចសន្យាខ្ចីប្រាក់របស់អ្នកត្រូវបានចុះហត្ថលេខា។

source: Edit Loan Account Wizard
km: កែសម្រួលអ្នកជំនួយការប្រាក់កម្ចី

source: Welcome to the Edit Loan Account Wizard. Please use this wizard to modify information about your loan account. Please make sure that you have the relevant information handy. You usually get the information out of your contract and the last statement.
km: សូមស្វាគមន៍មកកាន់អ្នកជំនួយការកែសំរួលគណនីកំចី។ សូមប្រើអ្នកជំនួយការនេះដើម្បីកែប្រែព័ត៌មានអំពីគណនីប្រាក់កម្ចីរបស់អ្នក។ សូមប្រាកដថាអ្នកមានព័ត៌មានដែលពាក់ព័ន្ធងាយស្រួល។ ជាធម្មតាអ្នកទទួលបានព័ត៌មានចេញពីកិច្ចសន្យារបស់អ្នកនិងសេចក្តីថ្លែងការណ៍ចុងក្រោយ។

source: Edit selection
km: កែសម្រួលការជ្រើសរើស

source: Please select, which data of the loan you want to modify.
km: សូមជ្រើសរើស, ដែលទិន្នន័យនៃប្រាក់កម្ចីដែលអ្នកចង់កែប្រែ។

source: Modify the interest rate
km: កែប្រែអត្រាការប្រាក់

source: Modify additional fees
km: កែប្រែថ្លៃឈ្នួលបន្ថែម

source: Modify other loan information
km: កែប្រែព័ត៌មានប្រាក់កម្ចីផ្សេងទៀត

source: Modify loan attributes
km: កែប្រែគុណលក្ខណៈប្រាក់កម្ចី

source: Please enter the date from which on the following changes will be effective. The date entered must be later than the opening date of this account (%1), but must not be in the future. The default will be today.
km: សូមបញ្ចូលកាលបរិច្ឆេទដែលការផ្លាស់ប្តូរខាងក្រោមនឹងមានប្រសិទ្ធភាព។ កាលបរិច្ឆេទដែលបានបញ្ចូលត្រូវតែយឺតជាងកាលបរិច្ឆេទបើកគណនីនេះ (%1) ប៉ុន្តែមិនត្រូវនៅថ្ងៃក្រោយ។ លំនាំដើមនឹងមាននៅថ្ងៃនេះ។

source: Effective date
km: កាល​បរិច្ឆេទ​មាន​ប្រសិទ្ធភាព

source: When should the changes become active?
km: តើការផ្លាស់ប្តូរគួរតែសកម្មនៅពេលណា?

source: Please enter the amount of a final amortization payment or leave the field empty to calculate it.
km: សូមបញ្ចូលចំនួនទឹកប្រាក់នៃការសងរំលោះចុងក្រោយឬទុកវាលទំនេរដើម្បីគណនាវា។

source: Please enter the date, the first payment for this loan was/is due.
km: សូមបញ្ចូលកាលបរិច្ឆេទដែលការទូទាត់លើកដំបូងសម្រាប់ប្រាក់កម្ចីនេះគឺដល់កំណត់។

source: Note: Consult the loan contract for details of the first due date. Keep in mind, that the first due date usually differs from the date the contract was signed
km: សម្គាល់ៈប្រឹក្សាយោបល់លើកិច្ចសន្យាប្រាក់កម្ចីសម្រាប់ព័ត៌មានលំអិតនៃកាលបរិច្ឆេទកំណត់ដំបូង។ សូមចងចាំថាកាលបរិច្ឆេទកំណត់ដំបូងជាធម្មតាខុសគ្នាពីកាលបរិច្ឆេទដែលកិច្ចសន្យាត្រូវបានចុះហត្ថលេខា

source: Please enter the date, the first payment for this loan was/is due this year.
km: សូមបញ្ចូលកាលបរិច្ឆេទដែលការទូទាត់លើកដំបូងសម្រាប់ប្រាក់កម្ចីនេះគឺ / នឹងដល់ឆ្នាំនេះ។

source: Note: You can easily figure out the date of the first payment if you consult the last statement of last year.
km: សម្គាល់ៈអ្នកអាចគិតយ៉ាងច្បាស់អំពីកាលបរិច្ឆេទនៃការទូទាត់ប្រាក់លើកដំបូងប្រសិនបើអ្នកពិគ្រោះជាមួយសេចក្តីថ្លែងការណ៍ចុងក្រោយនៃឆ្នាំមុន។

source: Date of first payment
km: កាលបរិច្ឆេទនៃការទូទាត់លើកដំបូង

source: Interest calculation
km: ការគណនាការប្រាក់

source: When does the actual interest rate get calculated?
km: តើអត្រាការប្រាក់ពិតប្រាកដត្រូវបានគណនានៅពេលណា?

source: When the payment is received.
km: នៅពេលការទូទាត់ត្រូវបានទទួល។

source: When the payment is due.
km: នៅពេលការទូទាត់ត្រូវដល់កំណត់។

source: Create a new category
km: បង្កើតប្រភេទថ្មី

source: Use this to open the new account editor
km: ប្រើវាដើម្បីបើកកម្មវិធីកែគណនីថ្មី

source: Please select the category you want to assign the interest payments to or create a new category.
km: សូមជ្រើសរើសប្រភេទដែលអ្នកចង់កំណត់ការទូទាត់ការប្រាក់រឺបង្កើតប្រភេទថ្មី។

source: Please enter the interest rate or leave the field empty to calculate it.
km: សូមបញ្ចូលអត្រាការប្រាក់រឺទុកវាលទំនេរដើម្បីគណនា។

source: Current rate
km: អត្រាបច្ចុប្បន្ន

source: KMyMoney either calculates the new interest rate or the amount for principal and interest. If you know the interest rate then enter it here. If KMyMoney should calculate this value for you, then leave the field blank.
km: ខេអិមមីនីគណនាអត្រាការប្រាក់ថ្មីឬចំនួនប្រាក់ដើមនិងការប្រាក់។ ប្រសិនបើអ្នកដឹងពីអត្រាការប្រាក់បន្ទាប់មកបញ្ចូលវានៅទីនេះ។ ប្រសិនបើ KMyMoney គួរគណនាតម្លៃនេះសម្រាប់អ្នកបន្ទាប់មកទុកវាលនោះនៅទទេ។

source: Type of interest
km: ប្រភេទនៃចំណាប់អារម្មណ៍

source: Is the interest of this loan fixed over a period of time or is it adapted from time to time? If the interest rate changes during the amortization phase of the loan you should choose the option 'variable interest rate'.
km: តើការប្រាក់នៃប្រាក់កម្ចីនេះត្រូវបានជួសជុលក្នុងរយៈពេលណាមួយឬតើវាត្រូវបានប្រែប្រួលពីពេលមួយទៅពេលមួយ? ប្រសិនបើអត្រាការប្រាក់ផ្លាស់ប្តូរក្នុងដំណាក់កាលរំលស់នៃប្រាក់កម្ចីអ្នកគួរតែជ្រើសរើសជំរើស 'អត្រាការប្រាក់អថេរ' ។

source: Fixed interest rate
km: អត្រាការប្រាក់ថេរ

source: Variable interest rate
km: អត្រាការប្រាក់អថេរ

source: Edit loan wizard
km: កែសម្រួលអ្នកជំនួយការប្រាក់កម្ចី

source: Note: you will not be able to modify this account today, because the opening date "%1" is in the future. Please revisit this dialog when the time has come.
km: សម្គាល់ៈអ្នកនឹងមិនអាចកែប្រែគណនីនេះនៅថ្ងៃនេះបានទេពីព្រោះកាលបរិច្ឆេទនៃការបើកគឺ " %1 " នាពេលអនាគត។ សូមពិនិត្យមើលប្រអប់នេះឡើងវិញនៅពេលពេលវេលាបានមកដល់។

source: Your previous selection was "%1". If you select another option, KMyMoney will dismiss the changes you have just entered. Do you wish to proceed?
km: ជម្រើសមុនរបស់អ្នកគឺ " %1 " ។ ប្រសិនបើអ្នកជ្រើសរើសជំរើសមួយផ្សេងទៀត KMyMoney នឹងច្រានចោលការផ្លាស់ប្តូរដែលអ្នកទើបតែបានបញ្ចូល។ តើអ្នកចង់បន្តទេ?

source: calculate
km: គណនា

source: The loan wizard is unable to calculate two different values for your loan at the same time. Please enter a value for the %1 on this page or backup to the page where the current value to be calculated is defined and fill in a value.
km: អ្នកជំនួយការប្រាក់កម្ចីមិនអាចគណនាតម្លៃខុសគ្នាពីរសម្រាប់ប្រាក់កម្ចីរបស់អ្នកក្នុងពេលតែមួយបានទេ។ សូមបញ្ចូលតម្លៃសម្រាប់ %1 នៅលើទំព័រនេះឬបម្រុងទុកទំព័រដែលតម្លៃបច្ចុប្បន្នត្រូវគណនាត្រូវបានកំណត់ហើយបំពេញតម្លៃ។

source: You selected, that payments have already been made towards this loan. This requires you to enter the loan amount exactly as found on your last statement.
km: អ្នកបានជ្រើសរើសការទូទាត់នោះត្រូវបានធ្វើឡើងរួចទៅហើយចំពោះប្រាក់កម្ចីនេះ។ នេះតម្រូវឱ្យអ្នកបញ្ចូលចំនួនប្រាក់កម្ចីយ៉ាងពិតប្រាកដដូចដែលបានរកឃើញនៅក្នុងរបាយការណ៍ចុងក្រោយរបស់អ្នក។

source: interest rate
km: អត្រា​ការ​ប្រាក់

source: term
km: ពាក្យ

source: principal and interest
km: ប្រាក់ដើមនិងការប្រាក់

source: The number of payments has been decremented and the final payment has been modified to %1.
km: ចំនួននៃការទូទាត់ត្រូវបានថយចុះហើយការទូទាត់ចុងក្រោយត្រូវបានកែប្រែទៅជា %1 ។

source: The final payment has been modified to %1.
km: ការទូទាត់ចុងក្រោយត្រូវបានកែប្រែទៅជា %1 ។

source: KMyMoney has calculated a final payment of %1 for this loan.
km: ខេអិមមីនីបានគណនាការទូទាត់ចុងក្រោយនៃ %1 សម្រាប់ប្រាក់កម្ចីនេះ។

source: You have entered mis-matching information. Please backup to the appropriate page and update your figures or leave one value empty to let KMyMoney calculate it for you
km: អ្នកបានបញ្ចូលព័ត៌មានដែលត្រូវគ្នា។ សូមបម្រុងទុកទំព័រសមស្របនិងធ្វើបច្ចុប្បន្នភាពតួលេខរបស់អ្នកឬទុកតម្លៃមួយអោយនៅទទេដើម្បីឱ្យខេមីមីនីគណនាវាសម្រាប់អ្នក

source: New Loan Wizard
km: អ្នកជំនួយការប្រាក់កម្ចីថ្មី

source: Lending or borrowing money
km: ផ្តល់ប្រាក់កម្ចីឬខ្ចីប្រាក់

source: Do you borrow or lend money?
km: តើអ្នកខ្ចីរឺខ្ចីប្រាក់ទេ?

source: Please enter the original loan amount in the field below or leave it empty to be calculated.
km: សូមបញ្ចូលចំនួនប្រាក់កម្ចីដើមនៅក្នុងវិស័យខាងក្រោមឬទុកឱ្យទំនេរដើម្បីគណនា។

source: Please enter the remaining loan amount of last years final statement in the field below. You should not leave this field empty.
km: សូមបញ្ចូលចំនួនប្រាក់កម្ចីដែលនៅសល់នៃរបាយការណ៍ចុងក្រោយឆ្នាំចុងក្រោយនៅក្នុងវិស័យខាងក្រោម។ អ្នកមិនគួរទុកវាលនេះនៅទំនេរទេ។

source: To whom do you make payments?
km: តើអ្នកបង់លុយ ឲ្យ អ្នកណា?

source: Payments to
km: ការទូទាត់ទៅ

source: From whom do you expect payments?
km: តើអ្នករំពឹងពីការទូទាត់ប្រាក់ពីអ្នកណា?

source: Payments from
km: ការទូទាត់ប្រាក់ពី

source: Name of the loan
km: ឈ្មោះប្រាក់កម្ចី

source: How do you want to call this loan? Examples for names are 'car loan', 'school loan', 'home owner loan'.
km: តើអ្នកចង់ហៅប្រាក់កម្ចីនេះយ៉ាងដូចម្តេច? ឧទាហរណ៍សម្រាប់ឈ្មោះគឺ 'ប្រាក់កម្ចីរថយន្ត' ប្រាក់កម្ចីសាលារៀន 'ប្រាក់កម្ចីម្ចាស់ផ្ទះ' ។

# @label loan name
source: Name
km: ឈ្មោះ

source: Calculate Loan
km: គណនាប្រាក់កម្ចី

source: You have successfully entered the general information about your loan. Next, KMyMoney needs some information about the calculation of the loan.
km: អ្នកបានបញ្ចូលព័ត៌មានទូទៅអំពីប្រាក់កម្ចីរបស់អ្នកដោយជោគជ័យ។ បន្ទាប់ KMyMoney ត្រូវការព័ត៌មានមួយចំនួនអំពីការគណនាប្រាក់កម្ចី។

source: 1. General Information
km: ព័ត៌មានទូទៅ

source: 2. Calculate Loan
km: 2. គណនាប្រាក់កម្ចី

source: 3. Payments
km: 3. ការទូទាត់

source: In the first step, KMyMoney will ask you some general information about the loan account to be created.
km: ក្នុងជំហ៊ានដំបូងគីមីមីនីនឹងសួរអ្នកនូវព័ត៌មានទូទៅមួយចំនួនអំពីគណនីកំចីដែលត្រូវបង្កើត។

source: 2. Calculate Loan 3. Payments
km: 2. គណនាប្រាក់កម្ចី 3. ការទូទាត់

source: New Loan Account Wizard
km: អ្នកជំនួយគណនីកំចីថ្មី

source: Welcome to the New Loan Account Wizard which will guide you through the creation of a new loan e.g. for your home, your car or any other loan that you pay or gain interest for. Please make sure that you have the relevant information handy. You usually get the information out of your contract and the last statement.
km: សូមស្វាគមន៍មកកាន់អ្នកជំនួយការប្រាក់កម្ចីថ្មីដែលនឹងណែនាំអ្នកតាមរយៈការបង្កើតប្រាក់កម្ចីថ្មីឧទាហរណ៍សម្រាប់គេហដ្ឋានឡានរបស់អ្នកឬប្រាក់កម្ចីផ្សេងទៀតដែលអ្នកបង់ឬទទួលបានការប្រាក់។ សូមប្រាកដថាអ្នកមានព័ត៌មានដែលពាក់ព័ន្ធងាយស្រួល។ ជាធម្មតាអ្នកទទួលបានព័ត៌មានចេញពីកិច្ចសន្យារបស់អ្នកនិងសេចក្តីថ្លែងការណ៍ចុងក្រោយ។

source: In the following steps, KMyMoney supports you in setting up categories and schedules for your loan payments.
km: ក្នុងជំហ៊ានខាងក្រោមខេខេមីងគាំទ្រអ្នកក្នុងការរៀបចំប្រភេទនិងកាលវិភាគសម្រាប់ការទូទាត់ប្រាក់កម្ចីរបស់អ្នក។

source: Please enter the amount you pay for principal and interest or leave the field empty to calculate it.
km: សូមបញ្ចូលចំនួនទឹកប្រាក់ដែលអ្នកចំណាយសម្រាប់ប្រាក់ដើមនិងការប្រាក់ឬទុកវាលទំនេរដើម្បីគណនាវា។

source: Current amount
km: ចំនួនបច្ចុប្បន្ន

source: Principal and interest
km: នាយកសាលានិងចំណាប់អារម្មណ៍

source: KMyMoney either calculates the new interest rate or the amount for principal and interest. If you know the amount for principal and interest then enter it here. If KMyMoney should calculate this value for you, then leave the field blank.
km: ខេអិមមីនីគណនាអត្រាការប្រាក់ថ្មីឬចំនួនប្រាក់ដើមនិងការប្រាក់។ ប្រសិនបើអ្នកដឹងពីចំនួនប្រាក់ដើមនិងការប្រាក់បន្ទាប់មកបញ្ចូលវានៅទីនេះ។ ប្រសិនបើ KMyMoney គួរគណនាតម្លៃនេះសម្រាប់អ្នកបន្ទាប់មកទុកវាលនោះនៅទទេ។

source: How often will there be payments made to this loan?
km: តើនឹងមានការទូទាត់ប្រាក់ប៉ុន្មានដើម្បីប្រាក់កម្ចីនេះ?

source: Payments?
km: ការទូទាត់ប្រាក់?

source: Were there any payments for this loan whether they are entered into KMyMoney or not?
km: តើមានប្រាក់សំណងណាមួយសម្រាប់ប្រាក់កម្ចីនេះដែរឬទេថាតើពួកគេត្រូវបានបញ្ចូលទៅក្នុង KMyMoney រឺអត់?
