Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney._desktop_.po
Languages: km

# Name
source: KMyMoney developer handbook
km: សៀវភៅណែនាំអ្នកអភិវឌ្ឍន៍ KMyMoney

# Name
source: Enables plugins to store data in the sql database
km: បើកដំណើរការកម្មវិធីជំនួយដើម្បីផ្ទុកទិន្នន័យនៅក្នុងមូលដ្ឋានទិន្នន័យ sql

# Name
source: KMyMoney
km: ខេម៉ីម៉ាន់នី

# GenericName
source: Personal Finance Manager
km: ការគ្រប់គ្រងហិរញ្ញវត្ថុផ្ទាល់ខ្លួន

# Comment
source: Personal Finance Manager
km: អ្នកគ្រប់គ្រងហិរញ្ញវត្ថុផ្ទាល់ខ្លួន

# Name
source: csvexport
km: នាំ csv ចេញ

# Comment
source: Add CSV exporting to KMyMoney
km: បន្ថែមការនាំចេញស៊ីអេសវីទៅខេខេមីយនីយ

# Name
source: csvimport
km: នាំ csv ចូល

# Comment
source: Add CSV importing to KMyMoney
km: បន្ថែមការនាំចូលស៊ីអេសវីចូលខេខេមីយនីយ

# Name
source: Configure icalendar export plugin
km: កំណត់រចនាសម្ព័ន្ធកម្មវិធីជំនួយនាំចេញ icalendar

# Comment
source: Permits the configuration of the iCalendar plugin's options
km: អនុញ្ញាតការកំណត់រចនាសម្ព័ន្ធជម្រើសរបស់កម្មវិធីជំនួយ iCalendar

# Comment
source: Exports schedules to iCalendar files
km: នាំចេញកាលវិភាគទៅឯកសារ iCalendar

# Name
source: KBanking
km: ខេប៊ីកឃីង

# Comment
source: Add online banking to KMyMoney
km: បន្ថែមសេវាកម្មធនាគារតាមអ៊ិនធឺរណែតទៅខេខេមីយនី

# Name
source: KMyMoney Importer Plugin
km: កម្មវិធីជំនួយអ្នកនាំចូលខេម៉ីនី

# Comment
source: A KMyMoney plugin
km: កម្មវិធីជំនួយ KMyMoney

# Name
source: Form to edit online orders/tasks
km: សំណុំបែបបទដើម្បីកែសម្រួលការបញ្ជាទិញ / ភារកិច្ចតាមអ៊ីនធឺណិត

# Name
source: Painter of payee identifier
km: វិចិត្រករអ្នកកំណត់អត្តសញ្ញាណអ្នកបង់ប្រាក់

# Name
source: KMyMoney Plugin
km: កម្មវិធីជំនួយខេអិមមីនី

# Name
source: KMyMoney OFX
km: ខេម៉ីម៉ាន់នីអេច

# Comment
source: Add OFX importing to KMyMoney
km: បន្ថែមការនាំចូល OFX ទៅ KMyMoney

# Name
source: onlinejobpluginmockup
km: កម្មវិធីជំនួយការងារតាមអ៊ីនធឺណិត

# Comment
source: If mapped to an account, it pretends it could handle all onlineTasks (for developers only).
km: ប្រសិនបើគូសផែនទីចូលគណនីវាធ្វើពុតថាវាអាចគ្រប់គ្រងលើអ៊ីនធឺណិតទាំងអស់ (សម្រាប់តែអ្នកអភិវឌ្ឍន៍) ។

# Name
source: Configure the print check plugin
km: កំណត់រចនាសម្ព័ន្ធកម្មវិធីជំនួយពិនិត្យការបោះពុម្ព

# Keywords
source: printcheck;kmymoney;
km: ពិនិត្យការបោះពុម្ភ; kmymoney;

# Comment
source: Permits the configuration of the print check plugin's options
km: អនុញ្ញាតការកំណត់រចនាសម្ព័ន្ធជម្រើសរបស់កម្មវិធីជំនួយការត្រួតពិនិត្យការបោះពុម្ព

# Name
source: Print check
km: បោះពុម្ពមូលប្បទានប័ត្រ

# Comment
source: Provides the capability to print checks
km: ផ្តល់នូវសមត្ថភាពក្នុងការបោះពុម្ពមូលប្បទានប័ត្រ

# Name
source: Reconciliation report
km: របាយការណ៍ការផ្សះផ្សា

# Comment
source: Creates a report after each reconciliation containing data about the reconciliation process
km: បង្កើតរបាយការណ៍បន្ទាប់ពីការផ្សះផ្សាគ្នាដែលមានទិន្នន័យអំពីដំណើរការផ្សះផ្សា

# Comment
source: Plugin for weboob
km: កម្មវិធីជំនួយសម្រាប់ weboob
