Repository: koompi/kde-khmer-translation
Catalog: applications_*_stable_kdelibs4-based/messages/kmymoney/kmymoney.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: : Sorry. This importer cannot handle version %1 of element %2
km: : សុំទោស។ អ្នកនាំចូលនេះមិនអាចគ្រប់គ្រងកំណែ %1 នៃធាតុ %2

source: Account%1
km: គណនី %1

source: Stock%1
km: ស្តុក %1

source: Payee%1
km: អ្នកបង់ប្រាក់ %1

source: Schedule%1
km: កាលវិភាគ %1

source: This version of the importer cannot handle multi-book files.
km: អ្នកនាំចូលនេះមិនអាចគ្រប់គ្រងឯកសារច្រើនក្បាលបានទេ។

source: Input file cannot be parsed; may be corrupt %1
km: ឯកសារបញ្ចូលមិនអាចត្រូវបានញែក; អាចខូច %1

source: Invalid header for file. Should be 'gnc-v2'
km: បឋមកថាមិនត្រឹមត្រូវសម្រាប់ឯកសារ។ គួរតែជា 'gnc-v2'

source: Import failed: %1
km: ការនាំចូលបានបរាជ័យ៖ %1

source: Import complete
km: ការនាំចូលបានបញ្ចប់

source: Disguise your wealth
km: ក្លែងបន្លំទ្រព្យសម្បត្តិរបស់អ្នក

source: Each monetary value on your file will be multiplied by a random number between 0.01 and 1.99 with a different value used for each transaction. In addition, to further disguise the true values, you may enter a number between %1 and %2 which will be applied to all values. These numbers will not be stored in the file.
km: តម្លៃរូបិយវត្ថុនីមួយៗនៅលើឯកសាររបស់អ្នកនឹងត្រូវគុណនឹងលេខចៃដន្យចន្លោះពី ០.០១ ដល់ ១,៩៩ ជាមួយនឹងតម្លៃខុសគ្នាដែលត្រូវបានប្រើសម្រាប់ប្រតិបត្តិការនីមួយៗ។ លើសពីនេះទៀតដើម្បីបន្លំតម្លៃ ពិតអ្នកអាចបញ្ចូលលេខនៅចន្លោះ %1 និង %2 ដែលនឹងត្រូវអនុវត្តចំពោះតម្លៃទាំងអស់។ លេខទាំងនេះនឹងមិនត្រូវបានរក្សាទុកនៅក្នុងឯកសារទេ។

source: Loading commodities...
km: កំពុងផ្ទុកទំនិញ ...

source: Loading prices...
km: កំពុងផ្ទុកតម្លៃ ...

source: Imported History
km: ប្រវត្តិសាស្រ្តដែលបាននាំចូល

source: Loading accounts...
km: កំពុងផ្ទុកគណនី ...

source: Current importer does not recognize GnuCash account type %1
km: អ្នកនាំចូលបច្ចុប្បន្នមិនស្គាល់ប្រភេទគណនី GnuCash %1

source: Loading transactions...
km: កំពុងដំណើរការប្រតិបត្តិការ ...

source: Account or Category %1, transaction date %2; split contains invalid value; please check
km: គណនីឬប្រភេទ %1 កាលបរិច្ឆេទប្រតិបត្តិការ %2; បំបែកមានតម្លៃមិនត្រឹមត្រូវ; សូម​ត្រួតពិនិត្យ

source: Imported Transaction
km: ប្រតិបត្តិការដែលបាននាំចូល

source: Loading templates...
km: កំពុងផ្ទុកគំរូ ...

source: Unknown payee
km: មិនស្គាល់អ្នកទទួលប្រាក់

source: Schedule %1 contains unknown action (key = %2, type = %3)
km: កាលវិភាគ %1 មានសកម្មភាពមិនដឹង (គន្លឹះ = %2, ប្រភេទ = %3)

source: Schedule %1 contains multiple actions; only one has been imported
km: កាលវិភាគ %1 មានសកម្មភាពច្រើន; មានតែមួយប៉ុណ្ណោះដែលត្រូវបាននាំចូល

source: Schedule %1 contains no valid splits
km: តារាង %1 មិនមានការបែងចែកត្រឹមត្រូវទេ

source: Schedule %1 appears to contain a formula. GnuCash formulae are not convertible
km: តារាង %1 បង្ហាញថាមានរូបមន្ត។ រូបមន្ត GnuCash មិនអាចបំលែងបានទេ

source: Loading schedules...
km: កំពុងផ្ទុកកាលវិភាគ ...

source: Cannot find template transaction for schedule %1
km: មិនអាចរកឃើញប្រតិបត្តិការគំរូសម្រាប់កាលវិភាគ %1

source: Schedule %1 has interval of %2 which is not currently available
km: កាលវិភាគ %1 មានចន្លោះពេលនៃ %2 ដែលបច្ចុប្បន្នមិនមាន

source: Schedule %1 contains unknown interval specification; please check for correct operation
km: កាលវិភាគ %1 មានការបញ្ជាក់ចន្លោះពេលដែលមិនស្គាល់; សូមពិនិត្យមើលប្រតិបត្តិការត្រឹមត្រូវ

source: Schedule %1 contains a deferred interval specification; please check for correct operation
km: កាលវិភាគ %1 មានការបញ្ជាក់ចន្លោះពេលពន្យាពេល; សូមពិនិត្យមើលប្រតិបត្តិការត្រឹមត្រូវ

source: Schedule %1 dropped at user request
km: តារាងពេលវេលា %1 បានធ្លាក់ចុះតាមការស្នើសុំរបស់អ្នកប្រើប្រាស់

source: Reorganizing accounts...
km: រៀបចំគណនីឡើងវិញ ...

source: Your main currency seems to be %1 (%2); do you want to set this as your base currency?
km: រូបិយប័ណ្ណសំខាន់របស់អ្នកហាក់ដូចជា %1 (%2); តើអ្នកចង់កំណត់វាជារូបិយប័ណ្ណគោលរបស់អ្នកទេ?

# Button to show more detailed data
source: More
km: ច្រើនទៀត

# Button to close the current dialog
source: Done
km: ធ្វើរួច

source: Save Report
km: រក្សាទុករបាយការណ៍

source: Problems were encountered in converting schedule '%1'. Do you want to review or edit it now?
km: បញ្ហាត្រូវបានជួបប្រទះនៅក្នុងកាលវិភាគបំលែង '%1' ។ តើអ្នកចង់ពិនិត្យឡើងវិញឬកែសម្រួលវាឥឡូវនេះទេ?

source: Found:
km: រកឃើញ:

source: %1 commodity (equity)
km: %1 ទំនិញ (សមធម៌)

source: %1 price
km: %1 តម្លៃ

source: %1 account
km: %1 គណនី

source: %1 transaction
km: %1 ប្រតិបត្តិការ

source: %1 schedule
km: %1 កាលវិភាគ

source: No inconsistencies were detected
km: មិនមានភាពជាប់លាប់ត្រូវបានគេរកឃើញ

source: %1 inconsistency was detected and corrected
km: ភាពមិនត្រូវគ្នានៃ %1 ត្រូវបានរកឃើញនិងកែតំរូវ

source: %1 orphan account was created
km: %1 គណនីក្មេងកំព្រាត្រូវបានបង្កើត

source: %1 possible schedule problem was noted
km: %1 បញ្ហាកាលវិភាគដែលអាចកើតមានត្រូវបានកត់សម្គាល់

source: Small Business Features (Customers, Invoices, etc.)
km: លក្ខណៈអាជីវកម្មខ្នាតតូច (អតិថិជនវិក្កយបត្រ។ ល។ )

source: Budgets
km: ថវិកា

source: Lots
km: ច្រើន

source: The following features found in your file are not currently supported:
km: លក្ខណៈពិសេសខាងក្រោមដែលមាននៅក្នុងឯកសាររបស់អ្នកបច្ចុប្បន្នមិនត្រូវបានគាំទ្រទេ៖

source: Press More for further information
km: ចុចព័ត៌មានបន្ថែមសម្រាប់ព័ត៌មានបន្ថែម

source: Save report as
km: រក្សាទុករបាយការណ៍ជា

source: Orphan created from unknown GnuCash account
km: ក្មេងកំព្រាបានបង្កើតពីគណនី GnuCash ដែលមិនស្គាល់

source: One or more transactions contain a reference to an otherwise unknown account An asset account with the name %1 has been created to hold the data
km: ប្រតិបត្តិការមួយឬច្រើនផ្ទុកឯកសារយោងទៅគណនីដែលមិនស្គាល់មួយ គណនីទ្រព្យមួយដែលមានឈ្មោះ %1 ត្រូវបានបង្កើតឡើងដើម្បីរក្សាទុកទិន្នន័យ

source: Internal error - invalid interval char in incrDate
km: កំហុសផ្ទៃក្នុង - ចន្លោះពេលឆែកមិនត្រឹមត្រូវនៅក្នុងវិក្កយបត្រ

source: An Investment account must be a child of an Asset account Account %1 will be stored under the main Asset account
km: គណនីវិនិយោគត្រូវតែជាកូនរបស់គណនីទ្រព្យសកម្ម គណនី %1 នឹងត្រូវរក្សាទុកនៅក្រោមគណនីទ្រព្យសកម្ម។

source: An Income account must be a child of an Income account Account %1 will be stored under the main Income account
km: គណនីប្រាក់ចំណូលត្រូវតែជាកូនរបស់គណនីប្រាក់ចំណូល គណនី %1 នឹងត្រូវរក្សាទុកនៅក្នុងគណនីប្រាក់ចំណូលសំខាន់។

source: An Expense account must be a child of an Expense account Account %1 will be stored under the main Expense account
km: គណនីចំណាយត្រូវតែជាកូនរបស់គណនីចំណាយមួយ។ គណនី %1 នឹងត្រូវរក្សាទុកនៅក្នុងគណនីចំណាយសំខាន់។

source: Enter the investment account name
km: បញ្ចូលឈ្មោះគណនីវិនិយោគ

source: My Investments
km: ការវិនិយោគរបស់ខ្ញុំ

source: Select parent investment account or enter new name. Stock %1
km: ជ្រើសរើសគណនីវិនិយោគមេឬបញ្ចូលឈ្មោះថ្មី។ ស្តុក %1

source: %1 is not an Investment Account. Do you wish to make it one?
km: %1 មិនមែនជាគណនីវិនិយោគទេ។ តើអ្នកចង់បង្កើតវាទេ?

# Category name
source: Reinvested interest
km: ចំណាប់អារម្មណ៍ឡើងវិញ

# Category name
source: Reinvested dividend
km: ការបែងចែកភាគលាភឡើងវិញ

# Category name
source: Reinvested dividend (long term)
km: ភាគលាភដែលបានវិនិយោគឡើងវិញ (រយៈពេលវែង)

# Category name
source: Reinvested dividend (short term)
km: ភាគលាភដែលបានវិនិយោគឡើងវិញ (រយៈពេលខ្លី)

# Category name
source: Dividend
km: ភាគលាភ

# Category name
source: Interest
km: ចំណាប់អារម្មណ៍

# Category name
source: Capital Gain (short term)
km: ចំណេញដើមទុន (រយៈពេលខ្លី)

# Category name
source: Capital Gain (mid term)
km: ចំណេញដើមទុន (ពាក់កណ្តាលអាណត្តិ)

# Category name
source: Capital Gain (long term)
km: ចំណេញដើមទុន (រយៈពេលវែង)

# Category name
source: Returned capital
km: ដើមទុនត្រឡប់មកវិញ

# Category name
source: Miscellaneous income
km: ចំណូលផ្សេងៗ

# Category name
source: Miscellaneous expense
km: ការចំណាយផ្សេងៗ

# Category name
source: Investment fees
km: ថ្លៃវិនិយោគ

source: Unknown QIF type %1
km: មិនស្គាល់ QIF ប្រភេទ %1

source: Date format selection
km: ការជ្រើសរើសទ្រង់ទ្រាយកាលបរិច្ឆេទ

source: Pick the date format that suits your input file
km: ជ្រើសទ្រង់ទ្រាយកាលបរិច្ឆេទដែលសមនឹងឯកសារបញ្ចូលរបស់អ្នក

source: Importing QIF...
km: កំពុងនាំចូល QIF ...

source: Error while loading file '%1'.
km: មានកំហុសពេលផ្ទុកឯកសារ '%1' ។

source: File access error
km: កំហុសក្នុងការចូលប្រើឯកសារ

source: Reading QIF...
km: កំពុងអាន QIF ...

source: Error while running the filter '%1'.
km: កំហុសពេលដំណើរការតម្រង '%1' ។

source: Filter error
km: កំហុសតម្រង

source: Adding transactions
km: បន្ថែមប្រតិបត្តិការ

source: Now adding the transactions to your ledger...
km: ឥឡូវបន្ថែមប្រតិបត្តិការទៅក្នុងសៀវភៅបញ្ជីរបស់អ្នក ...

source: Unable to add transactions
km: មិនអាចបន្ថែមប្រតិបត្តិការបានទេ

source: %1 thrown in %2:%3
km: %1 បោះចោលក្នុង %2: %3

# QIF tag for liability account
source: Oth L
km: អូអិល

# QIF tag for category
source: Cat
km: ឆ្មា

# QIF tag for security
source: Security
km: សន្តិសុខ

# QIF tag for prices
source: Prices
km: តម្លៃ

# QIF tag for a class
source: Class
km: ថ្នាក់

source: The %1 account currently has an opening balance of %2. This QIF file reports an opening balance of %3. Would you like to overwrite the current balance with the one from the QIF file?
km: គណនី %1 បច្ចុប្បន្នមានសមតុល្យបើកនៃ %2 ។ ឯកសារ QIF នេះរាយការណ៍អំពីសមតុល្យបើកនៃ %3 ។ តើអ្នកចង់សរសេរជាន់លើសមតុល្យបច្ចុប្បន្នជាមួយឯកសារពី QIF ដែរឬទេ?

source: Overwrite opening balance
km: សរសេរជាន់លើសមតុល្យបើក

source: Autogenerated by QIF importer
km: បង្កើតដោយអ្នកបញ្ចូល QIF

source: QIF imported, no account name supplied
km: QIF បាននាំចូលមិនមានឈ្មោះគណនីដែលបានផ្គត់ផ្គង់ទេ

source: KMyMoney has imported a second opening balance transaction into account <b>%1</b> which differs from the one found already on file. Please correct this manually once the import is done.
km: ខេអិមមីនីបាននាំចូលប្រតិបត្តិការសមតុល្យបើកជាលើកទី ២ <b> %1 </b> ដែលខុសគ្នាពីឯកសារដែលបានរកឃើញរួចហើយ។ សូមកែវាដោយដៃនៅពេលការនាំចូលត្រូវបានបញ្ចប់។

source: Opening balance problem
km: ការបើកបញ្ហាតុល្យភាព

source: Error while creating opening balance transaction
km: មានកំហុសខណៈពេលបង្កើតប្រតិបត្តិការសមតុល្យបើក

source: The date entry "%1" read from the file cannot be interpreted through the current date profile setting of "%2". Pressing "Continue" will assign todays date to the transaction. Pressing "Cancel" will abort the import operation. You can then restart the import and select a different QIF profile or create a new one.
km: ធាតុកាលបរិច្ឆេទ " %1 " អានពីឯកសារមិនអាចត្រូវបានបកស្រាយតាមរយៈការកំណត់ទម្រង់កាលបរិច្ឆេទបច្ចុប្បន្នរបស់ " %2 " ។ ចុច " បន្ត " នឹងកំណត់កាលបរិច្ឆេទថ្ងៃនេះទៅប្រតិបត្តិការ។ ចុច " បោះបង់ " នឹងបញ្ឈប់ប្រតិបត្តិការនាំចូល។ បន្ទាប់មកអ្នកអាចចាប់ផ្តើមការនាំចូលឡើងវិញហើយជ្រើសរើសទម្រង់ QIF ផ្សេងទៀតឬបង្កើតថ្មី។

source: Invalid date format
km: ទ្រង់ទ្រាយកាលបរិច្ឆេទមិនត្រឹមត្រូវ

source: Statement Importer
km: សេចក្តីថ្លែងការណ៍អ្នកនាំចូល

source: This investment account does not contain the "%1" security. Transactions involving this security will be ignored.
km: គណនីវិនិយោគនេះមិនមានសុវត្ថិភាព " %1 " សុវត្ថិភាពទេ។ ប្រតិបត្តិការទាក់ទងនឹងសន្តិសុខនេះនឹងមិនត្រូវបានអើពើឡើយ។

source: Security not found
km: រកមិនឃើញសុវត្ថិភាព

source: %1 (Investment)
km: %1 (ការវិនិយោគ)

source: Autogenerated by QIF importer from type Mutual account entry
km: បង្កើតឡើងវិញដោយអ្នកនាំចូល QIF ពីប្រភេទគណនីទៅវិញទៅមក

source: account
km: គណនី

source: al
km: អាល់

source: category
km: ប្រភេទ

source: ei
km: អ៊ី

source: Category selection
km: ការជ្រើសរើសប្រភេទ

source: Account "%1" disappeared: %2
km: គណនី " %1 " បាត់: %2

# The 'type of object' 'x' does not exist
source: The %1 '%2' does not exist. Do you want to create it?
km: មិនមាន %1 '%2' ទេ។ តើអ្នកចង់បង្កើតវាទេ?

# To select account
source: Select %1
km: ជ្រើសរើស %1

source: The %1 <b>%2</b> currently exists. Do you want to import transactions to this account?
km: នេះ %1 <b> %2 </b> បច្ចុប្បន្នមាន។ តើអ្នកចង់នាំចូលប្រតិបត្តិការទៅគណនីនេះទេ?

source: The %1 <b>%2</b> currently does not exist. You can create a new %3 by pressing the <b>Create</b> button or select another %4 manually from the selection box.
km: នេះ %1 <b> %2 </b> បច្ចុប្បន្នមិនមាន។ អ្នកអាចបង្កើត %3 ថ្មីដោយចុចប៊ូតុង <b> បង្កើត </b> ប៊ូតុងឬជ្រើស %4 ផ្សេងទៀតដោយដៃពីប្រអប់ជ្រើសរើស។

source: You must select or create an account.
km: អ្នកត្រូវតែជ្រើសរើសឬបង្កើតគណនី។

source: You must select or create a category.
km: អ្នកត្រូវតែជ្រើសរើសឬបង្កើតប្រភេទ។

source: Unexpected exception '%1' thrown in %2, line %3 caught in MyMoneyQifWriter::write()
km: ករណីលើកលែងដែលមិនបានរំពឹងទុក '%1' បោះចោលក្នុង %2, បន្ទាត់ %3 ចាប់បាននៅក្នុង MyMoneyQifWriter :: សរសេរ ()

source: Unable to open file '%1' for writing
km: មិនអាចបើកឯកសារ '%1' សម្រាប់ការសរសេរ

source: Transaction number <b>%1</b> is missing an account assignment. Transaction dropped.
km: លេខប្រតិបត្តិការ <b> %1 </b> បាត់កិច្ចការគណនី។ ប្រតិបត្តិការបានធ្លាក់ចុះ។

source: Invalid transaction
km: ប្រតិបត្តិការមិនត្រឹមត្រូវ

source: _Fees
km: ថ្លៃឈ្នួល

source: _Dividend
km: ភាគលាភ

source: Importing statement for account %1
km: ការនាំចូលរបាយការណ៍សម្រាប់គណនី %1

source: Importing statement without transactions
km: ការនាំចូលសេចក្តីថ្លែងការណ៍ដោយគ្មានប្រតិបត្តិការ

source: Statement balance is not contained in statement.
km: សមតុល្យសេចក្តីថ្លែងការណ៍មិនមាននៅក្នុងសេចក្តីថ្លែងការណ៍ទេ។

source: Statement balance on %1 is reported to be %2
km: សមតុល្យសេចក្តីថ្លែងការណ៍នៅលើ %1 ត្រូវបានរាយការណ៍ថា %2

source: Transactions
km: ប្រតិបត្តិការ

source: %1 processed
km: បានដំណើរការ %1

# x transactions have been added
source: %1 added
km: %1 បន្ថែម

source: %1 matched
km: %1 ត្រូវគ្នា

source: %1 duplicate
km: %1 ស្ទួនគ្នា

source: Payees
km: អ្នកបង់ប្រាក់

# x transactions have been created
source: %1 created
km: បានបង្កើត %1

source: Error
km: កំហុស

source: Error creating security record: %1
km: កំហុសក្នុងការបង្កើតកំណត់ត្រាសុវត្ថិភាព: %1

source: This imported statement contains investment transactions with no security. These transactions will be ignored.
km: សេចក្តីថ្លែងការណ៍ដែលនាំចូលនេះមានប្រតិបត្តិការវិនិយោគដោយគ្មានសុវត្ថិភាព។ ប្រតិបត្តិការទាំងនេះនឹងមិនត្រូវបានអើពើឡើយ។

source: <center>This investment account does not contain the "%1" security.</center><center>Transactions involving this security will be ignored.</center>
km: <center> គណនីវិនិយោគនេះមិនមានសុវត្ថិភាព " %1 " សុវត្ថិភាពទេ។ </center><center> ប្រតិបត្តិការទាក់ទងនឹងសន្តិសុខនេះនឹងមិនត្រូវបានអើពើឡើយ។ </center>

# Finance
source: This imported statement contains investment transactions with no share amount. These transactions will be ignored.
km: សេចក្តីថ្លែងការណ៍ដែលបាននាំចូលនេះមានប្រតិបត្តិការវិនិយោគដោយគ្មានចំនួនភាគហ៊ុន។ ប្រតិបត្តិការទាំងនេះនឹងមិនត្រូវបានអើពើឡើយ។

# Finance
source: No share amount provided
km: មិនមានចំនួនទឹកប្រាក់ដែលបានផ្តល់ឱ្យទេ

source: (Fees) %1
km: (ថ្លៃសេវា) %1

source: Do you want to add "%1" as payee/receiver?
km: តើអ្នកចង់បន្ថែម " %1 " ក្នុងនាមជាអ្នកទទួលប្រាក់ / អ្នកទទួល?

source: Selecting "Yes" will create the payee, "No" will skip creation of a payee record and remove the payee information from this transaction. Selecting "Cancel" aborts the import operation. If you select "No" here and mark the "Do not ask again" checkbox, the payee information for all following transactions referencing "%1" will be removed.
km: ការជ្រើសរើស " បាទ " នឹងបង្កើតអ្នកបង់ប្រាក់នោះ " គ្មាន " នឹងរំលងការបង្កើតកំណត់ត្រាអ្នកទទួលប្រាក់ហើយយកព័ត៌មានរបស់អ្នកបង់ប្រាក់ចេញពីប្រតិបត្តិការនេះ។ ការជ្រើសរើស " បោះបង់ " បោះបង់ប្រតិបត្តិការនាំចូល។ ប្រសិនបើអ្នកជ្រើសរើស " ទេ " នៅទីនេះហើយគូសចំណាំ " កុំសួរម្តងទៀត " ប្រអប់ព័ត៌មានអ្នកបង់ប្រាក់សំរាប់ប្រតិបត្តិការដូចខាងក្រោមយោង " %1 zxdbqux ។

source: New payee/receiver
km: អ្នកទទួល / អ្នកទទួលថ្មី

source: Default Category for Payee
km: ប្រភេទលំនាំដើមសម្រាប់អ្នកទទួលប្រាក់

source: Save Category
km: រក្សាទុកប្រភេទ

source: No Category
km: គ្មានប្រភេទ

source: Abort
km: បោះបង់

source: Please select a default category for payee '%1'
km: សូមជ្រើសរើសប្រភេទលំនាំដើមសម្រាប់អ្នកបង់ប្រាក់ '%1'

source: Unable to add payee/receiver
km: មិនអាចបន្ថែមអ្នកទទួល / អ្នកទទួលបានទេ

source: Problem adding or matching imported transaction with id '%1': %2
km: បញ្ហាបន្ថែមឬផ្គូផ្គងប្រតិបត្តិការដែលបាននាំចូលជាមួយលេខសម្គាល់ '%1': %2

source: <b>You have downloaded a statement for the following account:</b><br/><br/>
km: <b> អ្នកបានទាញយករបាយការណ៍សម្រាប់គណនីដូចខាងក្រោមៈ </b><br/><br/>

source: - Account Name: %1
km: - ឈ្មោះគណនី៖ %1

source: - Account Type: %1
km: - ប្រភេទគណនី៖ %1

source: - Account Number: %1
km: - លេខគណនី៖ %1

source: Do you want to import transactions to this account?
km: តើអ្នកចង់នាំចូលប្រតិបត្តិការទៅគណនីនេះទេ?

source: KMyMoney cannot determine which of your accounts to use. You can create a new account by pressing the <b>Create</b> button or select another one manually from the selection box below.
km: KMyMoney មិនអាចកំណត់ថាតើគណនីមួយណាដែលត្រូវប្រើឡើយ។ អ្នកអាចបង្កើតគណនីថ្មីដោយចុចប៊ូតុង <b> បង្កើត </b> ប៊ូតុងឬជ្រើសមួយផ្សេងទៀតដោយដៃពីប្រអប់ជ្រើសរើសខាងក្រោម។

source: No account information has been found in the selected statement file. Please select an account using the selection box in the dialog or create a new account by pressing the <b>Create</b> button.
km: មិនមានព័ត៌មានអំពីគណនីណាមួយត្រូវបានរកឃើញនៅក្នុងឯកសាររបាយការណ៍ដែលបានជ្រើសរើសទេ។ សូមជ្រើសរើសគណនីដោយប្រើប្រអប់ជ្រើសរើសនៅក្នុងប្រអប់រឺបង្កើតគណនីថ្មីដោយចុចលើប៊ូតុង <b> បង្កើត </b> ប៊ូតុង។

source: Import transactions
km: ប្រតិបត្តិការនាំចូល

source: You must select an account, create a new one, or press the <b>Abort</b> button.
km: អ្នកត្រូវតែជ្រើសរើសគណនីបង្កើតគណនីថ្មីមួយឬចុចលើប៊ូតុង <b> បោះបង់ </b> ប៊ូតុង។

source: KMyMoney has found a scheduled transaction which matches an imported transaction.<br/>Schedule name: <b>%1</b><br/>Transaction: <i>%2 %3</i><br/>Do you want KMyMoney to enter this schedule now so that the transaction can be matched?
km: KMyMoney បានរកឃើញប្រតិបត្តិការដែលបានគ្រោងទុកដែលត្រូវនឹងប្រតិបត្តិការដែលបាននាំចូល។ <br/> ឈ្មោះតារាងពេលវេលា៖ <b> %1 </b><br/> ប្រតិបត្តិការ: <i> %2 %3 </i><br/> តើអ្នកចង់អោយ KMyMoney ចូលក្នុងកាលវិភាគនេះទេដូច្នេះប្រតិបត្តិការអាចត្រូវគ្នា?

source: Schedule found
km: រកឃើញកាលវិភាគ

source: <p><b>%1</b> is not a template file.</p>
km: <p><b> %1 </b> មិនមែនជាឯកសារគំរូទេ។ </p>

source: Filetype Error
km: កំហុសប្រភេទឯកសារ

source: <p>Error while reading template file <b>%1</b> in line %2, column %3</p>
km: <p> មានកំហុសពេលអានឯកសារគំរូ <b> %1 </b> ក្នុងជួរ %2, ជួរឈរ %3 </p>

source: Template Error
km: កំហុសគំរូ

source: File '%1' not found.
km: រកមិនឃើញឯកសារ '%1' ។

source: <p>Invalid tag <b>%1</b> in template file <b>%2</b></p>
km: <p> ស្លាកមិនត្រឹមត្រូវ <b> %1 </b> ក្នុងឯកសារគំរូ <b> %2 </b></p>

source: Loading template %1
km: កំពុងផ្ទុកគំរូ %1

source: <p>Invalid top-level account type <b>%1</b> in template file <b>%2</b></p>
km: <p> ប្រភេទគណនីជាន់ខាងលើមិនត្រឹមត្រូវ <b> %1 </b> ក្នុងឯកសារគំរូ <b> %2 </b></p>

source: <p>Invalid flag type <b>%1</b> for account <b>%3</b> in template file <b>%2</b></p>
km: <p> ប្រភេទទង់មិនត្រឹមត្រូវ <b> %1 </b> សម្រាប់គណនី <b> %3 </b> ក្នុងឯកសារគំរូ <b> %2 </b></p>

source: Unable to write changes to '%1'
km: មិនអាចសរសេរការផ្លាស់ប្តូរទៅ '%1'

source: Unable to upload to '%1'
km: មិនអាចផ្ទុកឡើងទៅ '%1'

source: Internal error - no matching splits
km: កំហុសខាងក្នុង - គ្មានការផ្គូផ្គងបំបែក

source: Internal error - no matching transactions
km: កំហុសខាងក្នុង - មិនមានប្រតិបត្តិការត្រូវគ្នាទេ

source: Internal error - no matching schedules
km: កំហុសខាងក្នុង - មិនមានកាលវិភាគត្រូវគ្នាទេ

source: %1 (Brokerage)
km: %1 (ជើងសា)

source: Price
km: តម្លៃ

# Finance
source: Price/share
km: តម្លៃ / ចំណែក

source: Transaction amount
km: ចំនួនប្រតិបត្តិការ

source: Interest
km: ចំណាប់អារម្មណ៍

source: Fees
km: ថ្លៃឈ្នួល

source: Account
km: គណនី

# Finance
source: Shares
km: ភាគហ៊ុន

# Total value
source: Total
km: សរុប

source: Shares
km: ភាគហ៊ុន

source: Ratio 1/
km: អនុបាត ១ /

source: Security
km: សន្តិសុខ

source: Asset account
km: គណនីទ្រព្យ

source: Tag
km: ស្លាក

source: Activity
km: សកម្មភាព

source: Date
km: កាលបរិច្ឆេទ

source: Memo
km: អនុសរណៈ

source: Status
km: ស្ថានភាព

source: Fee Amount
km: ចំនួនទឹកប្រាក់ថ្លៃសេវា

# Finance
source: Price/Share
km: តម្លៃ / ចំណែក

source: &Skip
km: រំលង

source: Skip this transaction
km: រំលងប្រតិបត្តិការនេះ

source: Use this to skip importing this transaction and proceed with the next one.
km: ប្រើវាដើម្បីរំលងការនាំចូលប្រតិបត្តិការនេះហើយបន្តជាមួយប្រតិបត្តិការបន្ទាប់។

source: &Create...
km: បង្កើត...

source: Create a new account/category
km: បង្កើតគណនី / ប្រភេទថ្មី

source: Use this to add a new account/category to the file
km: ប្រើវាដើម្បីបន្ថែមគណនី / ប្រភេទថ្មីទៅឯកសារ

source: &Abort
km: បោះបង់

source: Abort the import operation and dismiss all changes
km: បញ្ឈប់ប្រតិបត្តិការនាំចូលហើយច្រានចោលរាល់ការផ្លាស់ប្តូរ

source: Use this to abort the import. Your financial data will be in the state before you started the QIF import.
km: ប្រើវាដើម្បីបញ្ឈប់ការនាំចូល។ ទិន្នន័យហិរញ្ញវត្ថុរបស់អ្នកនឹងស្ថិតនៅក្នុងស្ថានភាពមុនពេលអ្នកចាប់ផ្តើមនាំចូល QIF ។

source: Account selection
km: ការជ្រើសរើសគណនី

source: Create
km: បង្កើត

source: Account to import to
km: គណនីត្រូវនាំចូល

source: OK
km: យល់ព្រម

source: Skip
km: រំលង

source: C&hoose...
km: ជ្រើសរើស ...

source: Select mount point
km: ជ្រើសរើសចំណុចម៉ោន

source: Use this to browse to the mount point.
km: ប្រើវាដើម្បីរកមើលចំណុចម៉ោន។

source: Backup
km: បម្រុងទុក

source: Use this dialog to backup your data. Please make sure you have a disk inserted and that the drive is ready. Then choose the mount point from either the Choose button or by entering the path in the available box. Click OK to perform the backup. If your system does not use an automounter, make sure you mark the checkbox below to "mount this directory before backing up."
km: ប្រើប្រអប់នេះដើម្បីបម្រុងទុកទិន្នន័យរបស់អ្នក។ សូមប្រាកដថាអ្នកបានបញ្ចូលថាសហើយដ្រាយបានត្រៀមរួចរាល់។ បន្ទាប់មកជ្រើសរើសចំណុចម៉ោនពីប៊ូតុងជ្រើសរឺដោយបញ្ចូលផ្លូវក្នុងប្រអប់ដែលមាន។ ចុចយល់ព្រមដើម្បីអនុវត្តការបម្រុងទុក។ ប្រសិនបើប្រព័ន្ធរបស់អ្នកមិនប្រើឧបករណ៍ស្វ័យប្រវត្ដិសូមប្រាកដថាអ្នកសម្គាល់ប្រអប់ធីកខាងក្រោមដើម្បី " ម៉ោនថតនេះមុនពេលបម្រុងទុក "

source: Device options
km: ជម្រើសឧបករណ៍

# This is the mount point
source: Mount Point:
km: ចំណុចម៉ោនថ៍៖

source: Choose...
km: ជ្រើសរើស ...

source: Mount this directory before backing up.
km: ម៉ោនថតឯកសារនេះមុនពេលបម្រុងទុក។

source: Cancel
km: បដិសេធ

source: Balance of %1
km: តុល្យភាពរបស់ %1

source: %1 Balance History
km: %1 ប្រវត្តិតុល្យភាព

source: Generated Report
km: របាយការណ៍បង្កើត

source: At least one transaction/schedule still references the category <b>%1</b>. However, at least one category with the same currency must exist so that the transactions/schedules can be reassigned.
km: យ៉ាងហោចណាស់ប្រតិបត្តិការ / កាលវិភាគមួយនៅតែជាប្រភេទឯកសារយោង <b> %1 </b> ។ ទោះយ៉ាងណាក៏ដោយយ៉ាងហោចណាស់មួយប្រភេទដែលមានរូបិយប័ណ្ណដូចគ្នាត្រូវតែមានដើម្បីឱ្យប្រតិបត្តិការ / កាលវិភាគអាចត្រូវបានកំណត់ឡើងវិញ។

source: This dialog does not allow new categories to be created. Please pick a category from the list.
km: ប្រអប់នេះមិនអនុញ្ញាតឱ្យបង្កើតប្រភេទថ្មីទេ។ សូមជ្រើសរើសប្រភេទមួយពីបញ្ជី។

source: Category creation
km: ការបង្កើតប្រភេទ

source: Reassign categories
km: ចាត់ចំណាត់ថ្នាក់ប្រភេទ

source: The transactions, schedules and budgets associated with the selected category need to be re-assigned to a different category before the selected category can be deleted. Please select a category from the list below.
km: ប្រតិបត្តិការកាលវិភាគនិងថវិកាដែលទាក់ទងនឹងប្រភេទដែលបានជ្រើសរើសចាំបាច់ត្រូវប្រគល់ទៅឱ្យប្រភេទផ្សេងទៀតមុនពេលប្រភេទដែលបានជ្រើសរើសអាចត្រូវបានលុបចោល។ សូមជ្រើសរើសប្រភេទមួយពីតារាងខាងក្រោម។

source: Available categories:
km: ប្រភេទដែលមាន៖

source: Please choose the type of import you wish to perform. A simple explanation of the import type is available at the bottom of the screen and is updated when you select an item from the choice box. Once you have chosen an import type please press the OK button.
km: សូមជ្រើសរើសប្រភេទការនាំចូលដែលអ្នកចង់អនុវត្ត។ ការពន្យល់ដ៏សាមញ្ញ នៃប្រភេទនាំចូលមាននៅផ្នែកខាងក្រោមនៃអេក្រង់ហើយត្រូវបានធ្វើបច្ចុប្បន្នភាពនៅពេល អ្នកជ្រើសរើសធាតុមួយពីប្រអប់ជ្រើសរើស។ ពេលអ្នកបានជ្រើសរើសប្រភេទនាំចូលសូមចុចប៊ូតុងយល់ព្រម។

source: Choose import type:
km: ជ្រើសរើសប្រភេទនាំចូល៖
