Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/breeze/breeze_kwin_deco.po
Languages: km

source: New Exception - Breeze Settings
km: ការលើកលែងថ្មី - ការកំណត់ខ្យល់

source: Edit Exception - Breeze Settings
km: កែសម្រួលការលើកលែង - ការកំណត់ខ្យល់

source: Question - Breeze Settings
km: សំណួរ - ការកំណត់ខ្យល់

source: Remove selected exception?
km: លុបករណីលើកលែងដែលបានជ្រើសរើស?

source: Remove
km: លុប

source: Warning - Breeze Settings
km: ការព្រមាន - ការកំណត់ខ្យល់

source: Regular Expression syntax is incorrect
km: វាក្យសម្ពន្ធកន្សោមធម្មតាមិនត្រឹមត្រូវ

source: Exception Type
km: ប្រភេទករណីលើកលែង

source: Regular Expression
km: កន្សោមធម្មតា

source: Window Title
km: ចំណងជើងផ្ទាំងកម្មវិធី

source: Window Class Name
km: ឈ្មោះថ្នាក់ផ្ទាំងកម្មវិធី

source: Enable/disable this exception
km: បើក / បិទការលើកលែងនេះ

source: General
km: ទូទៅ

source: Tit&le alignment:
km: តម្រឹមចំណងជើង៖

source: B&utton size:
km: ទំហំប៊ូតុង៖

source: Tiny
km: តូច

# @item:inlistbox Button size:
source: Small
km: តូច

# @item:inlistbox Button size:
source: Medium
km: មធ្យម

# @item:inlistbox Button size:
source: Large
km: ធ

# @item:inlistbox Button size:
source: Very Large
km: ធំណាស់

source: Left
km: ឆ្វេង

source: Center
km: កណ្តាល

source: Center (Full Width)
km: មជ្ឈមណ្ឌល (ទទឹងពេញ)

source: Right
km: ត្រូវ

source: Add handle to resize windows with no border
km: បន្ថែមចំណុចទាញដើម្បីប្ដូរទំហំផ្ទាំងកម្មវិធីដោយគ្មានព្រំដែន

source: Draw separator under active window's titlebar
km: គូរសញ្ញាបំបែកនៅក្រោមរបារចំណងជើងរបស់ផ្ទាំងកម្មវិធីសកម្ម

source: Allow resizing maximized windows from window edges
km: អនុញ្ញាតឱ្យផ្លាស់ប្តូរទំហំផ្ទាំងកម្មវិធីអតិបរមាពីគែមផ្ទាំងកម្មវិធី

source: Draw a circle around close button
km: គូររង្វង់ជុំវិញប៊ូតុងបិទ

source: Draw titlebar background gradient
km: គូរជម្រាលផ្ទៃខាងក្រោយនៃរបារចំណងជើង

source: Shadows
km: ស្រមោល

source: Si&ze:
km: ទំហំ៖

# @item:inlistbox Button size:
source: None
km: គ្មាន

# strength of the shadow (from transparent to opaque)
source: S&trength:
km: ភាពខ្លាំង៖

source: Color:
km: ពណ៌៖

source: Window-Specific Overrides
km: ការបដិសេធផ្ទាំងកម្មវិធីជាក់លាក់

source: Dialog
km: ប្រអប់

source: Information about Selected Window
km: ព័ត៌មានអំពីផ្ទាំងកម្មវិធីដែលបានជ្រើសរើស

source: Class:
km: ថ្នាក់​ ៖

source: Title:
km: ចំណងជើង៖

source: Window Property Selection
km: ការជ្រើសរើសទ្រព្យសម្បត្តិផ្ទាំងកម្មវិធី

source: Use window class (whole application)
km: ប្រើថ្នាក់ផ្ទាំងកម្មវិធី (កម្មវិធីទាំងមូល)

source: Use window title
km: ប្រើចំណងជើងផ្ទាំងកម្មវិធី

source: Window Identification
km: ការកំណត់អត្តសញ្ញាណផ្ទាំងកម្មវិធី

source: &Matching window property:
km: ការផ្គូផ្គងលក្ខណសម្បត្តិផ្ទាំងកម្មវិធី៖

source: Regular expression &to match:
km: កន្សោមធម្មតាត្រូវនឹង៖

source: Detect Window Properties
km: រកឃើញលក្ខណៈសម្បត្តិផ្ទាំងកម្មវិធី

source: Decoration Options
km: ជម្រើសតុបតែង

source: Border size:
km: ទំហំព្រំដែន៖

source: Hide window title bar
km: លាក់របារចំណងជើងផ្ទាំងកម្មវិធី

# @item:inlistbox Border size:
source: No Border
km: គ្មានព្រំដែន

# @item:inlistbox Border size:
source: No Side Borders
km: គ្មានព្រំប្រទល់ចំហៀង

# @item:inlistbox Border size:
source: Tiny
km: តូច

# @item:inlistbox Border size:
source: Normal
km: ធម្មតា

# @item:inlistbox Border size:
source: Large
km: ធំ

# @item:inlistbox Border size:
source: Very Large
km: ធំណាស់

# @item:inlistbox Border size:
source: Huge
km: សម្បើមណាស់

# @item:inlistbox Border size:
source: Very Huge
km: ខ្លាំងណាស់

# @item:inlistbox Border size:
source: Oversized
km: ហួសកំរិត

source: Move Up
km: ផ្លាស់ទីឡើងលើ

source: Move Down
km: ទៅ​ក្រោម

source: Add
km: បន្ថែម

source: Edit
km: កែសម្រួល
