Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/breeze/breeze_style_config.po
Languages: km

source: Breeze Settings
km: ការកំណត់ខ្យល់

source: General
km: ទូទៅ

source: W&indows' drag mode:
km: របៀបអូសរបស់វីនដូ៖

source: Draw focus indicator in lists
km: គូរសូចនាករផ្តោតអារម្មណ៍នៅក្នុងបញ្ជី

source: &Keyboard accelerators visibility:
km: ភាពមើលឃើញនៃឧបករណ៍បង្កើនល្បឿនក្តារចុច៖

source: Always Hide Keyboard Accelerators
km: លាក់ឧបករណ៍បង្កើនល្បឿនក្តារចុចជានិច្ច

source: Show Keyboard Accelerators When Needed
km: បង្ហាញឧបករណ៍បង្កើនល្បឿនក្តារចុចនៅពេលត្រូវការ

source: Always Show Keyboard Accelerators
km: បង្ហាញឧបករណ៍បង្កើនល្បឿនក្តារចុចជានិច្ច

source: Drag windows from titlebar only
km: ទាញផ្ទាំងវិនដូពីរបារចំណងជើង

source: Drag windows from titlebar, menubar and toolbars
km: ទាញផ្ទាំងកម្មវិធីចេញពីរបារចំណងជើងរបារម៉ឺនុយនិងរបារឧបករណ៍

source: Drag windows from all empty areas
km: ទាញផ្ទាំងវិនដូពីគ្រប់ទិសទី

source: Center tabbar tabs
km: ផ្ទាំងផ្ទាំងកណ្តាល

source: Draw toolbar item separators
km: គូរឧបករណ៍បំបែកធាតុរបារឧបករណ៍

source: Draw slider tick marks
km: គូសសញ្ញាធីករំកិល

source: Enable extended resize handles
km: បើកដំណើរការចំណុចទាញទំហំពង្រីក

source: Frames
km: ស៊ុម

source: Draw frame around dockable panels
km: គូរស៊ុមជុំវិញបន្ទះដែលអាចចតបាន

source: Draw frame around page titles
km: គូរស៊ុមជុំវិញចំណងជើងទំព័រ

source: Draw frame around side panels
km: គូរស៊ុមជុំវិញបន្ទះចំហៀង

source: Draw a thin line to indicate focus in menus and menubars
km: គូរបន្ទាត់ស្តើងដើម្បីបង្ហាញការផ្តោតអារម្មណ៍នៅក្នុងម៉ឺនុយនិងរបារម៉ឺនុយ

source: Scrollbars
km: រមូរ

source: Bottom arrow button t&ype:
km: ប្រភេទប៊ូតុងព្រួញក្រោម៖

source: &Top arrow button type:
km: ប្រភេទប៊ូតុងព្រួញកំពូល៖

source: No Buttons
km: គ្មានប៊ូតុងទេ

source: One Button
km: ប៊ូតុងមួយ

source: Two Buttons
km: ប៊ូតុងពីរ

source: Transparency
km: តម្លាភាព

source: Transparent
km: ថ្លា

source: Opaque
km: ស្រអាប់

source: Menu:
km: ម៉ឺនុយ៖
