Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/breeze/breeze._desktop_.po
Languages: km

# Name
source: Breeze
km: ខ្យល់

# Name
source: Breeze Dark
km: ខ្យល់ងងឹត

# Name
source: Breeze High Contrast
km: ខ្យល់កម្រិតពណ៌ខ្ពស់

# Name
source: Breeze Light
km: ពន្លឺខ្យល់

# Comment
source: Breeze by the KDE VDG
km: ខ្យល់អាកាសដោយដាប់ខេយូអេស

# Comment
source: Breeze Light by the KDE VDG
km: ពន្លឺខ្យល់ដោយ KDE VDG

# Name
source: Breeze Window Decoration
km: ការតុបតែងផ្ទាំងកម្មវិធីខ្យល់

# Comment
source: Modify the appearance of window decorations
km: កែប្រែរូបរាងនៃការតុបតែងផ្ទាំងកម្មវិធី

# X-KDE-Keywords
source: breeze,decoration
km: ខ្យល់តុបតែង

# Comment
source: Widget style for KDE Frameworks
km: រចនាប័ទ្មធាតុក្រាហ្វិកសម្រាប់គ្រោង KDE

# Name
source: Breeze Widget Style
km: រចនាប័ទ្មធាតុក្រាហ្វិកខ្យល់

# Comment
source: Modify the appearance of widgets
km: កែប្រែរូបរាងរបស់ធាតុក្រាហ្វិក

# X-KDE-Keywords
source: breeze,widget,style
km: ខ្យល់ធាតុក្រាហ្វិករចនាប័ទ្ម

# Comment
source: Breeze Dark by the KDE VDG
km: ខ្យល់ងងឹតដោយ KDE VDG

# Name
source: Shell
km: សែល
