Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/akonadi-import-wizard/akonadiimportwizard.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: No program found.
km: រកមិនឃើញកម្មវិធី។

# @title:window
source: PIM Import Tool
km: ឧបករណ៍នាំចូល PIM

source: Close KMail before importing data. Some plugins will modify KMail config file.
km: បិទ KMail មុនពេលនាំចូលទិន្នន័យ។ កម្មវិធីជំនួយមួយចំនួននឹងកែប្រែឯកសារកំណត់រចនាសម្ព័ន្ធ KMail ។

source: Step 1: Select Filter
km: ជំហានទី 1៖ ជ្រើសរើសយកតម្រង

source: Step 2: Importing...
km: ជំហានទី ២៖ ការនាំចូល ...

source: Detect program
km: រកឃើញកម្មវិធី

source: Select material to import
km: ជ្រើសរើសសម្ភារៈដើម្បីនាំចូល

source: Import mail messages
km: នាំចូលសារអ៊ីមែល

source: Import mail filters
km: នាំចូលតម្រងអ៊ីមែល

source: Import settings
km: កំណត់ការនាំចូល

source: Import addressbooks
km: នាំចូលសៀវភៅអាសយដ្ឋាន

source: Import calendars
km: នាំចូលប្រតិទិន

source: Finish
km: បញ្ចប់

source: Import addressbook from %1...
km: នាំចូលសៀវភៅអាសយដ្ឋានពី %1 ...

source: Import addressbook from %1: Done
km: សៀវភៅអាសយដ្ឋាននាំចូលពី %1៖ រួចរាល់

source: Import filters from %1...
km: នាំចូលតម្រងពី %1 ...

source: Import filters from %1: Done
km: នាំចូលតម្រងពី %1៖ រួចរាល់

source: Import mails from %1...
km: នាំចូលសំបុត្រពី %1 ...

source: Import mails from %1: Done
km: នាំចូលសំបុត្រពី %1៖ រួចរាល់

source: Import settings from %1...
km: នាំចូលការកំណត់ពី %1 ...

source: Import settings from %1: Done
km: កំណត់ការនាំចូលពី %1៖ ធ្វើរួច

source: Import calendar from %1...
km: នាំចូលប្រតិទិនពី %1 ...

source: Import calendar from %1: Done
km: នាំចូលប្រតិទិនពី %1៖ ធ្វើរួច

source: Import in progress
km: ការនាំចូលកំពុងដំណើរការ

source: Import finished
km: ការនាំចូលបានបញ្ចប់

source: Creating new contact...
km: កំពុងបង្កើតទំនាក់ទំនងថ្មី ...

# @title:window
source: Select Address Book
km: ជ្រើសសៀវភៅអាសយដ្ឋាន

source: Select the address book the new contact shall be saved in:
km: ជ្រើសរើសសៀវភៅអាសយដ្ឋានទំនាក់ទំនងថ្មីនឹងត្រូវបានរក្សាទុកក្នុង

source: Address Book was not selected.
km: សៀវភៅអាសយដ្ឋានមិនត្រូវបានជ្រើសរើសទេ។

source: Imported from "%1"
km: នាំចូលពី " %1"

source: Error during contact creation: %1
km: កំហុសក្នុងការបង្កើតទំនាក់ទំនង៖ %1

source: Contact creation complete
km: ការបង្កើតទំនាក់ទំនងបានបញ្ចប់

source: Importing of filters from "%1" was canceled.
km: ការនាំចូលតម្រងពី " %1" ត្រូវបានលុបចោល។

source: 1 filter was imported from "%2"
km: តម្រង ១ ត្រូវបាននាំចូលពី " %2"

source: Filters file was not found
km: រកមិនឃើញឯកសារតម្រង

source: Setting up identity...
km: កំពុងកំណត់អត្តសញ្ញាណ ...

source: Identity set up.
km: បង្កើតអត្តសញ្ញាណ។

source: Setting up transport...
km: រៀបចំការដឹកជញ្ជូន ...

source: Transport set up.
km: រៀបចំការដឹកជញ្ជូន។

source: PIM Import Tool
km: ឧបករណ៍នាំចូលភី។ អេ។ ភី

source: Copyright © 2012-2020 ImportWizard authors
km: រក្សាសិទ្ធិ© ២០១២-២០២០ អ្នកនិពន្ធនាំចូលអ្នកជំនួយការនាំចូល

source: Maintainer
km: អ្នកថែរក្សា

source: Mode: %1
km: របៀប៖ %1

source: <p><i>Written by %1.</i></p>
km: <p><i> សរសេរដោយ %1 ។ </i></p>

source: No addressbook found
km: រកមិនឃើញសៀវភៅអាសយដ្ឋានទេ

source: Ldap created
km: បានបង្កើត Ldap

source: New addressbook created: %1
km: សៀវភៅអាសយដ្ឋានថ្មីត្រូវបានបង្កើត៖ %1

source: Claws Mail settings not found.
km: រកមិនឃើញការកំណត់អ៊ីមែលក្រញ៉ាំ។

source: Evolution address book will be exported as vCard. Import vCard in KAddressBook.
km: សៀវភៅអាសយដ្ឋានវិវត្តនឹងត្រូវនាំចេញជា vCard ។ នាំចូល vCard នៅក្នុង KAddressBook ។

source: Export Evolution Address Book
km: នាំចេញសៀវភៅអាសយដ្ឋានវិវត្ត

source: Select the directory where vCards will be stored.
km: ជ្រើសរើសថតឯកសារដែលប័ណ្ណ vCards នឹងត្រូវរក្សាទុក។

source: Address book "%1" exported.
km: សៀវភៅអាសយដ្ឋាន " %1" នាំចេញ។

source: Failed to export address book "%1".
km: បានបរាជ័យក្នុងការនាំចេញសៀវភៅអាសយដ្ឋាន " %1" ។

source: Evolution settings not found.
km: រកមិនឃើញការកំណត់វិវត្ត។

source: Evolution calendar not found.
km: រកមិនឃើញប្រតិទិនវិវត្ត។

source: Icedove settings not found.
km: រកមិនឃើញការកំណត់ Icedove ។

source: SeaMonkey settings not found.
km: រកមិនឃើញការកំណត់ SeaMonkey ។

source: No contact found in %1
km: រកមិនឃើញទំនាក់ទំនងនៅក្នុង %1

source: Sylpheed settings not found.
km: រកមិនឃើញការកំណត់ Sylpheed ។

source: Contacts file '%1' not found
km: រកមិនឃើញឯកសារទំនាក់ទំនង '%1'

source: Thunderbird settings not found.
km: រកមិនឃើញការកំណត់មយូរា។

source: Import addressbook
km: សៀវភៅអាសយដ្ឋាននាំចូល

source: Import calendar
km: នាំចូលប្រតិទិន

source: Import Filters
km: នាំចូលតម្រង

source: Summary:
km: សង្ខេប៖

source: Please select the folder to import to:
km: សូមជ្រើសរើសថតឯកសារដើម្បីនាំចូលទៅ៖

source: Import Mails
km: នាំចូលសំបុត្រ

source: Mails
km: អ៊ីមែល

source: Filters
km: តម្រង

source: Settings
km: ការកំណត់

source: Address Books
km: សៀវភៅអាសយដ្ឋាន

source: Calendars
km: ប្រតិទិន

source: This wizard will import mail messages, addressbook entries, filters and/or settings from other mail programs into KMail
km: អ្នកជំនួយការនេះនឹងនាំចូលសារអ៊ីមែលធាតុសៀវភៅអាសយដ្ឋានតម្រងនិង / ឬការកំណត់ពីកម្មវិធីអ៊ីមែលផ្សេងទៀតចូល KMail

source: Or select types of material to import:
km: ឬជ្រើសរើសប្រភេទសម្ភារៈដើម្បីនាំចូល៖

source: Import Everything
km: នាំចូលអ្វីគ្រប់យ៉ាង

source: Please select the program from which you like to import:
km: សូមជ្រើសរើសកម្មវិធីដែលអ្នកចង់នាំចូល៖

source: No program found
km: រកមិនឃើញកម្មវិធី

source: Manual Selection
km: ការជ្រើសរើសដោយដៃ

source: Click 'Back' to import more emails
km: ចុច 'ថយក្រោយ' ដើម្បីនាំចូលអ៊ីមែលបន្ថែម

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:600;">Welcome to ImportWizard The Mail Import Tool</span><span style=" font-family:'DejaVu Sans'; font-size:9pt;"> <br /><br />This program will help you import your email from your previous email program.<br /><br />Please select the program you would like to import from. Next, select the folder you would like to import to, then click 'Next'.</span></p></body></html>
km: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:600;">សូមស្វាគមន៍មកកាន់អ្នកជំនួយការនាំចូលឧបករណ៍នាំសំបុត្រ </span><span style=" font-family៖'DejaVu Sans'; font-size៖9pt;"><br /><br /> កម្មវិធីនេះនឹងជួយអ្នកក្នុងការនាំចូលអ៊ីមែលពីកម្មវិធីអ៊ីមែលពីមុនរបស់អ្នក។ <br /><br /> សូមជ្រើសរើសកម្មវិធីដែលអ្នកចង់នាំចូល។ បន្ទាប់ជ្រើសថតដែលអ្នកចង់នាំចូលបន្ទាប់មកចុច 'បន្ទាប់' ។ </span></p></body></html>

source: Remove &duplicate messages during import
km: លុបសារស្ទួនពេលនាំចូល
