Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/akonadi-contacts/kcm_akonadicontact_actions.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: Show Address
km: បង្ហាញអាសយដ្ឋាន

source: Command:
km: ពាក្យបញ្ជា៖

source: Dial Phone Number
km: ចុចលេខទូរស័ព្ទ

source: Send SMS
km: ផ្ញើសារជាអក្សរ

source: Contact Actions Settings
km: ការកំណត់សកម្មភាពទំនាក់ទំនង

source: (c) 2009 Tobias Koenig
km: (c) ឆ្នាំ ២០០៩ ថូប៊ីស Koenig

source: System Default
km: លំនាំដើមប្រព័ន្ធ

source: Skype
km: ស្កាយភ៍

source: SflPhone
km: សូផូផុន

source: External Application
km: ពាក្យសុំខាងក្រៅ

source: Web Browser
km: កម្មវិធី​រុករក​បណ្ដាញ

source: Google map
km: ផែនទី​ហ្គូហ្គល

source: Map quest
km: ដំណើរស្វែងរកផែនទី
