Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/akonadi/libakonadi5.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: There is currently no account configured.
km: បច្ចុប្បន្នមិនមានគណនីត្រូវបានកំណត់រចនាសម្ព័ន្ធទេ។

source: Accounts integration is not supported
km: ការរួមបញ្ចូលគណនីមិនត្រូវបានគាំទ្រទេ

source: Unable to register object at dbus: %1
km: មិនអាចចុះឈ្មោះវត្ថុនៅ dbus: %1

# Name and type of Akonadi resource
source: %1 of type %2
km: %1 នៃប្រភេទ %2

source: Agent identifier
km: អ្នកកំណត់អត្តសញ្ញាណភ្នាក់ងារ

source: Akonadi Agent
km: ភ្នាក់ងារអាគីណាឌី

# @info:status Application ready for work
source: Ready
km: រួចរាល់ហើយ

# @info:status
source: Offline
km: ក្រៅអ៊ីនធឺណិត

# @info:status
source: Syncing...
km: កំពុងធ្វើសមកាលកម្ម ...

# @info:status
source: Error.
km: កំហុស។

# @info:status
source: Not configured
km: មិនបានកំណត់រចនាសម្ព័ន្ធ

# @label command line option
source: Resource identifier
km: ឧបករណ៍សម្គាល់ធនធាន

source: Akonadi Resource
km: ធនធាន Akonadi

# @info
source: Invalid item retrieved
km: បានទាញយកធាតុមិនត្រឹមត្រូវ

# @info
source: Error while creating item: %1
km: កំហុសពេលបង្កើតធាតុ៖ %1

# @info
source: Error while updating collection: %1
km: មានកំហុសពេលធ្វើបច្ចុប្បន្នភាពបណ្តុំ៖ %1

# @info
source: Updating local collection failed: %1.
km: ការធ្វើបច្ចុប្បន្នភាពការប្រមូលមូលដ្ឋានបានបរាជ័យ៖ %1 ។

# @info
source: Updating local items failed: %1.
km: ការធ្វើបច្ចុប្បន្នភាពធាតុក្នុងស្រុកបានបរាជ័យ៖ %1 ។

# @info
source: Cannot fetch item in offline mode.
km: មិនអាចទៅរកធាតុនៅក្នុងរបៀបក្រៅបណ្តាញទេ។

# @info:status
source: Syncing folder '%1'
km: ធ្វើសមកាលកម្មថតឯកសារ '%1'

source: Failed to retrieve collection for sync.
km: បានបរាជ័យក្នុងការទាញយកកម្រងសម្រាប់សមកាលកម្ម។

source: Failed to retrieve collection for attribute sync.
km: បានបរាជ័យក្នុងការទាញយកការប្រមូលសម្រាប់ការធ្វើសមកាលកម្មគុណលក្ខណៈ។

source: The requested item no longer exists
km: ធាតុដែលបានស្នើមិនមានទៀតទេ

# @info
source: Job canceled.
km: បានបោះបង់ការងារ។

source: No such collection.
km: គ្មានការប្រមូលបែបនេះទេ។

source: Found unresolved orphan collections
km: រកឃើញការប្រមូលក្មេងកំព្រាដែលមិនទាន់ដោះស្រាយ

source: Did not find other item for conflict handling
km: មិនបានរកឃើញធាតុផ្សេងទៀតសម្រាប់ដោះស្រាយជម្លោះទេ

source: Unable to access D-Bus interface of created agent.
km: មិនអាចចូលប្រើចំណុចប្រទាក់ D-Bus របស់ភ្នាក់ងារដែលបានបង្កើតទេ។

source: Agent instance creation timed out.
km: ការបង្កើតឧទាហរណ៍ភ្នាក់ងារបានអស់ពេល។

source: Unable to obtain agent type '%1'.
km: មិនអាចទទួលយកប្រភេទភ្នាក់ងារ '%1' ។

source: Unable to create agent instance.
km: មិនអាចបង្កើតវត្ថុភ្នាក់ងារទេ។

source: Invalid collection instance.
km: ឧទាហរណ៍ការប្រមូលមិនត្រឹមត្រូវ។

source: Invalid resource instance.
km: វត្ថុធនធានមិនត្រឹមត្រូវ។

source: Unable to obtain D-Bus interface for resource '%1'
km: មិនអាចទទួលបានចំណុចប្រទាក់ D-Bus សម្រាប់ធនធាន '%1'

source: Collection attributes synchronization timed out.
km: គុណលក្ខណៈសមកាលកម្មនៃការប្រមូលបានអស់ពេល។

source: Invalid collection to copy
km: ការប្រមូលមិនត្រឹមត្រូវដើម្បីចម្លង

source: Invalid destination collection
km: ការប្រមូលទិសដៅមិនត្រឹមត្រូវ

source: Invalid parent
km: មេមិនត្រឹមត្រូវ

source: Failed to parse Collection from response
km: បានបរាជ័យក្នុងការញែកការប្រមូលពីការឆ្លើយតប

source: Invalid collection
km: ការប្រមូលមិនត្រឹមត្រូវ

source: Invalid collection given.
km: ការប្រមូលមិនត្រឹមត្រូវ។

source: No objects specified for moving
km: គ្មានវត្ថុដែលបានបញ្ជាក់សម្រាប់ផ្លាស់ទីទេ

source: No valid destination specified
km: មិនបានបញ្ជាក់ទិសដៅត្រឹមត្រូវ

source: Invalid collection.
km: ការប្រមូលមិនត្រឹមត្រូវ។

source: Invalid parent collection
km: ការប្រមូលមេមិនត្រឹមត្រូវ

source: Cannot connect to the Akonadi service.
km: មិនអាចភ្ជាប់ទៅសេវាកម្ម Akonadi បានទេ។

source: The protocol version of the Akonadi server is incompatible. Make sure you have a compatible version installed.
km: ប្រូតូកូលពិធីការរបស់ម៉ាស៊ីនមេអាគីណាឌីមិនត្រូវគ្នា។ ត្រូវប្រាកដថាអ្នកបានតំឡើងកំណែដែលត្រូវគ្នា។

source: User canceled operation.
km: អ្នកប្រើប្រាស់បានលុបចោលប្រតិបត្តិការ។

source: Unknown error.
km: កំហុសមិនស្គាល់។

source: Unexpected response
km: ការឆ្លើយតបដែលមិនបានរំពឹងទុក

source: Failed to create relation.
km: បានបរាជ័យក្នុងការបង្កើតទំនាក់ទំនង។

source: Resource synchronization timed out.
km: ការធ្វើសមកាលកម្មធនធានអស់ពេល។

source: Could not fetch root collection of resource %1.
km: មិនអាចប្រមូលយកប្រភពដើមនៃធនធាន %1 ។

source: No resource ID given.
km: មិនមានលេខសម្គាល់ធនធានដែលបានផ្តល់ឱ្យទេ។

source: Invalid resource identifier '%1'
km: អត្តសញ្ញាណធនធានមិនត្រឹមត្រូវ '%1'

source: Failed to configure default resource via D-Bus.
km: បានបរាជ័យក្នុងការកំណត់រចនាសម្ព័ន្ធធនធានលំនាំដើមតាមរយៈ D-Bus ។

source: Failed to fetch the resource collection.
km: បានបរាជ័យក្នុងការទៅប្រមូលការប្រមូលធនធាន។

source: Timeout trying to get lock.
km: អស់ពេលព្យាយាមចាក់សោ។

source: Failed to create tag.
km: បានបរាជ័យក្នុងការបង្កើតស្លាក។

source: Move to trash collection failed, aborting trash operation
km: ផ្លាស់ទីទៅការប្រមូលសំរាមបានបរាជ័យបោះបង់ប្រតិបត្តិការសំរាម

source: Invalid items passed
km: បានបញ្ជូនធាតុមិនត្រឹមត្រូវ

source: Invalid collection passed
km: បានប្រមូលការប្រមូលមិនត្រឹមត្រូវ

source: No valid collection or empty itemlist
km: គ្មានការប្រមូលត្រឹមត្រូវឬបញ្ជីធាតុទទេ

source: Could not find restore collection and restore resource is not available
km: មិនអាចរកឃើញការប្រមូលផ្តុំនិងការស្តារធនធានឡើងវិញទេ

# @title:column, name of a thing
source: Name
km: ឈ្មោះ

# @info:status
source: Loading...
km: កំពុងផ្ទុក ...

# @window:title
source: Error
km: កំហុស

source: The target collection '%1' contains already a collection with name '%2'.
km: ការប្រមូលគោលដៅ '%1' មានផ្ទុក ដែលមានឈ្មោះ '%2' រួចហើយ។

# @title:column Name of a thing
source: Name
km: ឈ្មោះ

# @info
source: Could not copy item: <message>%1</message>
km: មិនអាចចម្លងធាតុ៖ <message> %1 </message>

# @info
source: Could not copy collection: <message>%1</message>
km: មិនអាចចម្លងការប្រមូលបានទេ <message> %1 </message>

# @info
source: Could not move item: <message>%1</message>
km: មិនអាចផ្លាស់ទីធាតុ៖ <message> %1 </message>

# @info
source: Could not move collection: <message>%1</message>
km: មិនអាចផ្លាស់ទីបណ្តុំ៖ <message> %1 </message>

# @info
source: Could not link entity: <message>%1</message>
km: មិនអាចភ្ជាប់អង្គភាព៖ <message> %1 </message>

# @title:window
source: Error
km: កំហុស

source: Favorite Folders
km: ថតដែលខ្ញុំចូលចិត្ត

source: Total Messages
km: សារសរុប

source: Unread Messages
km: សារមិនទាន់អាន

source: Quota
km: កូតា

source: Storage Size
km: ទំហំផ្ទុក

source: Subfolder Storage Size
km: ទំហំផ្ទុកឯកសាររង

# number of unread entities in the collection
source: Unread
km: មិនទាន់អាន

# number of entities in the collection
source: Total
km: សរុប

# collection size
source: Size
km: ទំហំ

source: Tag
km: ស្លាក

source: Unable to fetch item for index
km: មិនអាចទៅរកធាតុសម្រាប់សន្ទស្សន៍

source: Index is no longer available
km: លិបិក្រមមិនមានទៀតទេ

source: Payload part '%1' is not available for this index
km: ផ្នែកបង់ប្រាក់ '%1' មិនមានសម្រាប់លិបិក្រមនេះទេ

source: No session available for this index
km: មិនមានវគ្គសម្រាប់លិបិក្រមនេះទេ

source: No item available for this index
km: មិនមានធាតុសម្រាប់សន្ទស្សន៍នេះទេ

source: Unnamed plugin
km: កម្មវិធីជំនួយគ្មានឈ្មោះ

source: No description available
km: មិនមានការពិពណ៌នាទេ

source: The Akonadi server protocol version differs from the protocol version used by this application. If you recently updated your system please log out and back in to make sure all applications use the correct protocol version.
km: កំណែពិធីការរបស់ម៉ាស៊ីនមេ Akonadi ខុសគ្នាពីកំណែពិធីការដែលប្រើដោយកម្មវិធីនេះ។ ប្រសិនបើអ្នកបានធ្វើឱ្យទាន់សម័យប្រព័ន្ធរបស់អ្នកថ្មីៗនេះសូមចាកចេញនិងចូលដើម្បីប្រាកដថាកម្មវិធីទាំងអស់ប្រើកំណែពិធីការត្រឹមត្រូវ។

source: There are no Akonadi Agents available. Please verify your KDE PIM installation.
km: មិនមានភ្នាក់ងារ Akonadi អាចប្រើបានទេ។ សូមផ្ទៀងផ្ទាត់ការដំឡើង KDE PIM របស់អ្នក។

source: Protocol version mismatch. Server version is older (%1) than ours (%2). If you updated your system recently please restart the Akonadi server.
km: កំណែពិធីការមិនត្រូវគ្នា។ កំណែម៉ាស៊ីនមេចាស់ (%1) ជាងរបស់យើង (%2) ។ ប្រសិនបើអ្នកបានធ្វើបច្ចុប្បន្នភាពប្រព័ន្ធរបស់អ្នកថ្មីៗនេះសូមចាប់ផ្តើមម៉ាស៊ីនមេ Akonadi ឡើងវិញ។

source: Protocol version mismatch. Server version is newer (%1) than ours (%2). If you updated your system recently please restart all KDE PIM applications.
km: កំណែពិធីការមិនត្រូវគ្នា។ កំណែម៉ាស៊ីនមេគឺថ្មី (%1) ជាងរបស់យើង (%2) ។ ប្រសិនបើអ្នកបានធ្វើបច្ចុប្បន្នភាពប្រព័ន្ធរបស់អ្នកថ្មីៗនេះសូមចាប់ផ្តើមកម្មវិធី KDE PIM ទាំងអស់ឡើងវិញ។

source: Akonadi Self Test
km: ការធ្វើតេស្តិ៍ខ្លួនឯងដោយខ្លួនឯង

source: Checks and reports state of Akonadi server
km: មូលប្បទានប័ត្រនិងរាយការណ៍អំពីម៉ាស៊ីនមេ Akonadi

source: (c) 2008 Volker Krause <vkrause@kde.org>
km: (c) វ៉ុលឆឺរក្រូសូសឆ្នាំ ២០០៨ <vkrause@kde.org>

source: &New Agent Instance...
km: ភ្នាក់ងារភ្នាក់ងារថ្មី ...

source: &Delete Agent Instance
km: លុបភ្នាក់ងារភ្នាក់ងារ

source: &Configure Agent Instance
km: កំណត់រចនាសម្ព័ន្ធភ្នាក់ងារភ្នាក់ងារ

# @title:window
source: New Agent Instance
km: ភ្នាក់ងារភ្នាក់ងារថ្មី

source: Could not create agent instance: %1
km: មិនអាចបង្កើតឧទាហរណ៍ភ្នាក់ងារទេ៖ %1

source: Agent instance creation failed
km: ការបង្កើតឧទាហរណ៍ភ្នាក់ងារបានបរាជ័យ

# @title:window
source: Delete Agent Instance?
km: លុបភ្នាក់ងារ?

source: Do you really want to delete the selected agent instance?
km: តើអ្នកពិតជាចង់លុបឧទាហរណ៍ភ្នាក់ងារដែលបានជ្រើសរើសឬ?

# %1 = agent name
source: %1 Configuration
km: ការកំណត់រចនាសម្ព័ន្ធ %1

source: %1 Handbook
km: សៀវភៅដៃ %1

source: About %1
km: អំពី %1

source: The configuration dialog has been opened in another window
km: ប្រអប់កំណត់រចនាសម្ព័ន្ធត្រូវបានបើកនៅក្នុងផ្ទាំងកម្មវិធីផ្សេងទៀត

source: Configuration for %1 is already opened elsewhere.
km: ការកំណត់រចនាសម្ព័ន្ធសម្រាប់ %1 ត្រូវបានបើកនៅកន្លែងផ្សេងទៀតរួចហើយ។

source: Failed to register %1 configuration dialog.
km: បានបរាជ័យក្នុងការចុះឈ្មោះប្រអប់កំណត់រចនាសម្ព័ន្ធ %1 ។

source: minute
km: នាទី

source: Retrieval
km: ទៅយក

source: Use options from parent folder or account
km: ប្រើជម្រើសពីថតមេឬគណនី

source: Synchronize when selecting this folder
km: ធ្វើសមកាលកម្មនៅពេលជ្រើសរើសថតនេះ

source: Automatically synchronize after:
km: ធ្វើសមកាលកម្មដោយស្វ័យប្រវត្តិបន្ទាប់ពី៖

# never check the cache
source: Never
km: មិនដែល

source: minutes
km: នាទី

source: Locally Cached Parts
km: ផ្នែកឃ្លាំងសម្ងាត់ក្នុងស្រុក

source: Retrieval Options
km: ជម្រើសនៃការទៅយក

source: Always retrieve full &messages
km: ទាញយកសារពេញលេញជានិច្ច

source: &Retrieve message bodies on demand
km: ទៅយកសារសារតាមតម្រូវការ

source: Keep message bodies locally for:
km: រក្សាទុកសារក្នុងមូលដ្ឋានសម្រាប់៖

# no cache timeout
source: Forever
km: ជារៀងរហូត

# @info Displayed grayed-out inside the textbox, verb to search
source: Search
km: ស្វែងរក

source: Use folder by default
km: ប្រើថតឯកសារតាមលំនាំដើម

source: &New Subfolder...
km: ថតរងថ្មី ...

source: Create a new subfolder under the currently selected folder
km: បង្កើតថតរងថ្មីក្រោមថតដែលបានជ្រើសបច្ចុប្បន្ន

# @title:window
source: New Folder
km: ប្រអប់​ឯកសារ​ថ្មី

# @label:textbox, name of a thing
source: Name
km: ឈ្មោះ

source: Folder creation failed
km: ការបង្កើតថតបានបរាជ័យ

source: Could not create folder: %1
km: មិនអាចបង្កើតថតឯកសារបានទេ៖ %1

# @title:tab general properties page
source: General
km: ទូទៅ

# @label
source: One object
km: វត្ថុមួយ

source: &Name:
km: ឈ្មោះ៖

source: &Use custom icon:
km: ប្រើរូបតំណាងផ្ទាល់ខ្លួន៖

source: folder
km: ថតឯកសារ

source: Statistics
km: ស្ថិតិ

# object names
source: Content:
km: មាតិកា៖

source: 0 objects
km: វត្ថុ ០

source: Size:
km: ទំហំ៖

source: 0 Byte
km: 0 បៃ

source: Remember that indexing can take some minutes.
km: ចងចាំថាការធ្វើលិបិក្រមអាចចំណាយពេលខ្លះ។

source: Maintenance
km: ថែទាំ

source: Error while retrieving indexed items count
km: មានកំហុសខណៈពេលទាញយកធាតុដែលមានលិបិក្រម

source: Indexed %1 item in this folder
km: ធាតុដែលមានលិបិក្រម %1 នៅក្នុងថតនេះ

source: Calculating indexed items...
km: កំពុងគណនាធាតុលិបិក្រម ...

source: Files
km: ឯកសារ

source: Folder type:
km: ប្រភេទថតឯកសារ៖

source: unknown
km: មិនស្គាល់

source: Items
km: ធាតុ

source: Total items:
km: ធាតុសរុប៖

source: Unread items:
km: ធាតុមិនទាន់អាន៖

source: Indexing
km: ការបង្កើតលិបិក្រម

source: Enable fulltext indexing
km: បើកការធ្វើលិបិក្រមអត្ថបទទាំងមូល

source: Retrieving indexed items count ...
km: កំពុងទៅយកធាតុលិបិក្រមរាប់ ...

source: Reindex folder
km: ថតឯកសារ Reindex

source: No Folder
km: គ្មានថតឯកសារ

source: Open collection dialog
km: បើកប្រអប់សម្រាំង

# @title:window
source: Select a collection
km: ជ្រើសរើសសម្រាំង

source: &Move here
km: ផ្លាស់ទីនៅទីនេះ

source: &Copy here
km: ចម្លងនៅទីនេះ

source: Cancel
km: បដិសេធ

source: Modification Time
km: ពេលវេលាកែប្រែ

source: Flags
km: ទង់

source: Attribute: %1
km: គុណលក្ខណៈ: %1

# @title:window
source: Conflict Resolution
km: ដំណោះស្រាយជម្លោះ

# @action:button
source: Take my version
km: យកកំណែរបស់ខ្ញុំ

# @action:button
source: Take their version
km: យកកំណែរបស់ពួកគេ

# @action:button
source: Keep both versions
km: រក្សាកំណែទាំងពីរ

source: <qt>Your changes conflict with those made by someone else meanwhile.<br>Unless one version can just be thrown away, you will have to integrate those changes manually.<br>Click on <a href="opentexteditor">"Open text editor"</a> to keep a copy of the texts, then select which version is most correct, then re-open it and modify it again to add what's missing.
km: <qt> ការផ្លាស់ប្តូររបស់អ្នកមានទំនាស់ជាមួយការផ្លាស់ប្តូររបស់អ្នកផ្សេង។ <br> លើកលែងតែកំណែមួយអាចត្រូវបានគេបោះចោលអ្នកនឹងត្រូវបញ្ចូលការផ្លាស់ប្តូរទាំងនោះដោយដៃ។ <br> ចុចលើ <a href="opentexteditor"> "Open អត្ថបទ editor" </a> ដើម្បីរក្សាច្បាប់ចម្លងនៃអត្ថបទបន្ទាប់មកជ្រើសរើសយកអត្ថបទណាដែលត្រឹមត្រូវបំផុតបន្ទាប់មកបើកវាម្តងទៀតនិងកែប្រែវាម្តងទៀតដើម្បីបន្ថែមអ្វីដែលបាត់។

source: Data
km: ទិន្នន័យ

source: Starting Akonadi server...
km: កំពុងចាប់ផ្តើមម៉ាស៊ីនមេ Akonadi ...

source: Stopping Akonadi server...
km: បញ្ឈប់ម៉ាស៊ីនមេ Akonadi ...

source: &Move Here
km: ផ្លាស់ទីទីនេះ

source: &Copy Here
km: ចម្លងនៅទីនេះ

source: &Link Here
km: ភ្ជាប់ទីនេះ

source: C&ancel
km: បោះបង់

# %1 is a reason why
source: Cannot connect to the Personal information management service. %1
km: មិនអាចភ្ជាប់ទៅសេវាកម្មគ្រប់គ្រងព័ត៌មានផ្ទាល់ខ្លួនបានទេ។ %1

source: Personal information management service is starting...
km: សេវាកម្មគ្រប់គ្រងព័ត៌មានផ្ទាល់ខ្លួនកំពុងចាប់ផ្តើម ...

source: Personal information management service is shutting down...
km: សេវាកម្មគ្រប់គ្រងព័ត៌មានផ្ទាល់ខ្លួនកំពុងបិទ…

source: Personal information management service is performing a database upgrade.
km: សេវាកម្មគ្រប់គ្រងព័ត៌មានផ្ទាល់ខ្លួនកំពុងធ្វើឱ្យប្រសើរឡើងនូវមូលដ្ឋានទិន្នន័យ។

source: Personal information management service is performing a database upgrade. This happens after a software update and is necessary to optimize performance. Depending on the amount of personal information, this might take a few minutes.
km: សេវាកម្មគ្រប់គ្រងព័ត៌មានផ្ទាល់ខ្លួនកំពុងធ្វើឱ្យប្រសើរឡើងនូវមូលដ្ឋានទិន្នន័យ។ វាកើតឡើងបន្ទាប់ពីការធ្វើបច្ចុប្បន្នភាពកម្មវិធីហើយចាំបាច់ដើម្បីបង្កើនប្រសិទ្ធភាពប្រតិបត្តិការ។ ផ្អែកលើចំនួនព័ត៌មានផ្ទាល់ខ្លួនវាអាចចំណាយពេលពីរបីនាទី។

source: The Akonadi personal information management service is not running. This application cannot be used without it.
km: សេវាកម្មគ្រប់គ្រងព័ត៌មានផ្ទាល់ខ្លួន Akonadi មិនដំណើរការទេ។ កម្មវិធីនេះមិនអាចប្រើបានទេបើគ្មានវា។

# @action:button Start the Akonadi server
source: Start
km: ចាប់ផ្តើម

source: The Akonadi personal information management framework is not operational. Click on "Details..." to obtain detailed information on this problem.
km: ក្របខ័ណ្ឌនៃការគ្រប់គ្រងព័ត៌មានផ្ទាល់ខ្លួនអាគីណាឌីមិនដំណើរការទេ។ ចុចលើ "Details ... " ដើម្បីទទួលបានព័ត៌មានលម្អិតអំពីបញ្ហានេះ។

source: The Akonadi personal information management service is not operational.
km: សេវាកម្មគ្រប់គ្រងព័ត៌មានផ្ទាល់ខ្លួនអាគីណាឌីមិនដំណើរការទេ។

source: Details...
km: ព័ត៌មានលម្អិត ...

source: Do you want to remove account '%1'?
km: តើអ្នកចង់លុបគណនី '%1' ទេ?

source: Remove account?
km: លុបគណនី?

source: Incoming accounts (add at least one):
km: គណនីចូល (បន្ថែមយ៉ាងហោចណាស់មួយ)៖

source: A&dd...
km: បន្ថែម ...

source: &Modify...
km: កែប្រែ ...

source: R&emove
km: លុប

source: Restart
km: ចាប់ផ្តើមឡើងវិញ

source: Recent Folder
km: ថតឯកសារថ្មីៗ

source: Rename Favorite
km: ប្តូរឈ្មោះចំណូលចិត្ត

source: Name:
km: ឈ្មោះ៖

# @title:window
source: Akonadi Server Self-Test
km: ការធ្វើតេស្តិ៍ដោយខ្លួនឯងរបស់ម៉ាស៊ីនបម្រើ Akonadi

source: Save Report...
km: រក្សាទុករបាយការណ៍ ...

source: Copy Report to Clipboard
km: ចម្លងរបាយការណ៍ទៅក្តារតម្បៀតខ្ទាស់

source: The QtSQL driver '%1' is required by your current Akonadi server configuration and was found on your system.
km: កម្មវិធីបញ្ជា QtSQL '%1' ត្រូវបានទាមទារដោយការកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនមេ Akonadi បច្ចុប្បន្នរបស់អ្នកហើយត្រូវបានរកឃើញនៅលើប្រព័ន្ធរបស់អ្នក។

source: The QtSQL driver '%1' is required by your current Akonadi server configuration. The following drivers are installed: %2. Make sure the required driver is installed.
km: កម្មវិធីបញ្ជា QtSQL '%1' ត្រូវបានទាមទារដោយការកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនមេ Akonadi បច្ចុប្បន្នរបស់អ្នក។ កម្មវិធីបញ្ជាខាងក្រោមត្រូវបានតំឡើង: %2 ។ ត្រូវប្រាកដថាបានដំឡើងកម្មវិធីបញ្ជាដែលត្រូវការ។

source: Database driver found.
km: រកឃើញកម្មវិធីបញ្ជាមូលដ្ឋានទិន្នន័យ។

source: Database driver not found.
km: រកមិនឃើញកម្មវិធីបញ្ជាមូលដ្ឋានទិន្នន័យ។

source: MySQL server executable not tested.
km: មិនអាចសាកល្បងប្រតិបត្តិ MySQL បាន។

source: The current configuration does not require an internal MySQL server.
km: ការកំណត់រចនាសម្ព័ន្ធបច្ចុប្បន្នមិនត្រូវការម៉ាស៊ីនមេ MySQL ខាងក្នុងទេ។

source: You have currently configured Akonadi to use the MySQL server '%1'. Make sure you have the MySQL server installed, set the correct path and ensure you have the necessary read and execution rights on the server executable. The server executable is typically called 'mysqld'; its location varies depending on the distribution.
km: បច្ចុប្បន្នអ្នកបានតំឡើង Akonadi ដើម្បីប្រើ MySQL '%1' របស់ MySQL ។ សូមប្រាកដថាអ្នកបានតំឡើងម៉ាស៊ីនមេ MySQL តំឡើងផ្លូវត្រឹមត្រូវហើយធានាថាអ្នកមានសិទ្ធិអាននិងប្រតិបត្តិចាំបាច់នៅលើ server ដែលអាចប្រតិបត្តិបាន។ ម៉ាស៊ីនបម្រើដែលអាចប្រតិបត្តិបានជាទូទៅត្រូវបានគេហៅថា 'mysqld'; ទីតាំងរបស់វាប្រែប្រួលអាស្រ័យលើការចែកចាយ។

source: MySQL server not found.
km: រកមិនឃើញម៉ាស៊ីនមេ MySQL ។

source: MySQL server not readable.
km: ម៉ាស៊ីនមេ MySQL មិនអាចអានបានទេ។

source: MySQL server not executable.
km: ម៉ាស៊ីនមេ MySQL មិនអាចដំណើរការបាន។

source: MySQL found with unexpected name.
km: រកឃើញ MySQL ជាមួយឈ្មោះដែលមិនបានរំពឹងទុក។

source: MySQL server found.
km: រកឃើញម៉ាស៊ីនមេ MySQL ។

source: MySQL server found: %1
km: រកឃើញម៉ាស៊ីនមេ MySQL៖ %1

source: MySQL server is executable.
km: ម៉ាស៊ីនមេ MySQL អាចប្រតិបត្តិបាន។

source: Executing the MySQL server '%1' failed with the following error message: '%2'
km: ប្រតិបត្តិម៉ាស៊ីនមេ MySQL '%1' បានបរាជ័យជាមួយសារកំហុសដូចខាងក្រោមៈ '%2'

source: Executing the MySQL server failed.
km: ប្រតិបត្តិម៉ាស៊ីនមេ MySQL បានបរាជ័យ។

source: MySQL server error log not tested.
km: កំណត់ហេតុកំហុសម៉ាស៊ីនមេ MySQL មិនត្រូវបានសាកល្បង។

source: No current MySQL error log found.
km: រកមិនឃើញកំណត់ហេតុកំហុស MySQL បច្ចុប្បន្នទេ។

source: The MySQL server did not report any errors during this startup. The log can be found in '%1'.
km: ម៉ាស៊ីនមេ MySQL មិនបានរាយការណ៍អំពីកំហុសណាមួយទេនៅពេលចាប់ផ្តើមនេះ។ កំណត់ហេតុអាចរកបាននៅក្នុង '%1' ។

source: MySQL error log not readable.
km: កំណត់ហេតុកំហុស MySQL មិនអាចអានបាន។

source: A MySQL server error log file was found but is not readable: %1
km: ឯកសារកំណត់ហេតុកំហុសរបស់ម៉ាស៊ីនមេ MySQL ត្រូវបានរកឃើញប៉ុន្តែមិនអាចអានបានទេ៖ %1

source: MySQL server log contains errors.
km: កំណត់ហេតុម៉ាស៊ីនមេ MySQL មានកំហុស។

source: The MySQL server error log file '%1' contains errors.
km: ឯកសារកំណត់ហេតុកំហុសរបស់ម៉ាស៊ីនមេ MySQL '%1' មានកំហុស។

source: MySQL server log contains warnings.
km: កំណត់ហេតុម៉ាស៊ីនមេ MySQL មានការព្រមាន។

source: The MySQL server log file '%1' contains warnings.
km: ឯកសារកំណត់ហេតុរបស់ម៉ាស៊ីនមេ MySQL '%1' មានការព្រមាន។

source: MySQL server log contains no errors.
km: កំណត់ហេតុម៉ាស៊ីនមេ MySQL មិនមានកំហុសទេ។

source: The MySQL server log file '%1' does not contain any errors or warnings.
km: ឯកសារកំណត់ហេតុរបស់ម៉ាស៊ីនមេ MySQL '%1' មិនមានកំហុសឬការព្រមានទេ។

source: MySQL server configuration not tested.
km: ការតំឡើងម៉ាស៊ីនមេ MySQL មិនបានសាកល្បងទេ។

source: MySQL server default configuration found.
km: បានរកឃើញការកំណត់រចនាសម្ព័ន្ធលំនាំដើមរបស់ម៉ាស៊ីនមេ MySQL ។

source: The default configuration for the MySQL server was found and is readable at %1.
km: ការកំណត់រចនាសម្ព័ន្ធលំនាំដើមសម្រាប់ម៉ាស៊ីនមេ MySQL ត្រូវបានរកឃើញហើយអាចអានបាននៅ %1 ។

source: MySQL server default configuration not found.
km: រកមិនឃើញការកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនមេ MySQL ។

source: The default configuration for the MySQL server was not found or was not readable. Check your Akonadi installation is complete and you have all required access rights.
km: ការកំណត់រចនាសម្ព័ន្ធលំនាំដើមសម្រាប់ម៉ាស៊ីនមេ MySQL មិនត្រូវបានរកឃើញឬមិនអាចអានបាន។ ពិនិត្យមើលការតំឡើងអាគីណាឌីរបស់អ្នកបានបញ្ចប់ហើយអ្នកមានសិទ្ធិចូលប្រើទាំងអស់។

source: MySQL server custom configuration not available.
km: ការកំណត់រចនាសម្ព័ន្ធផ្ទាល់ខ្លួនរបស់ម៉ាស៊ីនមេ MySQL មិនមានទេ។

source: The custom configuration for the MySQL server was not found but is optional.
km: ការកំណត់រចនាសម្ព័ន្ធផ្ទាល់ខ្លួនសម្រាប់ម៉ាស៊ីនមេ MySQL មិនត្រូវបានរកឃើញទេប៉ុន្តែអាចជ្រើសរើសបាន។

source: MySQL server custom configuration found.
km: បានរកឃើញការកំណត់រចនាសម្ព័ន្ធផ្ទាល់ខ្លួនរបស់ម៉ាស៊ីនមេ MySQL ។

source: The custom configuration for the MySQL server was found and is readable at %1
km: ការកំណត់រចនាសម្ព័ន្ធផ្ទាល់ខ្លួនសម្រាប់ម៉ាស៊ីនមេ MySQL ត្រូវបានរកឃើញហើយអាចអានបាននៅ %1

source: MySQL server custom configuration not readable.
km: ការកំណត់រចនាសម្ព័ន្ធផ្ទាល់ខ្លួនរបស់ម៉ាស៊ីនមេ MySQL មិនអាចអានបានទេ។

source: The custom configuration for the MySQL server was found at %1 but is not readable. Check your access rights.
km: ការកំណត់រចនាសម្ព័ន្ធផ្ទាល់ខ្លួនសម្រាប់ម៉ាស៊ីនមេ MySQL ត្រូវបានរកឃើញនៅ %1 ប៉ុន្តែមិនអាចអានបានទេ។ ពិនិត្យសិទ្ធិចូលប្រើរបស់អ្នក។

source: MySQL server configuration not found or not readable.
km: រកមិនឃើញឬកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនមេ MySQL ។

source: The MySQL server configuration was not found or is not readable.
km: ការកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនមេ MySQL មិនត្រូវបានរកឃើញឬមិនអាចអានបាន។

source: MySQL server configuration is usable.
km: ការកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនមេ MySQL គឺអាចប្រើបាន។

source: The MySQL server configuration was found at %1 and is readable.
km: ការកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនមេ MySQL ត្រូវបានរកឃើញនៅ %1 ហើយអាចអានបាន។

source: Cannot connect to PostgreSQL server.
km: មិនអាចភ្ជាប់ទៅម៉ាស៊ីនមេ PostgreSQL ។

source: PostgreSQL server found.
km: រកឃើញម៉ាស៊ីនមេ PostgreSQL ។

source: The PostgreSQL server was found and connection is working.
km: ម៉ាស៊ីនមេ PostgreSQL ត្រូវបានរកឃើញហើយការតភ្ជាប់កំពុងដំណើរការ។

source: akonadictl not found
km: រកមិនឃើញ akonadictl

source: The program 'akonadictl' needs to be accessible in $PATH. Make sure you have the Akonadi server installed.
km: កម្មវិធី 'akonadictl' ចាំបាច់អាចចូលដំណើរការបាននៅក្នុង $PATH ។ ត្រូវប្រាកដថាអ្នកបានតំឡើងម៉ាស៊ីនមេ Akonadi ។

source: akonadictl found and usable
km: akonadictl ត្រូវបានរកឃើញនិងអាចប្រើបាន

source: The program '%1' to control the Akonadi server was found and could be executed successfully. Result: %2
km: កម្មវិធី '%1' ត្រូវបានរកឃើញហើយអាចប្រតិបត្តិបានដោយជោគជ័យ។ លទ្ធផល៖ %2

source: akonadictl found but not usable
km: akonadictl រកឃើញប៉ុន្តែមិនអាចប្រើបាន

source: The program '%1' to control the Akonadi server was found but could not be executed successfully. Result: %2 Make sure the Akonadi server is installed correctly.
km: កម្មវិធី '%1' ត្រូវបានរកឃើញនៅក្នុងម៉ាស៊ីន Akonadi ប៉ុន្តែមិនអាចប្រតិបត្តិបានដោយជោគជ័យទេ។ លទ្ធផល៖ %2 ត្រូវប្រាកដថាម៉ាស៊ីនមេអាហ្គូណាឌីត្រូវបានតំឡើងត្រឹមត្រូវ។

source: Akonadi control process registered at D-Bus.
km: ដំណើរការត្រួតពិនិត្យ Akonadi បានចុះឈ្មោះនៅ D-Bus ។
