Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/akonadi/libakonadi5.po
Languages: km

source: The Akonadi control process is registered at D-Bus which typically indicates it is operational.
km: ដំណើរការត្រួតពិនិត្យ Akonadi ត្រូវបានចុះបញ្ជីនៅ D-Bus ដែលជាធម្មតាបង្ហាញថាវាដំណើរការ។

source: Akonadi control process not registered at D-Bus.
km: ដំណើរការត្រួតពិនិត្យ Akonadi មិនបានចុះឈ្មោះនៅ D-Bus ទេ។

source: The Akonadi control process is not registered at D-Bus which typically means it was not started or encountered a fatal error during startup.
km: ដំណើរការត្រួតពិនិត្យ Akonadi មិនត្រូវបានចុះបញ្ជីនៅ D-Bus ដែលមានន័យថាវាមិនត្រូវបានចាប់ផ្តើមឬជួបប្រទះនឹងកំហុសធ្ងន់ធ្ងរនៅពេលចាប់ផ្តើម។

source: Akonadi server process registered at D-Bus.
km: ដំណើរការម៉ាស៊ីនមេ Akonadi បានចុះឈ្មោះនៅ D-Bus ។

source: The Akonadi server process is registered at D-Bus which typically indicates it is operational.
km: ដំណើរការម៉ាស៊ីនមេ Akonadi ត្រូវបានចុះឈ្មោះនៅ D-Bus ដែលជាធម្មតាបង្ហាញថាវាដំណើរការ។

source: Akonadi server process not registered at D-Bus.
km: ដំណើរការម៉ាស៊ីនមេ Akonadi មិនបានចុះឈ្មោះនៅ D-Bus ទេ។

source: The Akonadi server process is not registered at D-Bus which typically means it was not started or encountered a fatal error during startup.
km: ដំណើរការម៉ាស៊ីនមេ Akonadi មិនត្រូវបានចុះបញ្ជីនៅ D-Bus ដែលមានន័យថាវាមិនត្រូវបានចាប់ផ្តើមឬជួបប្រទះនឹងកំហុសធ្ងន់ធ្ងរនៅពេលចាប់ផ្តើម។

source: Protocol version check not possible.
km: ការត្រួតពិនិត្យកំណែពិធីសារមិនអាចធ្វើទៅបានទេ។

source: Without a connection to the server it is not possible to check if the protocol version meets the requirements.
km: បើគ្មានការភ្ជាប់ទៅម៉ាស៊ីនមេទេវាមិនអាចទៅរួចទេដើម្បីពិនិត្យមើលថាតើប្រូតូកូលពិធីការត្រូវនឹងតម្រូវការដែរឬទេ។

source: Server protocol version is too old.
km: ពិធីការម៉ាស៊ីនមេចាស់ពេក។

source: The server protocol version is %1, but version %2 is required by the client. If you recently updated KDE PIM, please make sure to restart both Akonadi and KDE PIM applications.
km: ប្រូតូកូលពិធីការម៉ាស៊ីនមេគឺ %1 ប៉ុន្តែកំណែ %2 ត្រូវបានទាមទារដោយអតិថិជន។ ប្រសិនបើអ្នកបានធ្វើបច្ចុប្បន្នភាព PIM របស់ KDE សូមប្រាកដថាត្រូវចាប់ផ្តើមឡើងវិញទាំងកម្មវិធី Akonadi និង KDE PIM ។

source: Server protocol version is too new.
km: កំណែពិធីការម៉ាស៊ីនមេគឺថ្មីពេក។

source: Server protocol version matches.
km: ការប្រកួតពិធីការកំណែម៉ាស៊ីនមេ។

source: The current Protocol version is %1.
km: កំណែពិធីសារបច្ចុប្បន្នគឺ %1 ។

source: Resource agents found.
km: បានរកឃើញភ្នាក់ងារធនធាន។

source: At least one resource agent has been found.
km: យ៉ាងហោចណាស់មានភ្នាក់ងារធនធានម្នាក់ត្រូវបានគេរកឃើញ។

source: No resource agents found.
km: រកមិនឃើញភ្នាក់ងារធនធានទេ។

source: No resource agents have been found, Akonadi is not usable without at least one. This usually means that no resource agents are installed or that there is a setup problem. The following paths have been searched: '%1'. The XDG_DATA_DIRS environment variable is set to '%2'; make sure this includes all paths where Akonadi agents are installed.
km: មិនមានភ្នាក់ងារធនធានណាមួយត្រូវបានគេរកឃើញទេ។ Akonadi មិនអាចប្រើប្រាស់បានដោយគ្មានយ៉ាងហោចណាស់មួយ។ នេះជាធម្មតាមានន័យថាគ្មានភ្នាក់ងារតំឡើងធនធានណាមួយត្រូវបានតំឡើងឬមានបញ្ហាក្នុងការតំឡើងទេ។ ផ្លូវខាងក្រោមត្រូវបានស្វែងរក៖ '%1' ។ អថេរបរិស្ថាន XDGDATADIRS ត្រូវបានកំណត់ជា '%2'; ធ្វើឱ្យប្រាកដថានេះរួមបញ្ចូលទាំងផ្លូវទាំងអស់ដែលភ្នាក់ងារ Akonadi ត្រូវបានតំឡើង។

source: No current Akonadi server error log found.
km: រកមិនឃើញកំណត់ហេតុកំហុសម៉ាស៊ីនមេ Akonadi បច្ចុប្បន្នទេ។

source: The Akonadi server did not report any errors during its current startup.
km: ម៉ាស៊ីនមេ Akonadi មិនបានរាយការណ៍អំពីកំហុសណាមួយទេនៅពេលចាប់ផ្តើមដំណើរការបច្ចុប្បន្ន។

source: Current Akonadi server error log found.
km: រកឃើញកំណត់ហេតុកំហុសរបស់ម៉ាស៊ីនមេ Akonadi បច្ចុប្បន្ន។

source: The Akonadi server reported errors during its current startup. The log can be found in %1.
km: ម៉ាស៊ីនមេ Akonadi បានរាយការណ៍អំពីកំហុសកំឡុងពេលចាប់ផ្តើម។ កំណត់ហេតុអាចរកបាននៅក្នុង %1 ។

source: No previous Akonadi server error log found.
km: រកមិនឃើញកំណត់ហេតុកំហុសរបស់ម៉ាស៊ីនមេ Akonadi ពីមុនទេ។

source: The Akonadi server did not report any errors during its previous startup.
km: ម៉ាស៊ីនមេ Akonadi មិនបានរាយការណ៍អំពីកំហុសណាមួយទេនៅពេលចាប់ផ្តើមដំណើរការមុន។

source: Previous Akonadi server error log found.
km: បានរកឃើញកំណត់ហេតុកំហុសរបស់ម៉ាស៊ីនមេ Akonadi ។

source: The Akonadi server reported errors during its previous startup. The log can be found in %1.
km: ម៉ាស៊ីនមេ Akonadi បានរាយការណ៍កំហុសកំឡុងពេលចាប់ផ្តើមដំណើរការមុន។ កំណត់ហេតុអាចរកបាននៅក្នុង %1 ។

source: No current Akonadi control error log found.
km: រកមិនឃើញកំណត់ហេតុកំហុសត្រួតពិនិត្យ Akonadi បច្ចុប្បន្នទេ។

source: The Akonadi control process did not report any errors during its current startup.
km: ដំណើរការនៃការត្រួតពិនិត្យ Akonadi មិនបានរាយការណ៍អំពីកំហុសណាមួយទេនៅពេលចាប់ផ្តើមដំណើរការបច្ចុប្បន្ន។

source: Current Akonadi control error log found.
km: រកឃើញកំណត់ហេតុកំហុសត្រួតពិនិត្យ Akonadi បច្ចុប្បន្ន។

source: The Akonadi control process reported errors during its current startup. The log can be found in %1.
km: ដំណើរការត្រួតពិនិត្យ Akonadi បានរាយការណ៍កំហុសកំឡុងពេលចាប់ផ្តើមដំណើរការបច្ចុប្បន្ន។ កំណត់ហេតុអាចរកបាននៅក្នុង %1 ។

source: No previous Akonadi control error log found.
km: រកមិនឃើញកំណត់ហេតុកំហុសត្រួតពិនិត្យ Akonadi ពីមុនទេ។

source: The Akonadi control process did not report any errors during its previous startup.
km: ដំណើរការនៃការត្រួតពិនិត្យ Akonadi មិនបានរាយការណ៍អំពីកំហុសណាមួយទេនៅពេលចាប់ផ្តើមដំបូងរបស់វា។

source: Previous Akonadi control error log found.
km: រកឃើញកំណត់ហេតុកំហុសត្រួតពិនិត្យ Akonadi មុន។

source: The Akonadi control process reported errors during its previous startup. The log can be found in %1.
km: ដំណើរការនៃការត្រួតពិនិត្យ Akonadi បានរាយការណ៍កំហុសកំឡុងពេលចាប់ផ្តើមមុន។ កំណត់ហេតុអាចរកបាននៅក្នុង %1 ។

source: Akonadi was started as root
km: Akonadi ត្រូវបានចាប់ផ្តើមជាឫស

source: Running Internet-facing applications as root/administrator exposes you to many security risks. MySQL, used by this Akonadi installation, will not allow itself to run as root, to protect you from these risks.
km: ដំណើរការកម្មវិធីប្រឈមមុខតាមអ៊ិនធឺរណែតដែលជាអ្នកគ្រប់គ្រង / អ្នកធ្វើឱ្យអ្នកប្រឈមនឹងហានិភ័យសន្តិសុខជាច្រើន។ MySQL ដែលត្រូវបានប្រើដោយការតំឡើង Akonadi នេះនឹងមិនអនុញ្ញាតិអោយខ្លួនវាដំណើរការជា root ដើម្បីការពារអ្នកពីហានិភ័យទាំងនេះទេ។

source: Akonadi is not running as root
km: Akonadi មិនកំពុងរត់ជា root ទេ

source: Akonadi is not running as a root/administrator user, which is the recommended setup for a secure system.
km: Akonadi មិនដំណើរការជាអ្នកប្រើ root / អ្នកគ្រប់គ្រងទេដែលជាការរៀបចំដែលបានណែនាំសម្រាប់ប្រព័ន្ធដែលមានសុវត្ថិភាព។

source: Save Test Report
km: រក្សាទុករបាយការណ៍សាកល្បង

source: Error
km: កំហុស

source: Could not open file '%1'
km: មិនអាចបើកឯកសារ '%1'

source: An error occurred during the startup of the Akonadi server. The following self-tests are supposed to help with tracking down and solving this problem. When requesting support or reporting bugs, please always include this report.
km: កំហុសមួយបានកើតឡើងកំឡុងពេលចាប់ផ្តើមម៉ាស៊ីនមេអាហ្គូណាឌី។ ការធ្វើតេស្តដោយខ្លួនឯងដូចខាងក្រោមត្រូវបានគេសន្មត់ថាជួយក្នុងការតាមដាននិងដោះស្រាយបញ្ហានេះ។ នៅពេលស្នើសុំការគាំទ្រឬរាយការណ៍អំពីកំហុសសូមបញ្ចូលរបាយការណ៍នេះជានិច្ច។

source: Details
km: ព័ត៌មានលម្អិត

source: <p>For more troubleshooting tips please refer to <a href="https://userbase.kde.org/Akonadi">userbase.kde.org/Akonadi</a>.</p>
km: <p> សម្រាប់គន្លឹះដោះស្រាយបញ្ហាបន្ថែមសូមយោង <a href="https://userbase.kde.org/Akonadi"> userbase.kde.org/Akonadi </a> ។ </p>

source: &New Folder...
km: ប្រអប់​ឯកសារ​ថ្មី...

source: New
km: ថ្មី

source: &Delete Folder
km: លុបថតឯកសារ

source: Delete
km: លុប

source: &Synchronize Folder
km: ធ្វើសមកាលកម្មថតឯកសារ

source: Synchronize
km: ធ្វើសមកាលកម្ម

source: Folder &Properties
km: លក្ខណៈសម្បត្តិថត

source: Properties
km: លក្ខណៈសម្បត្តិ

source: &Paste
km: បិទភ្ជាប់

source: Paste
km: បិទភ្ជាប់

source: Manage Local &Subscriptions...
km: គ្រប់គ្រងការជាវមូលដ្ឋាន ...

source: Manage Local Subscriptions
km: គ្រប់គ្រងការជាវក្នុងស្រុក

source: Add to Favorite Folders
km: បន្ថែមទៅថតដែលខ្ញុំចូលចិត្ត

source: Add to Favorite
km: បន្ថែមទៅចំណូលចិត្ត

source: Remove from Favorite Folders
km: លុបពីថតដែលខ្ញុំចូលចិត្ត

source: Remove from Favorite
km: ដកចេញពីចំណូលចិត្ត

source: Rename Favorite...
km: ប្តូរឈ្មោះចំណូលចិត្ត ...

source: Rename
km: ប្តូរឈ្មោះ

source: Copy Folder To...
km: ចម្លងថតឯកសារទៅ ...

source: Copy To
km: ចម្លង​ទៅ

source: Copy Item To...
km: ចម្លងធាតុទៅ ...

source: Move Item To...
km: ផ្លាស់ទីធាតុទៅ ...

source: Move To
km: ផ្លាស់ទី​ទៅ

source: Move Folder To...
km: ផ្លាស់ទីថតទៅ ...

source: &Cut Item
km: កាត់ធាតុ

source: Cut
km: កាត់

source: &Cut Folder
km: កាត់ថតឯកសារ

source: Create Resource
km: បង្កើតធនធាន

source: Delete Resource
km: លុបធនធាន

source: &Resource Properties
km: ទ្រព្យសម្បត្តិធនធាន

source: Synchronize Resource
km: ធ្វើសមកាលកម្មធនធាន

source: Work Offline
km: ក្រៅបណ្តាញការងារ

source: &Synchronize Folder Recursively
km: ធ្វើសមកាលកម្មថតម្តងទៀត

source: Synchronize Recursively
km: ធ្វើសមកាលកម្មឡើងវិញ

source: &Move Folder To Trash
km: ផ្លាស់ទីថតទៅធុងសំរាម

source: Move Folder To Trash
km: ផ្លាស់ទីថតទៅធុងសំរាម

source: &Move Item To Trash
km: ផ្លាស់ទីធាតុទៅធុងសំរាម

source: Move Item To Trash
km: ផ្លាស់ទីធាតុទៅធុងសំរាម

source: &Restore Folder From Trash
km: ស្តារថតចេញពីធុងសំរាម

source: Restore Folder From Trash
km: ស្តារថតចេញពីធុងសំរាម

source: &Restore Item From Trash
km: ស្តារធាតុពីធុងសំរាម

source: Restore Item From Trash
km: ស្តារធាតុពីធុងសំរាម

source: &Restore Collection From Trash
km: ស្តារការប្រមូលពីសំរាម

source: Restore Collection From Trash
km: ស្តារការប្រមូលពីសំរាម

source: &Synchronize Favorite Folders
km: ធ្វើសមកាលកម្មថតដែលខ្ញុំចូលចិត្ត

source: Synchronize Favorite Folders
km: ធ្វើសមកាលកម្មថតដែលខ្ញុំចូលចិត្ត

source: Synchronize Folder Tree
km: ធ្វើសមកាលកម្មមែកធាងថតឯកសារ

source: &Copy Folder
km: ថតចំលងថតឯកសារ

source: &Copy Item
km: ចម្លងធាតុ

source: &Delete Item
km: លុបធាតុ

source: &Delete Resource
km: លុបធនធាន

source: &Synchronize Resource
km: ធ្វើសមកាលកម្មធនធាន

source: Copy Folder
km: ថតចំលងថតឯកសារ

source: Copy Item
km: ចម្លងធាតុ

source: Cut Item
km: កាត់ធាតុ

source: Cut Folder
km: កាត់ថតឯកសារ

source: Delete Item
km: លុបធាតុ

source: Delete Folder
km: លុបថតឯកសារ

source: Synchronize Folder
km: ធ្វើសមកាលកម្មថតឯកសារ

# @label:textbox name of Akonadi folder
source: Name
km: ឈ្មោះ

source: Do you really want to delete this folder and all its sub-folders?
km: តើអ្នកពិតជាចង់លុបថតនេះនិងថតរងទាំងអស់របស់វាឬ?

# @title:window
source: Delete folder?
km: លុបថតឯកសារ?

source: Could not delete folder: %1
km: មិនអាចលុបថតឯកសារបានទេ៖ %1

source: Folder deletion failed
km: ការលុបថតឯកសារបានបរាជ័យ

# @title:window
source: Properties of Folder %1
km: លក្ខណៈសម្បត្តិរបស់ថតឯកសារ %1

source: Do you really want to delete the selected item?
km: តើអ្នកពិតជាចង់លុបធាតុដែលបានជ្រើសរើសមែនទេ?

# @title:window
source: Delete item?
km: លុបធាតុ?

source: Could not delete item: %1
km: មិនអាចលុបធាតុបានទេ៖ %1

source: Item deletion failed
km: ការលុបធាតុបានបរាជ័យ

# @title:window
source: Rename Favorite
km: ប្តូរឈ្មោះចំណូលចិត្ត

# @label:textbox name of the folder
source: Name:
km: ឈ្មោះ៖

# @title:window
source: New Resource
km: ធនធានថ្មី

source: Could not create resource: %1
km: មិនអាចបង្កើតធនធានបានទេ៖ %1

source: Resource creation failed
km: ការបង្កើតធនធានបានបរាជ័យ

source: Do you really want to delete this resource?
km: តើអ្នកពិតជាចង់លុបធនធាននេះឬ?

# @title:window
source: Delete Resource?
km: លុបធនធាន?

source: Could not paste data: %1
km: មិនអាចបិទភ្ជាប់ទិន្នន័យ៖ %1

source: Paste failed
km: ការបិទភ្ជាប់បានបរាជ័យ

source: We can not add "/" in folder name.
km: យើងមិនអាចបន្ថែម " / " ក្នុងឈ្មោះថតឯកសារឡើយ។

source: Create new folder error
km: បង្កើតកំហុសថតឯកសារថ្មី

source: We can not add "." at begin or end of folder name.
km: យើងមិនអាចបន្ថែម "." នៅពេលចាប់ផ្តើមឬចុងបញ្ចប់នៃឈ្មោះថតទេ។

source: Before syncing folder "%1" it is necessary to have the resource online. Do you want to make it online?
km: មុនពេលធ្វើសមកាលកម្មថត " %1" វាចាំបាច់ត្រូវមានធនធានលើអ៊ីនធឺណិត។ តើអ្នកចង់បង្កើតវានៅលើអ៊ីនធឺណិតទេ?

source: Account "%1" is offline
km: គណនី " %1" នៅក្រៅបណ្តាញ

# @action:button
source: Go Online
km: ចូល​អី​ន​ធើ​នែ​ត

source: Move to This Folder
km: ផ្លាស់ទីទៅថតឯកសារនេះ

source: Copy to This Folder
km: ចម្លងទៅថតឯកសារនេះ

source: Failed to update subscription: %1
km: បានបរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពការជាវ៖ %1

# @title
source: Subscription Error
km: កំហុសក្នុងការជាវ

source: Local Subscriptions
km: ការជាវក្នុងស្រុក

source: Search:
km: ស្វែងរក

source: &Subscribed only
km: បានជាវប៉ុណ្ណោះ

source: Su&bscribe
km: ជាវ

source: &Unsubscribe
km: ឈប់ជាវ

source: Failed to create a new tag
km: បានបរាជ័យក្នុងការបង្កើតស្លាកថ្មី

source: An error occurred while creating a new tag
km: កំហុសមួយបានកើតឡើងខណៈពេលបង្កើតស្លាកថ្មី

# @info
source: Do you really want to remove the tag <resource>%1</resource>?
km: តើអ្នកពិតជាចង់លុបស្លាកនោះចោលឬ? <resource> %1 </resource>

# @title
source: Delete tag
km: លុបស្លាក

# @info
source: Delete tag
km: លុបស្លាក

source: Select tags that should be applied.
km: ជ្រើសរើសស្លាកដែលគួរត្រូវបានអនុវត្ត។

source: Create new tag
km: បង្កើតស្លាកថ្មី

source: Manage Tags
km: គ្រប់គ្រងស្លាក

# @label Placeholder text in tag selection combobox
source: Select tags...
km: ជ្រើសរើសស្លាក ...

source: Select Tags
km: ជ្រើសស្លាក

source: Clear
km: ច្បាស់

source: Click to add tags
km: ចុចដើម្បីបន្ថែមស្លាក

source: Akonadi To XML converter
km: ការបំលែង Akonadi ទៅ XML

source: Converts an Akonadi collection subtree into a XML file.
km: បំលែងអនុក្រឹត្យសម្រាំងអាកុនដាទៅជាឯកសារ XML ។

source: (c) 2009 Volker Krause <vkrause@kde.org>
km: (c) វ៉ុលកាក្រក្រូសូសឆ្នាំ ២០០៩ <vkrause@kde.org>

source: No data loaded.
km: មិនមានផ្ទុកទិន្នន័យទេ។

source: No filename specified
km: មិនបានបញ្ជាក់ឈ្មោះឯកសារ

source: Unable to open data file '%1'.
km: មិនអាចបើកឯកសារទិន្នន័យ '%1' ។

source: File %1 does not exist.
km: មិនមានឯកសារ %1 ទេ។

source: Unable to parse data file '%1'.
km: មិនអាចញែកឯកសារទិន្នន័យ '%1' ។

source: Schema definition could not be loaded and parsed.
km: និយមន័យគ្រោងការណ៍មិនអាចផ្ទុកនិងញែកបានទេ។

source: Unable to create schema parser context.
km: មិនអាចបង្កើតបរិបទអ្នកវិភាគគ្រោងការណ៍។

source: Unable to create schema.
km: មិនអាចបង្កើតគ្រោងការណ៍។

source: Unable to create schema validation context.
km: មិនអាចបង្កើតបរិបទសុពលភាពគ្រោងការណ៍។

source: Invalid file format.
km: ទ្រង់ទ្រាយឯកសារមិនត្រឹមត្រូវ។

source: Unable to parse data file: %1
km: មិនអាចញែកឯកសារទិន្នន័យបានទេ៖ %1

source: Unable to find collection %1
km: មិនអាចរកការប្រមូល %1
