Repository: koompi/kde-khmer-translation
Catalog: Documentation in stable KF5-based/docmessages/akonadi-import-wizard/importwizard.po
Languages: km

source: <!ENTITY i18n-importwizard "<application>Import Wizard</application>">
km: <!ENTITY i18n-importwizard" <application> អ្នកជំនួយការនាំចូល </application> "&gt;

source: The &i18n-importwizard; Handbook
km: អ្នកនាំផ្លូវ i18n; សៀវភៅណែនាំ

source: <personname> <firstname>Laurent</firstname> <surname>Montel</surname> </personname> <email>montel@kde.org</email>
km: <personname><firstname> ឡូរ៉ង់ </firstname><surname> ម៉ុងតេល </surname></personname><email> montel@kde.org </email>

source: 5.3.40 (Applications 16.08)
km: ៥.៣.៤០ (ពាក្យសុំ ១៦.០៨)

source: Introduction
km: សេចក្តីផ្តើម

source: &i18n-importwizard; allows to import emails, settings, addressbook and calendar data detected in your user account from the following mailers:
km: i18n-importwizard; អនុញ្ញាតឱ្យនាំចូលអ៊ីមែលការកំណត់សៀវភៅអាសយដ្ឋាននិងទិន្នន័យប្រតិទិនដែលរកឃើញនៅក្នុងគណនីអ្នកប្រើប្រាស់របស់អ្នកពីអ្នកផ្ញើអ៊ីមែលខាងក្រោម៖

source: <application>Trojitá</application>, <application>Evolution 1.x - 3.x</application>, <application>OS X Mail</application>, <application>Opera</application>, <application>Sylpheed</application>, <application>Thunderbird/Mozilla</application>, <application>The Bat!</application>, <application>Outlook Express</application>, <application>Balsa</application>, <application>Pegasus-Mail</application>, and <application>Claws Mail</application>
km: <application> ទ្រីជិតា </application> , <application> ការវិវត្តន៍ 1.x - 3,x </application> , <application> សំបុត្រ OS X </application> , <application> ល្ខោនអូប៉េរ៉ា </application> , <application> ស៊ីលផៃដ </application> , <application> មយូរា / Mozilla </application> , <application> បាត! </application> , <application> ចក្ខុវិស័យអ៊ិចប្រេស </application> , <application> Balsa </application> , <application> Pegasus-Mail </application> , និង <application> ក្រញ៉ាំសំបុត្រ </application>

source: Additionally you can use the manual import for <application>KMail Archive</application>, <application>mbox (Unix, Evolution)</application>, &kmail; Maildirs, <application>Icedove</application>, <application>Lotus Notes</application>, <application>Plain Text</application> and <application>Mailman</application> Archives.
km: លើសពីនេះទៀតអ្នកអាចប្រើការនាំចូលដោយដៃសម្រាប់ <application> ប័ណ្ណសារ KMail </application> , <application> mbox (យូនីកការវិវត្តន៍) </application> , kmail; Maildirs, <application> Icedove </application> , <application> ភក្តី </application> , <application> អត្ថបទ​ធម្មតា </application> និង <application> ម៉ាមេន </application> បណ្ណសារ។

source: If no mail data are detected automatically then click on <guibutton>Manual Selection</guibutton> in the start window and use the <link linkend="manual-import">Manual Import</link> features.
km: ប្រសិនបើគ្មានទិន្នន័យអ៊ីមែលត្រូវបានរកឃើញដោយស្វ័យប្រវត្តិបន្ទាប់មកចុចលើ <guibutton> ការជ្រើសរើសដោយដៃ </guibutton> នៅក្នុងផ្ទាំងកម្មវិធីចាប់ផ្តើមនិងប្រើ <link linkend= " manual-import " > ការនាំចូលដោយដៃ </link> លក្ខណៈពិសេស។

source: You can start &i18n-importwizard; directly from the application launcher or from &kmail; with <menuchoice><guimenu>Tools</guimenu><guimenuitem>Import Wizard</guimenuitem></menuchoice> for automatic detection or from &kmail; with <menuchoice><guimenu>File</guimenu> <guimenuitem>Import Messages</guimenuitem></menuchoice> for manual import.
km: អ្នកអាចចាប់ផ្តើម i18n-importwizard; ដោយផ្ទាល់ពីកម្មវិធីបើកដំណើរការកម្មវិធីឬពី Kmail ។ ជាមួយ <menuchoice><guimenu> ឧបករណ៍ </guimenu><guimenuitem> អ្នកជំនួយការនាំចូល </guimenuitem></menuchoice> សម្រាប់ការរកឃើញដោយស្វ័យប្រវត្តិឬពី Kmail ។ ជាមួយ <menuchoice><guimenu> ឯកសារ </guimenu><guimenuitem> នាំចូលសារ </guimenuitem></menuchoice> សម្រាប់ការនាំចូលដោយដៃ។

source: Close &kmail; before importing data. Some plugins will modify &kmail;'s configuration file.
km: បិទ kmail; មុនពេលនាំចូលទិន្នន័យ។ កម្មវិធីជំនួយមួយចំនួននឹងកែប្រែឯកសារកំណត់រចនាសម្ព័ន្ធរបស់ Kmail ។

source: For information about other utilities to import mails please read the <ulink url="help:/pimdataexporter">PIM Data Exporter</ulink> handbook.
km: សម្រាប់ព័ត៌មានអំពីឧបករណ៍ប្រើប្រាស់ផ្សេងទៀតដើម្បីនាំចូលសំបុត្រសូមអានឯកសារ <ulink url= " help:/pimdataexporter " > អ្នកនាំចេញទិន្នន័យភី។ អេ។ ភី </ulink> សៀវភៅណែនាំ។

source: Detected Mail Applications
km: កម្មវិធីអ៊ីមែលដែលបានរកឃើញ

source: At startup the import wizard will detect all supported email applications, and list them for you in the window. Select the email application you want to import from, and click the <guibutton>Next</guibutton> button. The wizard will then ask if you want to import everything, or give you options to select which types of materials you want to import.
km: នៅពេលចាប់ផ្តើមអ្នកជំនួយការនាំចូលនឹងរកឃើញកម្មវិធីអ៊ីមែលដែលបានគាំទ្រទាំងអស់ហើយរាយពួកវាសម្រាប់អ្នកនៅក្នុងផ្ទាំងកម្មវិធី។ ជ្រើសកម្មវិធីអ៊ីមែលដែលអ្នកចង់នាំចូលនិងចុចលើប៊ូតុង <guibutton> បន្ទាប់ </guibutton> ប៊ូតុង។ បន្ទាប់មកអ្នកជំនួយការនឹងសួរថាតើអ្នកចង់នាំចូលអ្វីគ្រប់យ៉ាងឬផ្តល់ឱ្យអ្នកនូវជម្រើសដើម្បីជ្រើសរើសប្រភេទវត្ថុធាតុដើមណាដែលអ្នកចង់នាំចូល។

source: <screeninfo>Import Selection</screeninfo>
km: <screeninfo> ការជ្រើសរើសនាំចូល </screeninfo>

source: <phrase>Import Selection</phrase>
km: <phrase> ការជ្រើសរើសនាំចូល </phrase>

source: <para>Import Selection</para>
km: <para> ការជ្រើសរើសនាំចូល </para>

source: Depending on your selections in the materials to import screen, you will see one or more of the following screens:
km: ដោយផ្អែកលើការជ្រើសរើសរបស់អ្នកនៅក្នុងសម្ភារៈដើម្បីនាំចូលអេក្រង់អ្នកនឹងឃើញអេក្រង់មួយឬច្រើនដូចខាងក្រោម៖

source: To import mail messages, you need to select the folder you want your email messages to import into. Once selected, click the <guibutton>Import Mails</guibutton> button. Once the progress bar reaches 100%, click the <guibutton>Next</guibutton> button, or the <guibutton>Finish</guibutton> button, if this was your last material selection.
km: ដើម្បីនាំចូលសារអ៊ីមែលអ្នកត្រូវជ្រើសរើសថតឯកសារដែលអ្នកចង់អោយសារអ៊ីមែលរបស់អ្នកនាំចូល។ នៅពេលជ្រើសរើសរួចចុចលើប៊ូតុង <guibutton> នាំចូលសំបុត្រ </guibutton> ប៊ូតុង។ នៅពេលដែលរបារវឌ្ឍនភាពឈានដល់ 100 % សូមចុចលើប៊ូតុង <guibutton> បន្ទាប់ </guibutton> ប៊ូតុងឬប៊ូតុង <guibutton> បញ្ចប់ </guibutton> ប៊ូតុងប្រសិនបើនេះជាជម្រើសសម្ភារៈចុងក្រោយរបស់អ្នក។

source: To import mail filters, click the <guibutton>Import Filters</guibutton> button and it will import any filters it found, once finished click the <guibutton>Next</guibutton> button, or the <guibutton>Finish</guibutton> button, if this was your last material selection.
km: ដើម្បីនាំចូលតម្រងសំបុត្រសូមចុចប៊ូតុង <guibutton> នាំចូលតម្រង </guibutton> ហើយវានឹងនាំចូលតម្រងណាមួយដែលវារកឃើញពេលចុចលើប៊ូតុង <guibutton> បន្ទាប់ </guibutton> ប៊ូតុងឬប៊ូតុង <guibutton> បញ្ចប់ </guibutton> ប៊ូតុងប្រសិនបើនេះជាជម្រើសសម្ភារៈចុងក្រោយរបស់អ្នក។

source: To import settings, click the <guibutton>Import Settings</guibutton> button. The wizard will ask you some questions &eg; which folder to use for account folders that do not exist. The wizard will also create your identity. Once complete, click the <guibutton>Next</guibutton> button, or the <guibutton>Finish</guibutton> button, if this was your last material selection.
km: ដើម្បីនាំចូលការកំណត់ចុចលើប៊ូតុង <guibutton> នាំចូលការកំណត់ </guibutton> ប៊ូតុង។ អ្នកជំនួយការនឹងសួរអ្នកនូវសំណួរមួយចំនួនឧទាហរណ៍; ដែលត្រូវប្រើសម្រាប់ថតគណនីដែលមិនមាន។ អ្នកជំនួយការក៏នឹងបង្កើតអត្តសញ្ញាណរបស់អ្នកផងដែរ។ ពេលចប់សូមចុចលើពាក្យ <guibutton> បន្ទាប់ </guibutton> ប៊ូតុងឬប៊ូតុង <guibutton> បញ្ចប់ </guibutton> ប៊ូតុងប្រសិនបើនេះជាជម្រើសសម្ភារៈចុងក្រោយរបស់អ្នក។

source: To import address books or calendars, click the <guibutton>Import address book</guibutton> or <guibutton>Import Calendar</guibutton> button, and it will import all address books or calendars it finds. Once complete, click the <guibutton>Next</guibutton> button.
km: ដើម្បីនាំចូលសៀវភៅអាសយដ្ឋានឬប្រតិទិនចុចលើប៊ូតុង <guibutton> នាំចូលសៀវភៅអាសយដ្ឋាន </guibutton> ឬ <guibutton> នាំចូលប្រតិទិន </guibutton> ហើយវានឹងនាំចូលសៀវភៅអាសយដ្ឋានឬប្រតិទិនទាំងអស់ដែលវារកឃើញ។ ពេលចប់សូមចុចលើពាក្យ <guibutton> បន្ទាប់ </guibutton> ប៊ូតុង។

source: Click the <guibutton>Finish</guibutton> button to complete and exit the wizard. If at any time you wish to end the wizard, you can click the <guibutton>Cancel</guibutton> button.
km: ចុចលើប៊ូតុង <guibutton> បញ្ចប់ </guibutton> ប៊ូតុងដើម្បីបញ្ចប់និងចេញពីអ្នកជំនួយការ។ ប្រសិនបើនៅពេលណាមួយដែលអ្នកចង់បញ្ចប់អ្នកជំនួយការអ្នកអាចចុចប៊ូតុង <guibutton> បោះបង់ </guibutton> ប៊ូតុង។

source: <title>Manual Import</title>
km: <title> ការនាំចូលដោយដៃ </title>

source: <screeninfo>Manual Import</screeninfo>
km: <screeninfo> ការនាំចូលដោយដៃ </screeninfo>

source: Please make sure that you compact your folders in the other email client.
km: សូមប្រាកដថាអ្នកបង្រួមថតឯកសាររបស់អ្នកនៅក្នុងម៉ាស៊ីនភ្ញៀវអ៊ីមែលផ្សេងទៀត។

source: Select your previous email program from the drop down box. The center text area of the dialog will update with special instructions (if applicable), and the known location of email message storage for that application. Follow these instructions, then select the folder you wish to import your messages to.
km: ជ្រើសកម្មវិធីអ៊ីមែលមុនរបស់អ្នកពីប្រអប់ទម្លាក់ចុះ។ ផ្នែកអត្ថបទកណ្តាលនៃប្រអប់នឹងធ្វើបច្ចុប្បន្នភាពដោយមានការណែនាំពិសេស (បើអាចអនុវត្តបាន) និងទីតាំងស្គាល់កន្លែងផ្ទុកសារអ៊ីមែលសម្រាប់កម្មវិធីនោះ។ អនុវត្តតាមការណែនាំទាំងនេះបន្ទាប់មកជ្រើសរើសថតឯកសារដែលអ្នកចង់នាំចូលសាររបស់អ្នក។

source: If you want to remove duplicate messages, check <guilabel>Remove duplicate messages during import</guilabel>. A file select dialog will pop up and you need to select the file/folder noted in the instructions. Click the <guibutton>Next</guibutton> button to complete the import. When the import is finished you can click the <guibutton>Back</guibutton> button to import from another application or the <guibutton>Finish</guibutton> button to exit.
km: ប្រសិនបើអ្នកចង់ដកចេញសារស្ទួនសូមពិនិត្យមើល <guilabel> លុបសារស្ទួនពេលនាំចូល </guilabel> ។ ប្រអប់ជ្រើសរើសឯកសារនឹងលេចឡើងហើយអ្នកត្រូវជ្រើសរើសឯកសារ / ថតដែលបានកត់សម្គាល់នៅក្នុងសេចក្តីណែនាំ។ ចុចលើប៊ូតុង <guibutton> បន្ទាប់ </guibutton> ប៊ូតុងដើម្បីបញ្ចប់ការនាំចូល។ នៅពេលដែលការនាំចូលត្រូវបានបញ្ចប់អ្នកអាចចុចប៊ូតុង <guibutton> ថយក្រោយ </guibutton> ប៊ូតុងដើម្បីនាំចូលពីកម្មវិធីផ្សេងទៀតឬឯកសារ <guibutton> បញ្ចប់ </guibutton> ប៊ូតុងដើម្បីចាកចេញ។

source: Credits and License
km: សេវាឥណទាននិងអាជ្ញាប័ណ្ណ

source: Program copyright 2013 Laurent Montel montel@kde.org
km: សិទ្ធិអ្នកនិពន្ធកម្មវិធីឆ្នាំ ២០១៣ Laurent Montel montel@kde.org

source: Section Manual Import is a modified copy of the KMailCVT handbook
km: ការនាំចូលផ្នែកដោយដៃគឺជាការចំលងនៃសៀវភៅដៃរបស់ KMailCVT

source: Documentation Copyright &copy; 2013 Laurent Montel montel@kde.org and Scarlett Clark scarlett@scarlettgatelyclark.com
km: ឯកសារច្បាប់រក្សាសិទ្ធិថតចំលង ឆ្នាំ ២០១៣ Laurent Montel montel@kde.org និង Scarlett Clark scarlett@scarlettgatelyclark.com
