Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/blinken/blinken.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: Sounds
km: សំឡេង

source: Font
km: ពុម្ពអក្សរ

# @action:button Start a new game
source: Start
km: ចាប់ផ្តើម

source: Restart
km: ចាប់ផ្តើមឡើងវិញ

source: Enter Your Name
km: បញ្ចូល​ឈ្មោះ​របស់​អ្នក

# @label:textbox refers to the user's name
source: Name:
km: ឈ្មោះ៖

source: Restart the game
km: ចាប់ផ្តើមហ្គេមឡើងវិញ

source: Quit Blinken
km: បោះបង់ Blinken

source: View Highscore Table
km: មើលតារាងពិន្ទុខ្ពស់

source: Show Settings
km: បង្ហាញការកំណត់

source: Hide Settings
km: លាក់ការកំណត់

source: 2nd Level
km: កំរិតទី ២

source: 1st Level
km: កំរិតទីមួយ

source: Random Level
km: កម្រិតចៃដន្យ

source: Press the key for this button
km: ចុចគ្រាប់ចុចសម្រាប់ប៊ូតុងនេះ

source: Click any button to change its key
km: ចុចប៊ូតុងណាមួយដើម្បីប្តូរលេខកូដរបស់វា

source: Press Start to begin
km: ចុចចាប់ផ្តើមដើម្បីចាប់ផ្តើម

source: Set the Difficulty Level...
km: កំណត់កំរិតលំបាក ...

source: Next sequence in 3...
km: លំដាប់បន្ទាប់ក្នុង ៣ ...

source: Next sequence in 3, 2...
km: លំដាប់បន្ទាប់ក្នុង ៣, ២ ...

source: Next sequence in 2...
km: លំដាប់បន្ទាប់ក្នុងលេខ ២ ...

source: Next sequence in 3, 2, 1...
km: លំដាប់បន្ទាប់ក្នុង ៣, ២, ១ …

source: Next sequence in 2, 1...
km: លំដាប់បន្ទាប់ក្នុង ២, ១ ...

source: Remember this sequence...
km: ចងចាំលំដាប់នេះ ...

source: Repeat the sequence
km: ធ្វើលំដាប់ម្តងទៀត

# @label:chooser which level is currently being played
source: Level
km: កំរិត

source: Play sounds
km: ចាក់សម្លេង

source: Use custom font for status text
km: ប្រើពុម្ពអក្សរផ្ទាល់ខ្លួនសម្រាប់អត្ថបទស្ថានភាព

# @title:window the highest scores for each level are shown
source: Highscores
km: ពិន្ទុ​ខ្ពស់

# @title:group High scores Level 1 tab title
source: Level 1
km: កំរិត ១

# @title:group High scores Level 2 tab title
source: Level 2
km: កំរិត ២

# @title:group High scores Level ? tab tible
source: Level ?
km: កម្រិត​ ?

source: A memory enhancement game
km: ល្បែងបង្កើនការចងចាំ

source: © 2005-2007 Albert Astals Cid © 2005-2007 Danny Allen
km: រក្សាសិទ្ធិ ២០០៥-២០០៧ អាល់ប៊ើតអាល់ស្ទេដស៊ីឌី © ២០០៥-២០០៧ ដានីអាឡែន

source: Albert Astals Cid
km: អាល់ប៊ែតអាល់ស្ទេដប៊ីដ

source: Coding
km: ការសរសេរកូដ

source: Design, Graphics and Sounds
km: ការរចនាក្រាហ្វិចនិងសំឡេង

source: GPL'ed his 'Steve' font so that we could use it
km: GPL បានប្រើពុម្ពអក្សរ 'Steve' របស់គាត់ដូច្នេះយើងអាចប្រើវាបាន
