Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/ark/ark.po
Languages: km

# @info
source: Loading the archive <filename>%1</filename> failed with the following error:<nl/><message>%2</message>
km: ផ្ទុកប័ណ្ណសារ <filename> %1 </filename> បានបរាជ័យដោយមានកំហុសដូចខាងក្រោមៈ <nl/><message> %2 </message>

source: Ark cannot open symlinks.
km: Ark មិនអាចបើកតំណភ្ជាប់បានទេ។

source: The file <filename>%1</filename> was modified. Do you want to update the archive?
km: ឯកសារ <filename> %1 </filename> ត្រូវបានកែប្រែ។ តើអ្នកចង់ធ្វើបច្ចុប្បន្នភាពប័ណ្ណសារទេ?

# @title:window
source: File Modified
km: បានកែប្រែឯកសារ

# @title:window
source: Add Files
km: បន្ថែម​ឯកសារ

# @title:window
source: Add Files to %1
km: បន្ថែមឯកសារទៅ %1

source: Filename can't contain slashes and can't be equal to "." or ".."
km: ឈ្មោះឯកសារមិនអាចមានសញ្ញា (_) និងមិនអាចស្មើនឹង "." ឬ ".."

source: Folders can't be moved into themselves.
km: ថតឯកសារមិនអាចត្រូវបានផ្លាស់ប្តូរទៅក្នុងខ្លួនគេទេ។

source: Moving a folder into itself
km: ការផ្លាស់ប្តូរថតឯកសារទៅក្នុងខ្លួនវា

source: Entries with the same names can't be pasted to the same destination.
km: ធាតុដែលមានឈ្មោះដូចគ្នាមិនអាចត្រូវបានបិទភ្ជាប់ទៅទិសដៅតែមួយទេ។

# @info
source: Deleting this file is not undoable. Are you sure you want to do this?
km: ការលុបឯកសារនេះគឺមិនអាចធ្វើវិញបានទេ។ តើអ្នកប្រាកដជាចង់ធ្វើវាឬ?

# @title:window
source: Delete File
km: លុប​ឯកសារ

# @title:window
source: Save Copy As
km: រក្សាទុកចម្លងជា

# @info
source: The archive could not be saved as <filename>%1</filename>. Try saving it to another location.
km: ប័ណ្ណសារមិនអាចរក្សាទុកបានទេ <filename> %1 </filename> ។ ព្យាយាមរក្សាទុកវាទៅទីតាំងមួយផ្សេងទៀត។

# @info
source: The archive <filename>%1</filename> does not exist anymore, therefore it cannot be copied to the specified location.
km: ប័ណ្ណសារ <filename> %1 </filename> មិនមានទៀតទេដូច្នេះវាមិនអាចចម្លងទៅទីតាំងដែលបានបញ្ជាក់បានទេ។

source: Listing the archive failed.
km: ការចុះបញ្ជីប័ណ្ណសារបានបរាជ័យ។

source: Extraction failed due to an unknown error.
km: ការស្រង់ចេញបានបរាជ័យដោយសារកំហុសមិនស្គាល់។

source: Extraction failed due to one or more corrupt files. Any extracted files may be damaged.
km: ការស្រង់ចេញបានបរាជ័យដោយសារឯកសារខូចមួយឬច្រើន។ រាល់ឯកសារដែលបានស្រង់ចេញអាចខូច។

source: Delete operation failed. Try upgrading p7zip or disabling the p7zip plugin in the configuration dialog.
km: ប្រតិបត្តិការលុបចោលបានបរាជ័យ។ ព្យាយាមធ្វើឱ្យប្រសើរ p7zip ឬបិទកម្មវិធីជំនួយ p7zip នៅក្នុងប្រអប់កំណត់រចនាសម្ព័ន្ធ។

source: Failed to find all archive volumes.
km: បានបរាជ័យក្នុងការស្វែងរកបរិមាណប័ណ្ណសារ។

source: Your unrar executable is version %1, which is too old to handle this archive. Please update to a more recent version.
km: ប្រតិបត្ដិការមិនផ្លូវការរបស់អ្នកគឺកំណែ %1 ដែលចាស់ពេកមិនអាចគ្រប់គ្រងប័ណ្ណសារនេះបាន។ សូមធ្វើបច្ចុប្បន្នភាពទៅកំណែថ្មីជាងនេះ។

source: Unrar reported a non-RAR archive. The installed unrar version (%1) is old. Try updating your unrar.
km: យូរ៉ារ៉ាបានរាយការណ៍ប័ណ្ណសារដែលមិនមែនជារ៉ាហ្វា។ កំណែអាន់ឌឺដែលបានតំឡើង (%1) ចាស់។ ព្យាយាមធ្វើបច្ចុប្បន្នភាពបញ្ជីឈ្មោះរបស់អ្នក។

source: One or more wrong checksums
km: ឆេកឆាន់មួយឬច្រើន

source: Extraction failed.
km: ការស្រង់ចេញបានបរាជ័យ។

source: Not enough memory for loading the archive.
km: មិនមានអង្គចងចាំគ្រប់គ្រាន់សម្រាប់ផ្ទុកប័ណ្ណសារទេ។

source: Wrong password.
km: លេខសំងាត់​ខុស។

source: Extraction failed due to unsupported compression method (%1).
km: ការស្រង់ចេញបានបរាជ័យដោយសារវិធីសាស្ត្របង្ហាប់មិនគាំទ្រ (%1) ។

source: Extraction failed due to unsupported encryption method.
km: ការទាញយកបានបរាជ័យដោយសារវិធីសាស្ត្របំលែងកូដ។

# referred to compression method
source: unknown
km: មិនស្គាល់

source: This archive contains archive entries with absolute paths, which are not supported by Ark.
km: ប័ណ្ណសារនេះមានធាតុបណ្ណសារដែលមានផ្លូវដាច់ខាតដែលមិនត្រូវបានគាំទ្រដោយ Ark ។

# @info
source: Fatal error, extraction aborted.
km: កំហុសធ្ងន់ធ្ងរការដកស្រង់ត្រូវបានបញ្ឈប់។

source: The archive reader could not be initialized.
km: អ្នកអានបណ្ណសារមិនអាចត្រូវបានចាប់ផ្តើមទេ។

# @info
source: Archive corrupted or insufficient permissions.
km: ប័ណ្ណសារខូចឬសិទ្ធិមិនគ្រប់គ្រាន់។

# @info
source: Failed to create a temporary file for writing data.
km: បានបរាជ័យក្នុងការបង្កើតឯកសារបណ្តោះអាសន្នសម្រាប់ការសរសេរទិន្នន័យ។

source: The archive writer could not be initialized.
km: អ្នកនិពន្ធបណ្ណសារមិនអាចត្រូវបានចាប់ផ្តើមទេ។

# @info
source: Could not open the archive for writing entries.
km: មិនអាចបើកប័ណ្ណសារសម្រាប់ការសរសេរធាតុ។

source: The compression type '%1' is not supported by Ark.
km: ប្រភេទបង្ហាប់ '%1' មិនត្រូវបានគាំទ្រដោយ Ark ឡើយ។

# @info
source: Could not set the compression method.
km: មិនអាចកំណត់វិធីសាស្ត្របង្ហាប់បានទេ។

# @info
source: Could not set the compression level.
km: មិនអាចកំណត់កម្រិតបង្ហាប់បានទេ។

# @info
source: Could not compress entry, operation aborted.
km: មិនអាចបង្រួមធាតុចូលប្រតិបត្តិការត្រូវបានបោះបង់។

# @info Error in a message box
source: Could not compress entry.
km: មិនអាចបង្រួមធាតុបានទេ។

# @info
source: Ark could not extract <filename>%1</filename>.
km: Ark មិនអាចដកស្រង់បានទេ <filename> %1 </filename>

# @info
source: Ark could not open <filename>%1</filename> for extraction.
km: Ark មិនអាចបើកបានទេ <filename> %1 </filename> សម្រាប់ការស្រង់ចេញ។

# @info
source: There was an error while reading <filename>%1</filename> during extraction.
km: មានកំហុសពេលអាន <filename> %1 </filename> កំឡុងពេលស្រង់ចេញ។

source: Failed to open archive: %1
km: បានបរាជ័យក្នុងការបើកប័ណ្ណសារ៖ %1

source: Failed to write archive.
km: បានបរាជ័យក្នុងការសរសេរប័ណ្ណសារ។

source: Failed to add entry: %1
km: បានបរាជ័យក្នុងការបន្ថែមធាតុ៖ %1

source: Failed to set compression options for entry: %1
km: បានបរាជ័យក្នុងការកំណត់ជម្រើសបង្ហាប់សម្រាប់ការបញ្ចូល៖ %1

source: Failed to read metadata for entry: %1
km: បានបរាជ័យក្នុងការអានទិន្នន័យមេតាសម្រាប់ការបញ្ចូល៖ %1

source: Failed to delete entry: %1
km: បានបរាជ័យក្នុងការលុបការបញ្ចូល៖ %1

source: Failed to create directory: %1
km: បានបរាជ័យក្នុងការបង្កើតថតឯកសារ៖ %1

source: Failed to open '%1':<nl/>%2
km: បានបរាជ័យក្នុងការបើក '%1'៖ <nl/> %2

source: Failed to open file for writing: %1
km: បានបរាជ័យក្នុងការបើកឯកសារសម្រាប់ការសរសេរ៖ %1

source: Failed to read data for entry: %1
km: បានបរាជ័យក្នុងការអានទិន្នន័យសម្រាប់ការបញ្ចូល៖ %1

source: Failed to write data for entry: %1
km: បានបរាជ័យក្នុងការសរសេរទិន្នន័យសម្រាប់ការបញ្ចូល៖ %1

source: Failed to locate entry: %1
km: បានបរាជ័យក្នុងការកំណត់ទីតាំងធាតុ៖ %1

source: Failed to move entry: %1
km: បានបរាជ័យក្នុងការផ្លាស់ទីធាតុ៖ %1

source: Failed to copy entry: %1
km: បានបរាជ័យក្នុងការចម្លងការចូល៖ %1

source: Failed to set metadata for entry: %1
km: បានបរាជ័យក្នុងការកំណត់ទិន្នន័យមេតាសម្រាប់ការចូល៖ %1
