Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/ark/ark.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: &Archive
km: ប័ណ្ណសារ

source: Extracting Files
km: ស្រង់ឯកសារ

source: Source archive
km: ប័ណ្ណសារប្រភព

source: Destination
km: ទិសដៅ

source: The following files could not be extracted:
km: ឯកសារខាងក្រោមមិនអាចទាញយកបានទេ៖

# @info
source: There was an error while extracting <filename>%1</filename>. Any further archive will not be extracted.
km: មានកំហុសខណៈពេលស្រង់ចេញ <filename> %1 </filename> ។ ប័ណ្ណសារណាមួយផ្សេងទៀតនឹងមិនត្រូវបានស្រង់ចេញទេ។

# @info
source: There was an error while extracting <filename>%1</filename>:<nl/><message>%2</message><nl/>Any further archive will not be extracted.
km: មានកំហុសខណៈពេលស្រង់ចេញ <filename> %1 </filename> ៖ <nl/><message> %2 </message><nl/> ប័ណ្ណសារណាមួយផ្សេងទៀតនឹងមិនត្រូវបានស្រង់ចេញទេ។

# @info
source: There was an error while extracting <filename>%1</filename>.
km: មានកំហុសខណៈពេលស្រង់ចេញ <filename> %1 </filename>

# @info
source: There was an error while extracting <filename>%1</filename>:<nl/><message>%2</message>
km: មានកំហុសខណៈពេលស្រង់ចេញ <filename> %1 </filename> ៖ <nl/><message> %2 </message>

# @info
source: The archive could not be extracted to <filename>%1</filename> because Ark can only extract to local destinations.
km: ប័ណ្ណសារមិនអាចត្រូវបានស្រង់ចេញទេ <filename> %1 </filename> ពីព្រោះ Ark អាចស្រង់បានតែគោលដៅក្នុងស្រុកប៉ុណ្ណោះ។

# @action:inmenu Part of Compress submenu in Dolphin context menu
source: Here (as TAR.GZ)
km: ទីនេះ (ជា TAR.GZ)

# @action:inmenu Part of Compress submenu in Dolphin context menu
source: Here (as ZIP)
km: ទីនេះ (ជាហ្ស៊ីប)

# @action:inmenu Part of Compress submenu in Dolphin context menu
source: Compress to...
km: បង្រួមទៅ ...

# @action:inmenu Compress submenu in Dolphin context menu
source: Compress
km: បង្រួម

# @action:inmenu Part of Extract submenu in Dolphin context menu
source: Extract archive to...
km: ស្រង់ចេញប័ណ្ណសារទៅ ...

# @action:inmenu Part of Extract submenu in Dolphin context menu
source: Extract archive here
km: ទាញយកប័ណ្ណសារនៅទីនេះ

# @action:inmenu Part of Extract submenu in Dolphin context menu
source: Extract archive here, autodetect subfolder
km: ទាញយកប័ណ្ណសារនៅទីនេះរកថតរងដោយស្វ័យប្រវត្តិ

# @action:inmenu Extract submenu in Dolphin context menu
source: Extract
km: ស្រង់ចេញ

# @action:inmenu Context menu shown when an archive is being drag'n'dropped
source: Extract here
km: ស្រង់នៅទីនេះ

source: KDE Archiving tool
km: ឧបករណ៍បណ្ណសាររបស់ KDE

source: (c) 1997-2019, The Ark Developers
km: (c) ឆ្នាំ ១៩៩៧-២០១៩ អ្នកអភិវឌ្ឍន៍ Ark

source: Maintainer
km: អ្នកថែរក្សា

source: Maintainer, KF5 port
km: អ្នកថែរក្សាកំពង់ផែ KF5

source: Former Maintainer
km: អតីតអ្នកថែរក្សា

source: Former maintainer
km: អតីតអ្នកថែរក្សា

source: Georg Robbers
km: លោក George Robbers

source: Emily Ezust (Corel Corporation)
km: Emily Ezust (សាជីវកម្មស្នូល)

source: Michael Jarrett (Corel Corporation)
km: Michael Jarrett (សាជីវកម្មស្នូល)

source: Advanced editing functionalities
km: មុខងារកែសម្រួលកម្រិតខ្ពស់

source: Icons
km: រូបតំណាង

source: Ideas, help with the icons
km: គំនិត, ជួយជាមួយរូបតំណាង

source: bkisofs code
km: កូដ bkisofs

source: URLs to open.
km: URLs ដើម្បីបើក។

source: Show a dialog for specifying the options for the operation (extract/add)
km: បង្ហាញប្រអប់សម្រាប់បញ្ជាក់ជម្រើសសម្រាប់ប្រតិបត្តិការ (ដកស្រង់ / បន្ថែម)

source: Destination folder to extract to. Defaults to current path if not specified.
km: ថតទិសដៅដើម្បីស្រង់ចេញ។ លំនាំដើមទៅផ្លូវបច្ចុប្បន្នប្រសិនបើមិនបានបញ្ជាក់។

source: Open destination folder after extraction.
km: បើកថតទិសដៅបន្ទាប់ពីស្រង់ចេញ។

source: Query the user for an archive filename and add specified files to it. Quit when finished.
km: សួរអ្នកប្រើសម្រាប់ឈ្មោះឯកសារប័ណ្ណសារនិងបន្ថែមឯកសារដែលបានបញ្ជាក់ទៅវា។ ចាកចេញនៅពេលបញ្ចប់។

source: Add the specified files to 'filename'. Create archive if it does not exist. Quit when finished.
km: បន្ថែមឯកសារដែលបានបញ្ជាក់ទៅ 'ឈ្មោះឯកសារ' ។ បង្កើតប័ណ្ណសារប្រសិនបើវាមិនមាន។ ចាកចេញនៅពេលបញ្ចប់។

source: Change the current dir to the first entry and add all other entries relative to this one.
km: ផ្លាស់ប្តូរ dir បច្ចុប្បន្នទៅធាតុទីមួយហើយបន្ថែមធាតុផ្សេងទៀតដែលទាក់ទងទៅនឹងធាតុនេះ។

source: Automatically choose a filename, with the selected suffix (for example rar, tar.gz, zip or any other supported types)
km: ជ្រើសរើសឈ្មោះឯកសារដោយស្វ័យប្រវត្តិដោយមានបច្ច័យដែលបានជ្រើសរើស (ឧទាហរណ៍ rar, tar.gz, zip ឬប្រភេទដែលគាំទ្រផ្សេងទៀត)

source: Use the batch interface instead of the usual dialog. This option is implied if more than one url is specified.
km: ប្រើចំណុចប្រទាក់បាច់ជំនួសឱ្យប្រអប់ធម្មតា។ ជម្រើសនេះត្រូវបានបញ្ជាក់ប្រសិនបើមាន url ច្រើនជាងមួយត្រូវបានបញ្ជាក់។

source: The destination argument will be set to the path of the first file supplied.
km: អាគុយម៉ង់គោលដៅនឹងត្រូវបានកំណត់ទៅផ្លូវនៃឯកសារដំបូងដែលបានផ្គត់ផ្គង់។

source: Archive contents will be read, and if detected to not be a single folder or a single file archive, a subfolder with the name of the archive will be created.
km: មាតិកាប័ណ្ណសារនឹងត្រូវបានអានហើយប្រសិនបើត្រូវបានរកឃើញថាមិនមែនជាថតឯកសារតែមួយឬប័ណ្ណសារឯកសារតែមួយនោះថតរងដែលមានឈ្មោះថាប័ណ្ណសារនឹងត្រូវបានបង្កើត។

source: List supported MIME types.
km: បញ្ជីប្រភេទ MIME ដែលបានគាំទ្រ។

source: Unable to find Ark's KPart component, please check your installation.
km: មិនអាចរកឃើញសមាសធាតុ KPart របស់ Ark សូមពិនិត្យមើលការតំឡើងរបស់អ្នក។

# action, to open an archive
source: Open
km: បើក

source: Open an archive
km: បើកប័ណ្ណសារ

# to open an archive
source: Open Archive
km: បើកប័ណ្ណសារ

source: Create New Archive
km: បង្កើតប័ណ្ណសារថ្មី

source: Advanced Options
km: ជម្រើសកម្រិតខ្ពស់

# @action:button
source: Add
km: បន្ថែម

source: Files/Folders to Compress
km: ឯកសារ / ថតឯកសារដើម្បីបង្រួម

source: Compress to Archive
km: បង្រួមទៅប័ណ្ណសារ

source: No input files were given.
km: មិនមានឯកសារបញ្ចូលត្រូវបានផ្តល់ឱ្យទេ។

source: You need to either supply a filename for the archive or a suffix (such as rar, tar.gz) with the <command>--autofilename</command> argument.
km: អ្នកត្រូវផ្តល់ឈ្មោះឯកសារសម្រាប់ប័ណ្ណសារឬបច្ច័យ (ដូចជា Rr, tar.gz) ជាមួយ <command> --autofilename </command> អាគុយម៉ង់។

source: Whether to show a warning when creating zip archives with AES encryption.
km: ថាតើត្រូវបង្ហាញការព្រមាននៅពេលបង្កើតប័ណ្ណសារហ្ស៊ីបជាមួយការអ៊ិនគ្រីបអេអេស។

source: Default action when opening archive entries.
km: សកម្មភាពលំនាំដើមនៅពេលបើកធាតុប័ណ្ណសារ។

source: Close Ark after extraction.
km: បិទ Ark បន្ទាប់ពីស្រង់ចេញ។

source: Preserve paths when extracting.
km: ថែរក្សាផ្លូវនៅពេលស្រង់ចេញ។

source: Extract to a subfolder if the archive has more than one top-level entry.
km: ស្រង់ចេញទៅថតរងប្រសិនបើប័ណ្ណសារមានធាតុកំពូលលើសពីមួយ។

source: How the main window is divided.
km: របៀបដែលផ្ទាំងកម្មវិធីមេត្រូវបានបែងចែក។

source: Whether to show the information panel.
km: ថាតើត្រូវបង្ហាញបន្ទះព័ត៌មាន។

source: Whether to limit the preview according to file size.
km: ថាតើត្រូវកម្រិតការមើលជាមុនយោងទៅតាមទំហំឯកសារ។

source: Preview file size limit in megabytes.
km: មើលដែនកំណត់ទំហំឯកសារគិតជាមេកាបៃ។

# @info
source: Failed to locate program <filename>%1</filename> on disk.
km: បានបរាជ័យក្នុងការរកទីតាំងកម្មវិធី <filename> %1 </filename> នៅលើថាស។

source: Extraction failed. Make sure that enough space is available.
km: ការស្រង់ចេញបានបរាជ័យ។ ត្រូវប្រាកដថាមានទំហំគ្រប់គ្រាន់។

source: Extraction failed. Make sure you provided the correct password and that enough space is available.
km: ការស្រង់ចេញបានបរាជ័យ។ សូមប្រាកដថាអ្នកបានផ្តល់លេខសម្ងាត់ត្រឹមត្រូវហើយមានទំហំគ្រប់គ្រាន់។

# @info
source: Could not move the extracted file to the destination directory.
km: មិនអាចផ្លាស់ទីឯកសារដែលបានស្រង់ចេញទៅថតទិសដៅទេ។

# @info
source: Extraction failed because the disk is full.
km: ការស្រង់ចេញបានបរាជ័យពីព្រោះថាសពេញហើយ។

# @info
source: Extraction failed: Incorrect password
km: ការស្រង់ចេញបានបរាជ័យ៖ ពាក្យសម្ងាត់មិនត្រឹមត្រូវ

source: Incorrect password.
km: ពាក្យសម្ងាត់មិនត្រឹមត្រូវ។

source: Ark does not currently support testing this archive.
km: បច្ចុប្បន្ន Ark មិនគាំទ្រការសាកល្បងប័ណ្ណសារនេះទេ។

source: Protection of the list of files is not possible with the %1 format.
km: ការការពារបញ្ជីឯកសារមិនអាចធ្វើទៅបានជាមួយនឹងទ្រង់ទ្រាយ %1 ។

source: Protection of the archive with password is not possible with the %1 format.
km: ការការពារប័ណ្ណសារជាមួយលេខសម្ងាត់មិនអាចធ្វើទៅបានទេជាមួយនឹងទម្រង់ %1 ។

source: It is not possible to set compression level for the %1 format.
km: មិនអាចកំណត់កម្រិតបង្ហាប់សម្រាប់ទ្រង់ទ្រាយ %1 ទេ។

source: It is not possible to set compression method for the %1 format.
km: មិនអាចកំណត់វិធីបង្ហាប់សម្រាប់ទ្រង់ទ្រាយ %1 ។

source: The %1 format does not support multi-volume archives.
km: ទ្រង់ទ្រាយ %1 មិនគាំទ្របណ្ណាសារច្រើនទេ។

source: Compression
km: ការបង្រួម

source: Level:
km: កំរិតៈ

source: Min
km: នាទី

source: Method:
km: វិធីសាស្រ្ត៖

source: Max
km: អតិបរមា

source: Password Protection
km: ការការពារលេខសម្ងាត់

source: Encryption method:
km: វិធីសាស្ត្រអ៊ិនគ្រីប៖

source: Ask for password before showing the list of files in the archive
km: សួររកលេខសំងាត់មុនពេលបង្ហាញបញ្ជីឯកសារនៅក្នុងប័ណ្ណសារ

source: This encryption method may not be supported by older archiving software.
km: វិធីសាស្ត្រអ៊ិនគ្រីបនេះប្រហែលជាមិនត្រូវបានគាំទ្រដោយកម្មវិធីបណ្ណសារចាស់ទេ។

source: Multi-volume Archive
km: ប័ណ្ណសារពហុបរិមាណ

source: Create multi-volume archive
km: បង្កើតប័ណ្ណសារពហុបរិមាណ

source: Volume size:
km: ទំហំសំឡេង៖

source: megabytes
km: មេកាបៃ

# the argument is a file extension (the period is not a typo)
source: Automatically add .%1
km: បន្ថែមដោយស្វ័យប្រវត្តិ។ %1

source: The chosen password does not match the given verification password.
km: ពាក្យសម្ងាត់ដែលបានជ្រើសរើសមិនត្រូវគ្នានឹងលេខកូដផ្ទៀងផ្ទាត់ដែលបានផ្តល់ទេ។

source: Folder:
km: ថតឯកសារ៖

source: Filename:
km: ឈ្មោះ​ឯកសារ៖

source: Type archive name...
km: វាយបញ្ចូលឈ្មោះប័ណ្ណសារ ...

source: Type:
km: ប្រភេទ៖

source: Extension:
km: ផ្នែកបន្ថែម៖

# @title:window
source: Extract
km: ស្រង់ចេញ

source: Extract
km: ស្រង់ចេញ

source: The subfolder name may not contain the character '/'.
km: ឈ្មោះថតរងអាចមិនមានតួអក្សរ '/' ។

# @info
source: The folder <filename>%1</filename> already exists. Are you sure you want to extract here?
km: ថតឯកសារ <filename> %1 </filename> ធ្លាប់​មាន​រួចហើយ។ តើអ្នកពិតជាចង់ស្រង់ចេញនៅទីនេះឬ?

source: Folder exists
km: មានថត

source: Extract here
km: ស្រង់នៅទីនេះ

source: Retry
km: ព្យាយាមម្តងទៀត

# @info
source: The folder <filename>%1</filename> could not be created.
km: ថតឯកសារ <filename> %1 </filename> មិនអាចត្រូវបានបង្កើត។

# @info
source: <filename>%1</filename> already exists, but is not a folder.
km: <filename> %1 </filename> មានរួចហើយប៉ុន្តែមិនមែនជាថតទេ។

source: Please check your permissions to create it.
km: សូមពិនិត្យមើលសិទ្ធិរបស់អ្នកដើម្បីបង្កើតវា។

source: Extract multiple archives
km: ស្រង់ចេញប័ណ្ណសារជាច្រើន

source: Extraction Dialog
km: ប្រអប់ស្រង់ចេញ

source: Extract All Files
km: ស្រង់ឯកសារទាំងអស់

source: E&xtraction into subfolder:
km: ការស្រង់ចេញទៅក្នុងថតរង៖

source: Options
km: ជម្រើស

source: Open &destination folder after extraction
km: បើកថតទិសដៅបន្ទាប់ពីស្រង់ចេញ

source: Close &Ark after extraction
km: បិទ Ark បន្ទាប់ពីស្រង់ចេញ

source: &Preserve paths when extracting
km: ថែរក្សាផ្លូវនៅពេលស្រង់ចេញ

source: &Automatically create subfolders
km: បង្កើតថតរងដោយស្វ័យប្រវត្តិ

# @title:group
source: Extract
km: ស្រង់ចេញ

source: Sele&cted files only
km: ឯកសារដែលបានជ្រើសរើសតែប៉ុណ្ណោះ

source: All &files
km: ឯកសារ​ទាំងអស់

source: Open destination folder after extraction
km: បើកថតទិសដៅបន្ទាប់ពីស្រង់ចេញ

source: Close Ark after extraction
km: បិទ Ark បន្ទាប់ពីស្រង់ចេញ

source: Preserve paths when extracting
km: ថែរក្សាផ្លូវនៅពេលស្រង់ចេញ

source: Whether to check by default the extraction into subfolder checkbox in the Extraction Dialog, when the archive has more than one top-level entry.
km: ថាតើត្រូវពិនិត្យមើលតាមលំនាំដើមការដកស្រង់ចូលក្នុងប្រអប់ធីកថតឯកសារនៅក្នុងប្រអប់ទាញយកនៅពេលដែលប័ណ្ណសារមានធាតុកំពូលលើសពីមួយ។

source: Extract to a subfolder if the archive has more than one top-level entry
km: ស្រង់ចេញទៅថតរងប្រសិនបើប័ណ្ណសារមានធាតុកំពូលលើសពីមួយ

source: When clicking a file in an archive or pressing the Return key:
km: នៅពេលចុចឯកសារក្នុងប័ណ្ណសារឬចុចគ្រាប់ចុចត្រឡប់៖

source: Pre&view the file with internal previewer
km: មើលឯកសារជាមុនជាមួយកម្មវិធីមើលជាមុន

source: Open the fi&le with associated application
km: បើកឯកសារជាមួយកម្មវិធីដែលជាប់ទាក់ទង

source: Show a warning when creating zip archives with AES encryption
km: បង្ហាញការព្រមាននៅពេលបង្កើតប័ណ្ណសារហ្ស៊ីបជាមួយការអ៊ិនគ្រីបអេអេអេស

source: No suitable plugin found. Ark does not seem to support this file type.
km: រកមិនឃើញកម្មវិធីជំនួយសមរម្យ។ Ark ហាក់ដូចជាមិនគាំទ្រប្រភេទឯកសារនេះទេ។

source: Failed to load a suitable plugin. Make sure any executables needed to handle the archive type are installed.
km: បានបរាជ័យក្នុងការផ្ទុកកម្មវិធីជំនួយដែលសមរម្យ។ ត្រូវប្រាកដថាប្រតិបត្តិដែលត្រូវការដើម្បីគ្រប់គ្រងប្រភេទប័ណ្ណសារត្រូវបានតំឡើង។

source: Could not load the archive because it contains ill-formed entries and might be a malicious archive.
km: មិនអាចផ្ទុកប័ណ្ណសារបានទេព្រោះវាមានធាតុមិនត្រឹមត្រូវហើយអាចជាប័ណ្ណសារព្យាបាទ។

source: Loading archive
km: ផ្ទុកប័ណ្ណសារ

source: Archive
km: ប័ណ្ណសារ

source: Extracting all files
km: ស្រង់ឯកសារទាំងអស់

source: Extracting one file
km: ស្រង់ឯកសារមួយ

# extraction folder
source: Destination
km: ទិសដៅ

source: Could not write to destination <filename>%1</filename>.<nl/>Check whether you have sufficient permissions.
km: មិនអាចសរសេរទៅទិសដៅបានទេ <filename> %1 </filename> ។ <nl/> ពិនិត្យមើលថាតើអ្នកមានសិទ្ធិគ្រប់គ្រាន់ដែរឬទេ។

source: Compressing a file
km: បង្រួមឯកសារ

source: Moving a file
km: ការផ្លាស់ទីឯកសារ

source: Copying a file
km: ការចម្លងឯកសារ

source: Deleting a file from the archive
km: ការលុបឯកសារចេញពីប័ណ្ណសារ

source: Adding comment
km: បន្ថែមមតិយោបល់

source: Testing archive
km: ប័ណ្ណសារសាកល្បង

source: The plugin cannot be used because one or more required executables are missing. Check your installation.
km: កម្មវិធីជំនួយមិនអាចប្រើបានទេពីព្រោះកម្មវិធីប្រតិបត្តិមួយឬច្រើនដែលត្រូវការត្រូវការបាត់។ ពិនិត្យមើលការតំឡើងរបស់អ្នក។

source: Name
km: ឈ្មោះ

source: Description
km: ការពិពណ៌នា

source: Disable preview for files larger than:
km: បិទការមើលជាមុនសម្រាប់ឯកសារធំជាង៖

# @title:window
source: Properties for %1
km: លក្ខណៈសម្បត្តិសម្រាប់ %1

source: yes
km: បាទ / ចាស

source: no
km: ទេ

source: yes (%1 volumes)
km: បាទ (បរិមាណ %1)

source: %1 file
km: ឯកសារ %1

source: , %1 folder
km: , ថត %1

source: only file contents (%1)
km: មានតែមាតិកាឯកសារប៉ុណ្ណោះ (%1)

source: yes (%1)
km: បាទ (%1)

source: Calculating...
km: កំពុងគណនា ...

source: Archive name:
km: ឈ្មោះប័ណ្ណសារ៖

source: Archive type:
km: ប្រភេទប័ណ្ណសារ៖

source: Mime-type:
km: ប្រភេទ Mime៖

source: Opened read-only:
km: បានបើកតែអាន៖

source: Password-protected:
km: ការពារពាក្យសម្ងាត់៖

source: Has comment:
km: មានយោបល់៖

source: Number of entries:
km: ចំនួនធាតុ៖

source: Unpacked size:
km: ទំហំខ្ចប់៖

source: Packed size:
km: ទំហំកញ្ចប់៖

source: Compression ratio:
km: សមាមាត្របង្ហាប់៖

source: Last modified:
km: កែប្រែចុងក្រោយ៖

source: Multi-volume:
km: បរិមាណច្រើន៖

source: Compression method(s):
km: វិធីសាស្ត្របង្ហាប់៖

# @title:window
source: File Already Exists
km: ឯកសារមានរួចហើយ

# @info
source: The archive <filename>%1</filename> is password protected. Please enter the password.
km: ប័ណ្ណសារ <filename> %1 </filename> ត្រូវបានការពារដោយពាក្យសម្ងាត់។ សូមបញ្ចូលពាក្យសម្ងាត់។

source: Incorrect password, please try again.
km: ពាក្យសម្ងាត់មិនត្រឹមត្រូវសូមព្យាយាមម្តងទៀត។

# @info
source: The archive you're trying to open is corrupt.<nl/>Some files may be missing or damaged.
km: ប័ណ្ណសារដែលអ្នកព្យាយាមបើកគឺខូច។ <nl/> ឯកសារខ្លះអាចបាត់ឬខូច។

# @title:window
source: Corrupt archive
km: ប័ណ្ណសារពុករលួយ

# @action:button
source: Open as Read-Only
km: បើកជាបានតែអាន

# @action:button
source: Don't Open
km: កុំបើក

source: Don't ask again.
km: កុំសួរម្តងទៀត។

source: Error during extraction
km: កំហុសក្នុងកំឡុងពេលស្រង់ចេញ

source: Extraction of the entry:<nl/> <filename>%1</filename><nl/>failed with the error message:<nl/> %2<nl/><nl/>Do you want to continue extraction?<nl/>
km: ការស្រង់ចេញនៃធាតុ៖ <nl/><filename> %1 </filename><nl/> បានបរាជ័យជាមួយសារកំហុស៖ <nl/> %2 <nl/><nl/> តើអ្នកចង់បន្តទាញយកទេ? <nl/>

# Name of a file inside an archive
source: Name
km: ឈ្មោះ

# Uncompressed size of a file inside an archive
source: Size
km: ទំហំ

# Compressed size of a file inside an archive
source: Compressed
km: បង្រួម

# Compression rate of file
source: Rate
km: អត្រា

# File's owner username
source: Owner
km: ម្ចាស់

# File's group
source: Group
km: ក្រុម

# File permissions
source: Mode
km: របៀប

# CRC hash code
source: CRC checksum
km: ឆែកកាកបាទក្រហមកម្ពុជា

# BLAKE2 hash code
source: BLAKE2 checksum
km: ឆេកសាំ BLAKE2

# Compression method
source: Method
km: វិធីសាស្រ្ត

# File version
source: Version
km: កំណែ

# Timestamp
source: Date
km: កាលបរិច្ឆេទ

source: Adding files is not supported for this archive.
km: ការបន្ថែមឯកសារមិនត្រូវបានគាំទ្រសម្រាប់ប័ណ្ណសារនេះទេ។

source: You can only add local files to an archive.
km: អ្នកអាចបន្ថែមតែឯកសារមូលដ្ឋានទៅប័ណ្ណសារ។

source: &File
km: ឯកសារ

source: &Settings
km: ការកំណត់

source: Main Toolbar
km: របារឧបករណ៍មេ

source: Closing preview
km: ការបិទការមើលជាមុន

source: Please wait while the preview is being closed...
km: សូមរង់ចាំខណៈពេលដែលការមើលជាមុនត្រូវបានបិទ ...

source: The internal viewer cannot preview this type of file<nl/>(%1).<nl/><nl/>Do you want to try to view it as plain text?
km: កម្មវិធីមើលខាងក្នុងមិនអាចមើលជាមុននូវប្រភេទឯកសារនេះទេ <nl/> (%1) ។ <nl/><nl/> តើអ្នកចង់ព្យាយាមមើលវាជាអត្ថបទធម្មតាទេ?

# @title:window
source: Cannot Preview File
km: មិនអាចមើលឯកសារជាមុនបានទេ

# @action:button
source: Preview as Text
km: មើលជាអត្ថបទ

source: The internal viewer cannot preview this unknown type of file.<nl/><nl/>Do you want to try to view it as plain text?
km: កម្មវិធីមើលខាងក្នុងមិនអាចមើលជាមុននូវប្រភេទឯកសារដែលមិនស្គាល់នេះទេ។ <nl/><nl/> តើអ្នកចង់ព្យាយាមមើលវាជាអត្ថបទធម្មតាទេ?

source: The internal viewer cannot preview this file.
km: កម្មវិធីមើលខាងក្នុងមិនអាចមើលឯកសារនេះជាមុនបានទេ។

source: No archive loaded
km: មិនមានផ្ទុកប័ណ្ណសារទេ

source: Symbolic Link
km: តំណនិមិត្តសញ្ញា

source: Unknown size
km: ទំហំមិនស្គាល់

source: One file selected
km: ឯកសារមួយត្រូវបានជ្រើសរើស

source: Information Panel
km: បន្ទះព័ត៌មាន

source: Unknown file type
km: មិនស្គាល់ប្រភេទឯកសារ

source: Owner:
km: ម្ចាស់៖

source: Group:
km: ក្រុម៖

source: Target:
km: គោលដៅ៖

source: Job Tracker
km: អ្នកតាមដានការងារ

source: <b>Job Description</b>
km: <b> ការពិពណ៌នាការងារ </b>

source: Some Information about the job
km: ព័ត៌មានខ្លះអំពីការងារ

source: Files with the following paths already exist. Remove them if you really want to overwrite.
km: ឯកសារដែលមានផ្លូវដូចខាងក្រោមមានរួចហើយ។ យកពួកវាចេញប្រសិនបើអ្នកពិតជាចង់សរសេរជាន់លើ។

source: Files with the following paths already exist. Do you want to continue overwriting them?
km: ឯកសារដែលមានផ្លូវដូចខាងក្រោមមានរួចហើយ។ តើអ្នកចង់បន្តសរសេរជាន់លើពួកវាទេ?

source: ArkPart
km: ផ្នែក Ark

source: Comment
km: មតិយោបល់

source: Comment has been modified.
km: មតិយោបល់ត្រូវបានកែប្រែ។

source: Save
km: រក្សាទុក

source: Type to search...
km: វាយបញ្ចូលដើម្បីស្វែងរក ...

# @info
source: Ark can extract archives to local destinations only.
km: Ark អាចស្រង់ចេញប័ណ្ណសារទៅកាន់គោលដៅក្នុងស្រុក។

# @action:inmenu
source: Show Information Panel
km: បង្ហាញផ្ទាំងព័ត៌មាន

# @action:inmenu
source: Save Copy As...
km: រក្សាទុកច្បាប់ចម្លងជា ...

# open a file with external program
source: &Open
km: បើក

# @info:tooltip
source: Click to open the selected file with the associated application
km: ចុចដើម្បីបើកឯកសារដែលបានជ្រើសរើសជាមួយកម្មវិធីដែលជាប់ទាក់ទង

# open a file with external program
source: Open &With...
km: បើក​ជាមួយ...

# @info:tooltip
source: Click to open the selected file with an external program
km: ចុចដើម្បីបើកឯកសារដែលបានជ្រើសរើសជាមួយកម្មវិធីខាងក្រៅ

# to preview a file inside an archive
source: Pre&view
km: មើលជាមុន

# @info:tooltip
source: Click to preview the selected file
km: ចុចដើម្បីមើលឯកសារដែលបានជ្រើសរើសជាមុន

# @action:inmenu
source: E&xtract All
km: ទាញយកទាំងអស់

source: Click to open an extraction dialog, where you can choose how to extract all the files in the archive
km: ចុចដើម្បីបើកប្រអប់ស្រង់ចេញដែលអ្នកអាចជ្រើសរើសវិធីស្រង់ចេញឯកសារទាំងអស់នៅក្នុងប័ណ្ណសារ

# @action:inmenu
source: &Extract
km: ស្រង់ចេញ

source: Click to open an extraction dialog, where you can choose to extract either all files or just the selected ones
km: ចុចដើម្បីបើកប្រអប់ស្រង់ចេញដែលអ្នកអាចជ្រើសរើសដើម្បីស្រង់ចេញនូវឯកសារទាំងអស់ឬគ្រាន់តែជាឯកសារដែលបានជ្រើសរើសប៉ុណ្ណោះ

source: Add &Files...
km: បន្ថែម​ឯកសារ...

# @info:tooltip
source: Click to add files to the archive
km: ចុចដើម្បីបន្ថែមឯកសារទៅប័ណ្ណសារ

# @action:inmenu
source: &Properties
km: លក្ខណៈសម្បត្តិ

# @info:tooltip
source: Click to see properties for archive
km: ចុចដើម្បីមើលលក្ខណៈសម្បត្តិសម្រាប់ប័ណ្ណសារ

# @info:tooltip
source: Click to add or edit comment
km: ចុចដើម្បីបន្ថែមឬកែសម្រួលមតិយោបល់

# @action:inmenu
source: &Test Integrity
km: សាកល្បងភាពត្រឹមត្រូវ

# @info:tooltip
source: Click to test the archive for integrity
km: ចុចដើម្បីសាកល្បងប័ណ្ណសារសម្រាប់ភាពសុចរិត

# @info:tooltip
source: Adding files to existing password-protected archives with no header-encryption is currently not supported.<nl/><nl/>Extract the files and create a new archive if you want to add files.
km: ការបន្ថែមឯកសារទៅប័ណ្ណសារដែលការពារដោយពាក្យសម្ងាត់ដែលមានស្រាប់ដោយគ្មានការអ៊ិនគ្រីបបឋមកថាបច្ចុប្បន្នមិនត្រូវបានគាំទ្រទេ។ <nl/><nl/> ទាញយកឯកសារនិងបង្កើតប័ណ្ណសារថ្មីប្រសិនបើអ្នកចង់បន្ថែមឯកសារ។

# @info:tooltip
source: Testing password-protected archives with no header-encryption is currently not supported.
km: បណ្ណសារដែលការពារដោយពាក្យសម្ងាត់ដោយគ្មានការអ៊ិនគ្រីបបឋមកថាបច្ចុប្បន្នមិនត្រូវបានគាំទ្រ។

# @action:inmenu mutually exclusive with Add &Comment
source: Edit &Comment
km: កែសម្រួលមតិយោបល់

# @action:inmenu mutually exclusive with Edit &Comment
source: Add &Comment
km: បន្ថែមមតិយោបល់

source: The archive passed the integrity test.
km: ប័ណ្ណសារបានឆ្លងកាត់ការសាកល្បងសុចរិតភាព។

source: Test Results
km: លទ្ធផល​តេ​ស្ត

source: The archive failed the integrity test.
km: ប័ណ្ណសារបានបរាជ័យក្នុងការសាកល្បងសុចរិតភាព។

source: Extract To...
km: ស្រង់ចេញទៅ ...

source: Quick Extract To...
km: ស្រង់ចេញរហ័សទៅ ...

# @title:tab
source: General
km: ទូទៅ

# @title:tab
source: Extraction
km: ការស្រង់ចេញ

# @title:tab
source: Plugins
km: កម្មវិធីជំនួយ

# @title:tab
source: Previews
km: ការមើលជាមុន

# @info
source: <filename>%1</filename> is a directory.
km: <filename> %1 </filename> គឺជាថតឯកសារ។

# @info
source: Could not overwrite <filename>%1</filename>. Check whether you have write permission.
km: មិនអាចសរសេរជាន់ពីលើបានទេ <filename> %1 </filename> ។ ពិនិត្យមើលថាតើអ្នកមានការអនុញ្ញាតក្នុងការសរសេរ។

# @info
source: The archive <filename>%1</filename> will be created as soon as you add a file.
km: ប័ណ្ណសារ <filename> %1 </filename> នឹងត្រូវបានបង្កើតនៅពេលដែលអ្នកបន្ថែមឯកសារ។

# @info
source: The archive <filename>%1</filename> was not found.
km: ប័ណ្ណសារ <filename> %1 </filename> មិនត្រូវបានរកឃើញ។

# @info
source: The archive <filename>%1</filename> could not be loaded, as it was not possible to read from it.
km: ប័ណ្ណសារ <filename> %1 </filename> មិនអាចផ្ទុកបានទេព្រោះមិនអាចអានពីវាបាន។

# @info
source: The archive <filename>%1</filename> already exists. Do you wish to overwrite it?
km: ប័ណ្ណសារ <filename> %1 </filename> ធ្លាប់​មាន​រួចហើយ។ តើអ្នកចង់សរសេរជាន់លើវាទេ?

# @title:window
source: File Exists
km: ឯកសារមាន

# @info
source: The archive is empty or Ark could not open its content.
km: ប័ណ្ណសារគឺទទេឬ Ark មិនអាចបើកមាតិការបស់វាបានទេ។

# @info
source: Ark does not currently support ISO files with UDF filesystem.
km: បច្ចុប្បន្ន Ark មិនគាំទ្រឯកសារអាយអេសអូជាមួយប្រព័ន្ធឯកសារយូឌីអេហ្វ។
