Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/ark/ark._json_.po
Languages: km

# Name
source: 'Extract' service menu
km: ម៉ឺនុយ 'ស្រង់ចេញ' សេវាកម្ម

# Name
source: 'Compress' service menu
km: ម៉ឺនុយសេវាកម្មបង្រួម

# Name
source: RAR plugin
km: កម្មវិធីជំនួយ RAR

# Name
source: Libarchive plugin (read-only formats)
km: កម្មវិធីជំនួយដែលមានលក្ខណៈសេរី (ទ្រង់ទ្រាយបានតែអាន)

# Name
source: Libarchive plugin
km: កម្មវិធីជំនួយអក្សរកាត់

# Name
source: LZMA plugin
km: កម្មវិធីជំនួយ LZMA

# Name
source: Gzip plugin
km: កម្មវិធីជំនួយជីហ្សីប

# Name
source: Bzip2 plugin
km: កម្មវិធីជំនួយប៊ីហ្ស៊ី ២

# Name
source: The Unarchiver plugin
km: កម្មវិធីជំនួយ Unarchiver

# Name
source: Info-zip plugin
km: កម្មវិធីជំនួយព័ត៌មាន - ហ្ស៊ីប

# Name
source: P7zip plugin
km: កម្មវិធីជំនួយ P7zip

# Description
source: Full support for the RAR archive format
km: ការគាំទ្រពេញលេញសម្រាប់ទ្រង់ទ្រាយប័ណ្ណសារ RAR

# Description
source: Open and extract DEB, RPM, ISO, AppImage, XAR and CAB files
km: បើកនិងដកស្រង់ឯកសារ DEB, RPM, ISO, AppImage, XAR និង CAB

# Description
source: Full support for compressed TAR archives
km: ការគាំទ្រពេញលេញសម្រាប់ប័ណ្ណសារ TAR ដែលបានបង្រួម

# Description
source: Open and extract single files compressed with the lzma algorithm
km: បើកនិងដកស្រង់ឯកសារតែមួយដែលបានបង្រួមជាមួយក្បួនដោះស្រាយលីហ្សាម៉ា

# Description
source: Open and extract single files compressed with the gzip algorithm
km: បើកនិងដកស្រង់ឯកសារតែមួយដែលបានបង្រួមជាមួយក្បួនដោះស្រាយជីហ្សីប

# Description
source: Open and extract single files compressed with the bzip2 algorithm
km: បើកនិងដកស្រង់ឯកសារតែមួយដែលបានបង្រួមជាមួយក្បួនដោះស្រាយ bzip2

# Description
source: Open and extract RAR archives
km: បើកនិងដកស្រង់ប័ណ្ណសារ RAR

# Description
source: Legacy support for the zip archive format
km: ការគាំទ្រកេរ្តិ៍ដំណែលសម្រាប់ទ្រង់ទ្រាយប័ណ្ណសារបង្រួម

# Description
source: Full support for the zip and 7z archive formats
km: ការគាំទ្រពេញលេញសម្រាប់ទ្រង់ទ្រាយប័ណ្ណសារហ្ស៊ីបនិង 7z
