Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/bovo/bovo.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: Theme
km: ស្បែក

source: Speed of demo and replay playback.
km: ល្បឿននៃការបង្ហាញនិងចាក់ឡើងវិញ។

source: Whether moves should be animated or not.
km: ថាតើចលនាគួរតែមានចលនាឬអត់។

source: AI engine to use.
km: ម៉ាស៊ីនអេអាយអេត្រូវប្រើ។

source: KDE Five in a Row Board Game
km: KDE ប្រាំនៅក្នុងល្បែងក្តារជួរដេក

source: (c) 2002-2007, Aron Boström
km: (c) ឆ្នាំ ២០០២-២០០៧ អារីនបូស្តុម

source: Author
km: អ្នកនិពន្ធ

source: Wins: %1
km: ឈ្នះ៖ %1

source: Losses: %1
km: ការបាត់បង់​ ៖ %1

source: &Replay
km: ចាក់ឡើងវិញ

source: Replay game
km: លេងហ្គេមឡើងវិញ

source: Replays your last game for you to watch.
km: បង្ហាញហ្គេមចុងក្រោយរបស់អ្នកសម្រាប់អ្នកមើល។

source: &Animation
km: ចលនា

source: Start a new Game to play
km: ចាប់ផ្តើមល្បែងថ្មីដើម្បីលេង

source: GAME OVER. Tie!
km: ល្បែង​ចប់ហើយ។ ចង!

source: GAME OVER. You won!
km: ល្បែង​ចប់ហើយ។ អ្នកឈ្នះ!

source: GAME OVER. You lost!
km: ល្បែង​ចប់ហើយ។ អ្នក​ចាញ់!

source: It is your turn.
km: ដល់វេនអ្នកហើយ។

source: Waiting for computer.
km: កំពុងរង់ចាំកុំព្យូទ័រ។

source: Replaying game
km: លេងហ្គេមឡើងវិញ

source: Game replayed.
km: ហ្គេមបានចាក់ឡើងវិញ។
