Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/calligra.po
Languages: km

source: A General Introduction
km: សេចក្តីណែនាំទូទៅ

source: &Jost.Schenck; &Jost.Schenck.mail;
km: ជូសេតឆិច; Jost.Schenck.mail;

source: &calligra; is a graphic art and office suite by &kde;.
km: calligra; គឺជាសិល្បៈក្រាហ្វិកនិងឈុតការិយាល័យដោយ KDE ។

source: Introduction
km: សេចក្តីផ្តើម

source: &calligra; components
km: calligra; សមាសភាគ

source: Please check <ulink url="http://docs.kde.org/development/en/calligra/calligra/index.html">http://docs.kde.org</ulink> for updated versions of this document.
km: សូម​ត្រួតពិនិត្យ <ulink url="http://docs.kde.org/development/en/calligra/calligra/index.html"> http://docs.kde.org </ulink> សម្រាប់កំណែថ្មីនៃឯកសារនេះ។

source: &calligra; is a graphic art and office suite by &kde;. &calligra; consists of the following components:
km: calligra; គឺជាសិល្បៈក្រាហ្វិកនិងឈុតការិយាល័យដោយ KDE ។ calligra; មានសមាសធាតុដូចខាងក្រោមៈ

source: &words; (a frames-based wordprocessor)
km: ពាក្យ; (កម្មវិធីវាយអត្ថបទផ្អែកលើស៊ុម)

source: &sheets; (a spreadsheet application)
km: សន្លឹក; (កម្មវិធីសៀវភៅបញ្ជី)

source: &stage; (screen and slide presentations)
km: ឆាក; (បទបង្ហាញលើអេក្រង់និងស្លាយ)

source: &flow; (a flowchart application)
km: លំហូរ; (កម្មវិធីគំនូសតាងលំហូរ)

source: &karbon; (a vector drawing application)
km: karbon; (កម្មវិធីគូរវ៉ិចទ័រ)

source: &plan; (a project management application)
km: ផែនការ (កម្មវិធីគ្រប់គ្រងគម្រោង)

source: Because these components use Flake technology, &calligra; components are designed to work very well with each other. Many &calligra; component can be embedded in another &calligra; document. For instance, you can insert a spreadsheet which you created in &sheets; directly into a &words; document. In this way, complex, compound documents can be created using &calligra;.
km: ដោយសារតែសមាសធាតុទាំងនេះប្រើបច្ចេកវិទ្យា Flake, calligra; សមាសភាគត្រូវបានរចនាឡើងដើម្បីធ្វើការយ៉ាងល្អជាមួយគ្នា។ អក្សរផ្ចង់ជាច្រើន សមាសភាគអាចត្រូវបានបង្កប់នៅក្នុងអក្សរផ្ចង់ផ្សេងទៀត។ ឯកសារ ឧទាហរណ៍អ្នកអាចបញ្ចូលសៀវភៅបញ្ជីដែលអ្នកបានបង្កើតនៅក្នុងសន្លឹក; ដោយផ្ទាល់ទៅក្នុងពាក្យមួយ; ឯកសារ តាមវិធីនេះឯកសារស្មុគស្មាញអាចត្រូវបានបង្កើតដោយប្រើអក្សរផ្ចង់។

source: A plugin mechanism makes it easy to extend the functionality of &calligra;. You will find many plugins in some of the components and can learn how to write plugins yourself.
km: យន្ដការជំនួយធ្វើឱ្យងាយស្រួលក្នុងការពង្រីកមុខងាររបស់អក្សរផ្ចង់។ អ្នកនឹងរកឃើញកម្មវិធីជំនួយជាច្រើននៅក្នុងសមាសធាតុមួយចំនួនហើយអាចរៀនពីរបៀបសរសេរកម្មវិធីជំនួយដោយខ្លួនឯង។

source: This manual only covers the general features of &calligra;, those that are common to most or all components in the suite. For detailed information about the different components, have a look at the respective manual.
km: សៀវភៅណែនាំនេះនិយាយពីលក្ខណៈទូទៅនៃអក្សរផ្ចង់ប៉ុណ្ណោះដែលមានលក្ខណៈធម្មតាចំពោះសមាសធាតុភាគច្រើនឬទាំងអស់នៅក្នុងឈុត។ សម្រាប់ព័ត៌មានលម្អិតអំពីសមាសធាតុផ្សេងៗសូមមើលសៀវភៅណែនាំរៀងៗខ្លួន។

source: Overview of &calligra; features
km: ទិដ្ឋភាពទូទៅនៃ calligra; លក្ខណៈពិសេស

source: Integration
km: សមាហរណកម្ម

source: &calligra; provides a framework that all components build on. Through this framework high integration is achieved. It is possible to develop your own component that integrates as well.
km: calligra; ផ្តល់នូវក្របខណ្ឌមួយដែលសមាសធាតុទាំងអស់បង្កើត។ តាមរយៈក្របខ័ណ្ឌនេះសមាហរណកម្មខ្ពស់ត្រូវបានសម្រេច។ អាចអភិវឌ្ឍសមាសធាតុផ្ទាល់ខ្លួនរបស់អ្នកដែលរួមបញ្ចូលផងដែរ។

source: Lightweight
km: ទំងន់ស្រាល

source: Despite offering so many components, &calligra; is lightweight, fast and has a rather low memory footprint. This is also achieved because &calligra; builds on &kde;, a powerful application development framework.
km: ទោះបីជាផ្តល់ជូននូវសមាសធាតុជាច្រើនក៏ដោយក៏ calligra; មានទំងន់ស្រាលលឿននិងមានជំហរចងចាំទាប។ នេះក៏ត្រូវបានសម្រេចផងដែរពីព្រោះ calligra; បង្កើតនៅលើ KDE ដែលជាក្របខ័ណ្ឌអភិវឌ្ឍន៍កម្មវិធីដែលមានអនុភាព។

source: A goal of &calligra; is also to not overload the user interface with features that are hardly needed. This results in a lean and mean user interface that lets you do your work efficiently.
km: គោលដៅនៃអក្សរផ្ចង់។ ក៏មិនត្រូវផ្ទុកលើសចំណុះអ្នកប្រើប្រាស់ជាមួយលក្ខណៈពិសេសដែលមិនត្រូវការ។ លទ្ធផលនេះផ្តល់នូវចំណុចប្រទាក់អ្នកប្រើដែលគ្មានខ្លាញ់និងមានន័យថាអ្នកអាចធ្វើការរបស់អ្នកប្រកបដោយប្រសិទ្ធភាព។

source: Being lightweight can at times also mean that that very particular special functionality you need is not there. In this case you can always add the functionality yourself by extending &calligra;. Extra features can always be made available through additional plugins or scripts, thus keeping &calligra; itself lightweight.
km: ការមានទម្ងន់ស្រាលនៅពេលខ្លះក៏មានន័យថាមុខងារពិសេសពិសេសដែលអ្នកត្រូវការគឺមិនមានទេ។ ក្នុងករណីនេះអ្នកតែងតែអាចបន្ថែមមុខងាររបស់អ្នកដោយពង្រីកអក្សរផ្ចង់។ លក្ខណៈពិសេសបន្ថែមតែងតែអាចរកបានតាមរយៈកម្មវិធីជំនួយបន្ថែមឬស្គ្រីបដូច្នេះរក្សាអក្សរផ្ចង់។ ខ្លួនវាស្រាល។

source: Completeness
km: ភាពពេញលេញ

source: &calligra; offers a wide range of components, covering most of the home and business office needs. Additional features can always be implemented through scripts, plugins or even whole components based on the &calligra; framework.
km: calligra; ផ្តល់ជូននូវជួរដ៏ធំទូលាយនៃសមាសភាគ, គ្របដណ្តប់ភាគច្រើននៃតម្រូវការការិយាល័យនៅផ្ទះនិងអាជីវកម្ម។ លក្ខណៈពិសេសបន្ថែមអាចត្រូវបានអនុវត្តជានិច្ចតាមរយៈស្គ្រីបកម្មវិធីជំនួយឬសមាសធាតុទាំងមូលដែលមានមូលដ្ឋានលើអក្សរផ្ចង់។ ក្របខ័ណ្ឌ

source: OASIS OpenDocument Format
km: ទ្រង់ទ្រាយ OpenDocument OASIS

source: It is a major importance for any office suite to adhere to established standards. Especially on the file format level to allow seamless document exchange with other office suites. This also avoids vendor lock-in, which is especially important for companies and also for individuals.
km: វាជាសារៈសំខាន់សំខាន់សម្រាប់ឈុតការិយាល័យណាមួយដើម្បីប្រកាន់ខ្ជាប់នូវស្តង់ដារដែលបានបង្កើតឡើង។ ជាពិសេសនៅលើកម្រិតទ្រង់ទ្រាយឯកសារដើម្បីអនុញ្ញាតឱ្យផ្លាស់ប្តូរឯកសារគ្មានថ្នេរជាមួយឈុតការិយាល័យផ្សេងទៀត។ នេះក៏ចៀសវាងអ្នកលក់ចាក់សោរដែលមានសារៈសំខាន់ជាពិសេសសម្រាប់ក្រុមហ៊ុននិងសម្រាប់បុគ្គលផងដែរ។

source: For this reason &calligra; has adapted the OASIS OpenDocument format as native file format.
km: សម្រាប់ហេតុផលនេះ calligra; បានកែសំរួលទ្រង់ទ្រាយអូសាសអូឌីស៊ីអ៊ែរជាទ្រង់ទ្រាយឯកសារដើម។

source: &kde; Features
km: kde; លក្ខណៈពិសេស

source: Since &calligra; builds on &kde; all the features you would expect from a &kde; application are also available in &calligra;. This includes &DBus;, KParts, Flake, Desktop Integration, Configurability and so on. All this makes the look and feel of &calligra; very familiar and really integrates &calligra; into the desktop environment, thus allowing seamless workflows.
km: ចាប់តាំងពី calligra; បង្កើតនៅលើ KDE ។ លក្ខណៈពិសេសទាំងអស់ដែលអ្នករំពឹងទុកពី KDE ។ ពាក្យសុំក៏មាននៅក្នុងអក្សរផ្ចង់ផងដែរ។ នេះរួមបញ្ចូល DBus; KParts, Flake, សមាហរណកម្មផ្ទៃ Desktop, ការកំណត់រចនាសម្ព័ន្ធនិងអ្វីៗផ្សេងទៀត។ ទាំងអស់នេះធ្វើឱ្យមានរូបរាងនិងអារម្មណ៍នៃអក្សរផ្ចង់។ ស្គាល់ច្បាស់ហើយពិតជារួមបញ្ចូលអក្សរផ្ចង់ ចូលទៅក្នុងផ្ទៃ Desktop Environmentដូច្នេះអនុញ្ញាតឱ្យលំហូរការងារគ្មានថ្នេរ។

source: Configuring &calligra; and Your System
km: កំណត់រចនាសម្ព័ន្ធ calligra; និងប្រព័ន្ធរបស់អ្នក

source: While &calligra; should work quite nice out of the box, there may well be some things to optimize to get the best out of &calligra;. This chapter shows you what you might want to do to achieve the best results with your new office suite and make it suite your needs. &calligra; is highly configurable, even down to detailed toolbar and menu layout.
km: ខណៈពេលដែល calligra; គួរតែដំណើរការល្អចេញពីប្រអប់វាអាចមានរឿងខ្លះដើម្បីបង្កើនប្រសិទ្ធភាពដើម្បីទទួលបាននូវអក្សរផ្ចង់រឹត។ ជំពូកនេះបង្ហាញអ្នកពីអ្វីដែលអ្នកចង់ធ្វើដើម្បីទទួលបានលទ្ធផលល្អបំផុតជាមួយនឹងឈុតការិយាល័យថ្មីរបស់អ្នកនិងធ្វើឱ្យវាសមស្របនឹងតម្រូវការរបស់អ្នក។ calligra; គឺអាចកំណត់រចនាសម្ព័ន្ធបានខ្ពស់សូម្បីតែរបារឧបករណ៍លម្អិតនិងប្លង់ម៉ឺនុយ។

source: Customizing the &calligra; &GUI;
km: ការប្តូរអក្សរផ្ចង់តាមបំណង; ហ្គីតា;

source: While &calligra; comes out of the box with a &GUI; (graphical user interface) that should suit most people's needs, there are good reasons why you may want to change the way the programs look.
km: ខណៈពេលដែល calligra; ចេញពីប្រអប់ជាមួយហ្គីហ្គី។ (ចំណុចប្រទាក់អ្នកប្រើក្រាហ្វិច) ដែលសមនឹងតម្រូវការរបស់មនុស្សភាគច្រើនមានហេតុផលល្អដែលអ្នកប្រហែលជាចង់ផ្លាស់ប្តូររបៀបដែលកម្មវិធីមើល។

source: My mother, for example, is a bit afraid of buttons and menu entries she doesn't understand. To tailor &calligra; to her needs, I reduced the &GUI; to a bare minimum of functionality. As she only needs to write letters and use certain templates, there is no need for much more functionality than saving, loading, printing, &etc;
km: ឧទាហរណ៍ម្ដាយរបស់ខ្ញុំខ្លាចខ្លាចប៊ូតុងនិងមុខម្ហូបដែលនាងមិនយល់។ កាត់ដេរ calligra; ចំពោះតំរូវការរបស់គាត់ខ្ញុំបានកាត់បន្ថយ GUI ។ ទៅអប្បបរមានៃមុខងារ។ ដោយសារនាងគ្រាន់តែត្រូវការសរសេរអក្សរនិងប្រើគំរូជាក់លាក់ប៉ុណ្ណោះមិនចាំបាច់មានមុខងារអ្វីច្រើនជាងការសន្សំការផ្ទុកការបោះពុម្ពជាដើម។

source: Thanks to the <quote>action</quote> concept of &Qt; and &kde;, you can freely customize &calligra; menubars and tool bars. Unfortunately, at the moment, there are no easy-to-use dialogs to do this. &calligra; stores its &GUI; configuration in &XML; files and you'll have to edit those. Hopefully, this situation will change in the future; for now, you'll need some basic knowledge of how an &XML; document works (or &HTML;, which is a subset of &XML;).
km: សូមអរគុណ <quote> សកម្មភាព </quote> គំនិត Qt; និង KDE អ្នកអាចប្តូរអក្សរផ្ចង់តាមបំណងតាមចិត្ត។ របារម៉ឺនុយនិងឧបករណ៍។ ជាអកុសលនៅពេលនេះមិនមានប្រអប់ងាយស្រួលប្រើដើម្បីធ្វើដូចនេះទេ។ calligra; រក្សាទុក GUI របស់វា។ ការកំណត់រចនាសម្ព័ន្ធក្នុង XML; ហើយអ្នកនឹងត្រូវកែសម្រួលឯកសារទាំងនោះ។ សង្ឃឹមថាស្ថានភាពនេះនឹងផ្លាស់ប្តូរនាពេលអនាគត។ សំរាប់ពេលនេះអ្នកនឹងត្រូវការចំនេះដឹងជាមូលដ្ឋានអំពីរបៀបដែល XML ឯកសារធ្វើការ (ឬ HTML ដែលជាសំណុំរងរបស់ XML;) ។

source: Normally, each &calligra; application has at least two of those &XML; files: one describing the &GUI; of the shell (basically, that's what you see if there is no document open) and one describing the &GUI; of the respective part (that's what you see normally). For example, for &words;, these two &XML; files are named <filename>calligra_shell.rc</filename> and <filename>words.rc</filename>.
km: ធម្មតាអក្សរផ្ចង់នីមួយៗ; កម្មវិធីមានយ៉ាងហោចណាស់ពីរនៃ XML ដែល; ឯកសារ៖ មួយពណ៌នាអំពី GUI ។ នៃសែល (ជាទូទៅនោះគឺជាអ្វីដែលអ្នកបានឃើញប្រសិនបើមិនមានឯកសារបើកទេ) និងមួយពិពណ៌នាអំពី GUI ។ នៃផ្នែករៀងៗខ្លួន (នោះជាអ្វីដែលអ្នកឃើញជាធម្មតា) ។ ឧទាហរណ៍សម្រាប់ពាក្យ; XML ទាំងពីរនេះ; ឯកសារត្រូវបានដាក់ឈ្មោះ <filename> calligrashell.rc </filename> និង <filename> word.rc </filename>

source: Here's a simple example of such an rc-file.
km: នេះគឺជាឧទាហរណ៍សាមញ្ញនៃឯកសារ rc ។

source: An example of a simple rc-file
km: ឧទាហរណ៍នៃឯកសារ rc- សាមញ្ញមួយ

source: &lt;!DOCTYPE QConfig &gt;&lt;qconfig&gt; &lt;menubar&gt; &lt;menu name="Edit"&gt;&lt;text&gt;Edit&lt;/text&gt; &lt;action name="edit_cut"/&gt; &lt;action name="edit_copy"/&gt; &lt;action name="edit_paste"/&gt; &lt;separator/&gt; &lt;action name="edit_find"/&gt; &lt;/menu&gt; &lt;menu name="Insert"&gt;&lt;text&gt;Insert&lt;/text&gt; &lt;action name="insert_picture"/&gt; &lt;action name="insert_clipart"/&gt; &lt;menu name="Variable"&gt;&lt;text&gt;Variable&lt;/text&gt; &lt;action name="insert_var_datefix"/&gt; &lt;action name="insert_var_datevar"/&gt; &lt;/menu&gt; &lt;/menu&gt; &lt;/menubar&gt; &lt;toolbars&gt; &lt;toolbar name="edit_toolbar" position="right"&gt; &lt;action name="edit_cut"/&gt; &lt;action name="edit_copy"/&gt; &lt;action name="edit_paste"/&gt; &lt;/toolbar&gt; &lt;/toolbars&gt; &lt;/qconfig&gt;
km: &lt;!DOCTYPE QConfig &gt;&lt;qconfig&gt; &lt;មីនុយបារ&gt; &lt;ឈ្មោះម៉ឺនុយ="កែសម្រួល"&gt;&lt;អត្ថបទ&gt;កែសម្រួល&lt;/អត្ថបទ&gt; &lt;ឈ្មោះសកម្មភាព="កែសម្រួលការកាត់"/&gt; &lt;ឈ្មោះសកម្មភាព="កែសម្រួលការចម្លង"/&gt; &lt;ឈ្មោះសកម្មភាព="កែសម្រួលការបិទភ្ជាប់"/&gt; &lt;separator/&gt; &lt;ឈ្មោះសកម្មភាព="កែសម្រួលការស្វែងរក"/&gt; &lt;/មីនុយ&gt; &lt;ឈ្មោះមីនុយ="បញ្ចូល"&gt;&lt;អត្ថបទ&gt;បញ្ចូល&lt;/អត្ថបទ&gt; &lt;ឈ្មោះសកម្មភាព="បញ្ចូលរូបភាព"/&gt; &lt;ឈ្មោះសកម្មភាព="បញ្ចូលគំនូរ​រូបភាព"/&gt; &lt;ឈ្មោះមីនុយ="អថេរ"&gt;&lt;អត្ថបទ&gt;អថេរ&lt;/អត្ថបទ&gt; &lt;ឈ្មោះសកម្មភាព="បញ្ចូលអថេរកាលបរិច្ឆេទ"/&gt; &lt;ឈ្មោះសកម្មភាព="បញ្ចូលអថេរកាលបរិច្ឆេទប្រែប្រួល"/&gt; &lt;/មីនុយ&gt; &lt;/មីនុយ&gt; &lt;/មីនុយរបារ&gt; &lt;របារឧបករណ៍&gt; &lt;ឈ្មោះរបារឧបករណ៍="កែសម្រួលរបារឧបករណ៍" ទីតាំង="ស្តាំ"&gt; &lt;ឈ្មោះសកម្មភាព="កែសម្រួលការកាត់"/&gt; &lt;ឈ្មោះសកម្មភាព="កែសម្រួលការចម្លង"/&gt; &lt;ឈ្មោះសកម្មភាព="កែសម្រួលការបិទភ្ជាប់"/&gt; &lt;/របារឧបករណ៍&gt; &lt;/របារឧបករណ៍&gt; &lt;/qconfig&gt;

source: How to get more information
km: តើធ្វើដូចម្តេចដើម្បីទទួលបានព័ត៌មានបន្ថែម

source: Other &calligra; manuals
km: អក្សរផ្ចង់ផ្សេងទៀត សៀវភៅណែនាំ

source: For detailed information on the different &calligra; applications, please consult their respective manuals.
km: សម្រាប់ព័ត៌មានលម្អិតស្តីពីអក្សរផ្ចង់ផ្សេងៗគ្នា។ ពាក្យសុំសូមពិគ្រោះសៀវភៅណែនាំរៀងៗខ្លួន។

source: Links
km: តំណភ្ជាប់

source: The following links should be useful if you're looking for more information about &kde; or &calligra;.
km: តំណខាងក្រោមគួរតែមានប្រយោជន៍ប្រសិនបើអ្នកកំពុងស្វែងរកព័ត៌មានបន្ថែមអំពី KDE ។ ឬអក្សរផ្ចង់។

source: <ulink url="http://calligra.org">The &calligra; homepage</ulink>. Here you can find information on how to get and install &calligra;, news about &calligra; development, screenshots &etc;
km: <ulink url="http://calligra.org"> អក្សរផ្ចង់ គេហទំព័រ </ulink> ។ នៅទីនេះអ្នកអាចស្វែងរកព័ត៌មានអំពីវិធីតំឡើងនិងតំឡើងអក្សរផ្ចង់ព័ត៌មានព័ត៌មានអំពី calligra ។ ការអភិវឌ្ឍន៍, រូបថតអេក្រង់។ ល។

source: <ulink url="http://www.kde.org">The &kde; Homepage</ulink>. &kde; is the most advanced and absolutely free desktop environment for unix-like operating systems. &calligra; makes use of the &kde; libraries.
km: <ulink url="http://www.kde.org"> kde; គេហទំព័រ </ulink> ។ kde; គឺជាផ្ទៃ Desktop Environmentឥតគិតថ្លៃបំផុតសម្រាប់ប្រព័ន្ធប្រតិបត្តិការដូចយូនីក &&amp; environment; ។ calligra; ប្រើ kde; បណ្ណាល័យ។

source: <ulink url="http://qt-project.org/">&Qt; page</ulink>. The creators of the C++-toolkit &Qt;. &kde; and &calligra; make use of &Qt;.
km: <ulink url="http://qt-project.org/"> Qt; ទំព័រ </ulink> ។ អ្នកបង្កើតឧបករណ៍ C ++ - ប្រអប់ឧបករណ៍ Qt; ។ kde; និងអក្សរផ្ចង់ ប្រើ Qt; ។

source: Programming &calligra;
km: កម្មវិធីសរសេរអក្សរផ្ចង់;

source: If you want to do &calligra; development, the following resources might be of interest:
km: ប្រសិនបើអ្នកចង់ធ្វើ calligra; ការអភិវឌ្ឍ, ធនធានដូចខាងក្រោមអាចជាចំណាប់អារម្មណ៍:

source: At <ulink url="http://techbase.kde.org/Development">http://techbase.kde.org/Development</ulink> you'll find many documents about programming with &Qt; and &kde;. You can find the online version of the complete &kde; library documentation on <ulink url="http://api.kde.org/">KDE API Reference</ulink>
km: នៅ <ulink url="http://techbase.kde.org/Development"> http://techbase.kde.org/Development </ulink> អ្នកនឹងរកឃើញឯកសារជាច្រើនអំពីការសរសេរកម្មវិធីជាមួយ Qt ។ និង KDE ។ អ្នកអាចរកឃើញកំណែអនឡាញនៃ kde ពេញលេញ។ បើកឯកសារបណ្ណាល័យ <ulink url="http://api.kde.org/"> សេចក្តីយោង API របស់ KDE </ulink>

source: The first step for contributing code is to follow <ulink url="http://community.kde.org/Calligra/Building/Building_Calligra">those instructions</ulink> to get the source code and build it.
km: ជំហានដំបូងសម្រាប់ការចែកចាយលេខកូដគឺធ្វើតាម <ulink url="http://community.kde.org/Calligra/Building/Building_Calligra"> ការណែនាំទាំងនោះ </ulink> ដើម្បីទទួលបានកូដប្រភពហើយបង្កើតវា។

source: Copyright and Licensing
km: រក្សាសិទ្ធិនិងអាជ្ញាប័ណ្ណ

source: &calligra; is the result of the joint effort of many developers. Each source file of &calligra; is copyrighted by the people who wrote this particular file and their names can be found at the start of each source file with the license that applies to that source file.
km: calligra; គឺជាលទ្ធផលនៃការខិតខំរួមគ្នារបស់អ្នកអភិវឌ្ឍន៍ជាច្រើន។ ឯកសារប្រភពនីមួយៗនៃ calligra; ត្រូវបានរក្សាសិទ្ធិដោយអ្នកដែលសរសេរឯកសារពិសេសនេះនិងឈ្មោះរបស់ពួកគេអាចរកបាននៅដើមឯកសារប្រភពនីមួយៗដែលមានអាជ្ញាប័ណ្ណដែលអនុវត្តចំពោះឯកសារប្រភពនោះ។

source: This manual is copyright by &Jost.Schenck;. It can be distributed freely, as long as this copyright notice is included. You may change it as long as you send me the changes or commit them to &kde; <acronym>Git</acronym>. I'll not be liable for anything resulting from the use of this manual.
km: សៀវភៅណែនាំនេះរក្សាសិទ្ធិដោយ Jost.Schenck; ។ វាអាចត្រូវបានចែកចាយដោយសេរីដរាបណាការជូនដំណឹងអំពីការរក្សាសិទ្ធិនេះត្រូវបានបញ្ចូល។ អ្នកអាចផ្លាស់ប្តូរវាដរាបណាអ្នកផ្ញើការផ្លាស់ប្តូរមកឱ្យខ្ញុំឬប្តេជ្ញាពួកគេចំពោះ KDE ។ <acronym> ហ្គីត </acronym> ។ ខ្ញុំនឹងមិនទទួលខុសត្រូវចំពោះអ្វីដែលបណ្តាលមកពីការប្រើប្រាស់សៀវភៅណែនាំនេះទេ។

source: The other &calligra; manuals are copyrighted by their respective authors.
km: អក្សរផ្ចង់ផ្សេងទៀត សៀវភៅណែនាំត្រូវបានរក្សាសិទ្ធិដោយអ្នកនិពន្ធរៀងៗខ្លួន។
