Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: The SUMXMY2() function (SUM((X-Y)^2)) returns the square of the differences of these values. The number of values in the two arrays should be equal. Otherwise this function returns Err.
km: មុខងារ SUMXMY2() (SUM ((XY) ^ 2)) ត្រឡប់ការ៉េនៃភាពខុសគ្នានៃតម្លៃទាំងនេះ។ ចំនួននៃតំលៃនៅក្នុងអារេទាំងពីរគួរតែស្មើគ្នា។ បើមិនដូច្នោះទេមុខងារនេះត្រឡប់អេរី។

source: SUMXMY2(array1;array2)
km: SUMXMY2 (អារេ ១; អារេ ២)

source: SUMXMY2(A1:A2;B1:B2) with A1=2, A2=5, B1=3 and B2=5, returns 1
km: SUMXMY2 (A1: A2; B1: B2) ជាមួយ A1 = 2, A2 = 5, B1 = 3 និង B2 = 5, ត្រឡប់ 1

source: The TDIST() function returns the t-distribution.
km: មុខងារ TDIST() ត្រឡប់ការចែកចាយ t ។

source: Mode = 1 returns the one-tailed test, Mode = 2 returns the two-tailed test.
km: របៀប = ១ ត្រឡប់ការធ្វើតេស្តកាត់កន្ទុយមួយរបៀប = ២ ត្រឡប់តេស្តពីរកន្ទុយ។

source: TDIST(number;degrees_freedom;mode)
km: TDIST (ចំនួន; ដឺក្រេសេរីភាព; របៀប)

source: Degrees of freedom for the t-distribution
km: ដឺក្រេសេរីសម្រាប់ការបែងចែក t

source: Mode (1 or 2)
km: របៀប (១ ឬ ២)

source: TDIST(12;5;1) returns 0.000035
km: TDIST (12; 5; 1) ត្រឡប់ 0,000035

source: The TREND() function calculates a sequence of values based on a linear regression of known value pairs.
km: មុខងារ TREND() គណនាលំដាប់នៃតម្លៃដែលផ្អែកលើតំរែតំរង់លីនេអ៊ែរនៃគូតម្លៃដែលស្គាល់។

source: Constraints: COUNT(knownY) = COUNT(knownX).
km: ឧបសគ្គ៖ COUNT (ស្គាល់Y) = COUNT (ស្គាល់X) ។

source: TREND(knownY[;knownX[;newX[;allowOffset = TRUE]]])
km: TREND (knownY [; knownX [; newX [; អនុញ្ញាតឱ្យឈប់ = TRUE]]])

source: KnownY
km: ស្គាល់

source: KnownX
km: ស្គាល់

source: NumberSequence newX
km: ចំនួនថ្មីភាពមិនស្មើគ្នា

source: allowOffset
km: អនុញ្ញាតឱ្យឈប់

source: The TRIMMEAN() function calculates the mean of a data set's fraction.
km: មុខងារ TRIMMEAN() គណនាមធ្យមភាគនៃប្រភាគរបស់សំណុំទិន្នន័យ។

source: TRIMMEAN(dataSet; cutOffFraction)
km: TRIMMEAN (សំណុំទិន្នន័យ; កាត់ផ្តាច់)

source: dataSet
km: សំណុំទិន្នន័យ

source: cutOffFraction
km: កាត់ផ្តាច់

source: The TTEST() function calculates the probability of a t-test.
km: មុខងារ TTEST() គណនាប្រូបាប៊ីលីតេនៃការធ្វើតេស្ត t ។

source: TTEST(x; y; type; mode)
km: TTEST (x; y; ប្រភេទ; របៀប)

source: x (array)
km: x (អារេ)

source: y (array)
km: y (អារេ)

source: mode
km: របៀប

source: The VAR() function calculates the estimates variance based on a sample.
km: មុខងារ VAR() គណនាភាពខុសគ្នានៃការប៉ាន់ស្មានដោយផ្អែកលើគំរូមួយ។

source: VAR(value;value;...)
km: VAR (តម្លៃ; តម្លៃ; ... )

source: VAR(12;5;7) equals 13
km: VAR (១២; ៥; ៧) ស្មើនឹង ១៣

source: VAR(15;80;3) equals 1716.333...
km: VAR (១៥; ៨០; ៣) ស្មើនឹង ១៧១៦.៣៣៣ …

source: VAR(6;7;8) equals 1
km: VAR (៦; ៧; ៨) ស្មើ ១

source: The VARA() function calculates the variance based on a sample.
km: មុខងារ VARA() គណនាវ៉ារ្យង់ផ្អែកលើគំរូមួយ។

source: VARA(value;value;...)
km: VARA (តម្លៃ; តម្លៃ; ... )

source: VARA(12;5;7) equals 13
km: VARA (១២; ៥; ៧) ស្មើនឹង ១៣

source: VARA(15;80;3) equals 1716.333...
km: VARA (១៥; ៨០; ៣) ស្មើនឹង ១៧១៦.៣៣៣ …

source: VARA(6;7;8) equals 1
km: VARA (៦; ៧; ៨) ស្មើ ១

source: The VARIANCE() function calculates the estimates variance based on a sample. It's the same as the VAR function.
km: អនុគមន៍ VARIANCE() គណនាភាពខុសគ្នានៃការប៉ាន់ស្មានដោយផ្អែកលើគំរូមួយ។ វាដូចគ្នានឹងមុខងារ VAR ដែរ។

source: VARIANCE(value;value;...)
km: VARIANCE (តម្លៃ; តម្លៃ; ... )

source: VARIANCE(12;5;7) equals 13
km: VARIANCE (១២; ៥; ៧) ស្មើ ១៣

source: VARIANCE(15;80;3) equals 1716.333...
km: VARIANCE (១៥; ៨០; ៣) ស្មើនឹង ១៧១៦.៣៣៣ …

source: VARIANCE(6;7;8) equals 1
km: VARIANCE (៦; ៧; ៨) ស្មើ ១

source: The VARP() function calculates the variance based on an entire population.
km: អនុគមន៍ VARP() គណនាវ៉ារ្យង់ផ្អែកលើប្រជាជនទាំងមូល។

source: VARP(value;value;...)
km: VARP (តម្លៃ; តម្លៃ; ... )

source: VARP(12;5;7) equals 8.666...
km: VARP (១២; ៥; ៧) ស្មើនឹង ៨.៦៦៦ …

source: VARP(15;80;3) equals 1144.22...
km: VARP (១៥; ៨០; ៣) ស្មើនឹង ១១៤៤.២២ …

source: VARP(6;7;8) equals 0.6666667...
km: VARP (៦; ៧; ៨) ស្មើនឹង ០.៦៦៦៦៦៦៧ …

source: The VARPA() function calculates the variance based on an entire population. Text and boolean values that evaluate to FALSE are counted as 0, boolean value that evaluate to TRUE are counted as 1.
km: មុខងារ VARPA() គណនាវ៉ារ្យង់ផ្អែកលើប្រជាជនទាំងមូល។ តម្លៃអក្សរនិងប៊ូលីនដែលវាយតម្លៃចំពោះ FALSE ត្រូវបានរាប់ជា ០ តម្លៃប៊ូលីនដែលវាយតម្លៃទៅ TRUE ត្រូវបានរាប់ជា ១ ។

source: VARPA(value;value;...)
km: VARPA (តម្លៃ; តម្លៃ; ... )

source: VARPA(12;5;7) equals 8.666...
km: VARPA (១២; ៥; ៧) ស្មើនឹង ៨.៦៦៦ …

source: VARPA(15;80;3) equals 1144.22...
km: VARPA (១៥; ៨០; ៣) ស្មើនឹង ១១៤៤.២២ …

source: VARPA(6;7;8) equals 0.6666667...
km: VARPA (៦; ៧; ៨) ស្មើ ០.៦៦៦៦៦៦៧ …

source: The WEIBULL() function returns the Weibull distribution.
km: មុខងារ WEIBULL() ត្រឡប់ការចែកចាយ Weibull ។

source: The alpha and beta parameters must be positive, the number (first parameter) must be non-negative.
km: ប៉ារ៉ាម៉ែត្រអាល់ហ្វានិងបេតាត្រូវតែវិជ្ជមានលេខ (ប៉ារ៉ាម៉ែត្រដំបូង) ត្រូវតែមិនអវិជ្ជមាន។

source: WEIBULL(number;alpha;beta;cumulative)
km: WEIBULL (ចំនួន; អាល់ហ្វា; បែតា; តគ្នា)

source: WEIBULL(2;1;1;0) equals 0.135335
km: WEIBULL (២; ១; ១; ០) ស្មើ ០.១៣៥៣៣៥

source: WEIBULL(2;1;1;1) equals 0.864665
km: WEIBULL (២; ១; ១; ១) ស្មើ ០.៨៦៤៦៦៥

source: The ZTEST() function calculates the two tailed probability of a z-test with normal distribution.
km: មុខងារ ZTEST() គណនាប្រូបាប៊ីលីតេដែលមានកន្ទុយពីរនៃការធ្វើតេស្ត z ជាមួយនឹងការចែកចាយធម្មតា។

source: Performs a test of the null hypothesis, that sample is a sample of a normal distributed random variable with mean mean and standard deviation sigma. A return value of 1 indicates, that the null hypothesis is rejected, i.e. the sample is not a random sample of the normal distribution. If sigma is omitted, it is estimated from sample, using STDEV.
km: អនុវត្តតេស្តនៃសម្មតិកម្មទទេគំរូនោះគឺជាគំរូនៃអថេរចៃដន្យចែកចាយធម្មតាជាមួយមធ្យមនិងគម្លាតគម្លាតគំរូ។ តម្លៃត្រឡប់នៃ 1 បង្ហាញថាសម្មតិកម្មទទេត្រូវបានបដិសេធពោលគឺគំរូមិនមែនជាគំរូចៃដន្យនៃការចែកចាយធម្មតាទេ។ ប្រសិនបើ sigma ត្រូវបានលុបចោលវាត្រូវបានគេប៉ាន់ស្មានពីគំរូដោយប្រើ STDEV ។

source: ZTEST(x; mean; standardDeviation)
km: ZTEST (x; មធ្យម; ការផ្លាស់ប្តូរស្តង់ដារ)

source: mean
km: មានន័យថា

source: standardDeviation
km: ការផ្លាស់ប្តូរស្តង់ដារ

source: <title>Text</title>
km: <title> អត្ថបទ </title>

source: The ASC() function returns the half-width characters corresponding to the full-width argument.
km: មុខងារ ASC() ត្រឡប់តួអក្សរពាក់កណ្តាលទទឹងដែលត្រូវគ្នាទៅនឹងអាគុយម៉ង់ទទឹងពេញ។

source: ASC(text)
km: ASC (អត្ថបទ)

source: Full width characters
km: តួអក្សរទទឹងពេញ

source: The BAHTTEXT() function converts a number to a text in Thai characters (baht).
km: មុខងារ BAHTTEXT() បំលែងលេខទៅជាអត្ថបទជាអក្សរថៃ (ប្រាក់បាត) ។

source: BAHTTEXT(number)
km: BAHTTEXT (ចំនួន)

source: BAHTTEXT(23) returns "ยสบสามบาทถวน"
km: BAHTTEXT (23) ត្រឡប់ " ยสสามบาทถวน "

source: The CHAR() function returns the character specified by a number.
km: មុខងារ CHAR() ត្រឡប់តួអក្សរដែលបានបញ្ជាក់ដោយលេខ។

source: CHAR(code)
km: CHAR (កូដ)

source: Character code
km: កូដតួអក្សរ

source: CHAR(65) returns "A"
km: CHAR (65) ត្រឡប់ "A"

source: The CLEAN() function removes every non-printable character from the string
km: មុខងារ CLEAN() ដករាល់តួអក្សរដែលមិនអាចបោះពុម្ពបានចេញពីខ្សែអក្សរ

source: CLEAN(text)
km: CLEAN (អត្ថបទ)

source: Source string
km: ខ្សែអក្សរប្រភព

source: CLEAN(AsciiToChar(7) + "HELLO") returns "HELLO"
km: CLEAN (AsciiToChar (7) + "HELLO") ត្រឡប់ "HELLO"

source: The CODE() function returns a numeric code for the first character in a text string.
km: មុខងារ CODE() ត្រឡប់លេខកូដសម្រាប់តួអក្សរដំបូងនៅក្នុងខ្សែអក្សរអត្ថបទ។

source: CODE(text)
km: CODE (អត្ថបទ)

source: CODE("KDE") returns 75
km: CODE ("KDE") ត្រឡប់ 75

source: The COMPARE() function returns 0 if the two strings are equal; -1 if the first one is lower in value than the second one; otherwise it returns 1.
km: អនុគមន៍ COMPARE() ត្រឡប់ 0 ប្រសិនបើខ្សែទាំងពីរស្មើគ្នា។ -1 ប្រសិនបើលេខទីមួយគឺទាបជាងតម្លៃទីពីរ; បើមិនដូច្នោះទេវាត្រឡប់មកវិញ 1 ។

source: COMPARE(string1; string2; true|false)
km: COMPARE (ខ្សែ ១; ខ្សែ ២; ពិត | មិនពិត)

source: First string
km: ខ្សែអក្សរទីមួយ

source: String to compare with
km: ខ្សែអក្សរដើម្បីប្រៀបធៀបជាមួយ

source: Compare case-sensitive (true/false)
km: ប្រៀបធៀបករណីប្រកាន់អក្សរតូចធំ (ពិត / មិនពិត)

source: COMPARE("Calligra"; "Calligra"; true) returns 0
km: COMPARE ("Calligra"; "Calligra"; ពិត) ត្រឡប់ 0

source: COMPARE("calligra"; "Calligra"; true) returns 1
km: COMPARE ("calligra"; "Calligra"; ពិត) ត្រឡប់ ១

source: COMPARE("kspread"; "Calligra"; false) returns 1
km: COMPARE ("kspread"; "Calligra"; មិនពិត) ត្រឡប់ ១

source: The CONCATENATE() function returns a string which is the concatenation of the strings passed as parameters.
km: អនុគមន៍ CONCATENATE() ត្រឡប់ខ្សែដែលជាការដាក់ខ្សែអក្សរបន្តគ្នាជាប៉ារ៉ាម៉ែត្រ។

source: CONCATENATE(value;value;...)
km: CONCATENATE (តម្លៃ; តម្លៃ; ... )

source: CONCATENATE("Sheets";"Calligra";"KDE") returns "SheetsCalligraKDE"
km: CONCATENATE ("Sheets"; "Calligra"; "KDE") ត្រឡប់ "SheetsCalligraKDE"

source: The DOLLAR() function converts a number to text using currency format, with the decimals rounded to the specified place. Although the name is DOLLAR, this function will do the conversion according to the current locale.
km: អនុគមន៍ DOLLAR() បំលែងលេខមួយទៅជាអត្ថបទដោយប្រើទម្រង់រូបិយប័ណ្ណដោយខ្ទង់ទសភាគត្រូវបានបង្គត់ទៅកន្លែងដែលបានបញ្ជាក់។ ទោះបីជាឈ្មោះ DOLLAR ក៏ដោយមុខងារនេះនឹងធ្វើការផ្លាស់ប្តូរយោងទៅតាមមូលដ្ឋានបច្ចុប្បន្ន។

source: DOLLAR(number;decimals)
km: DOLLAR (ចំនួន; ទសភាគ)

source: Decimals
km: ទសភាគ

source: DOLLAR(1403.77) returns "$ 1,403.77"
km: DOLLAR (1403.77) ត្រឡប់ " $ 1,403.77"

source: DOLLAR(-0.123;4) returns "$-0.1230"
km: DOLLAR (-0.123; 4) ត្រឡប់ " $-0.1230"

source: The EXACT() function returns True if these two strings are equal. Otherwise, it returns False.
km: អនុគមន៍ EXACT() ត្រឡប់ពិតប្រសិនបើខ្សែទាំងពីរនេះស្មើ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។

source: EXACT(string1;string2)
km: EXACT (ខ្សែ ១ ខ្សែ ២)

source: String
km: ខ្សែអក្សរ

source: EXACT("Calligra";"Calligra") returns True
km: EXACT ("Calligra"; "Calligra") ត្រឡប់ពិត

source: EXACT("KSpread";"Calligra") returns False
km: EXACT ("KSpread"; "Calligra") ត្រឡប់មិនពិត

source: The FIND() function finds one text string (find_text) within another text string (within_text) and returns the number of the starting point of find_text, from the leftmost character of within_text.
km: មុខងារ FIND() រកឃើញខ្សែអត្ថបទមួយ (findtext) នៅក្នុងខ្សែអក្សរអត្ថបទមួយផ្សេងទៀត (អត្ថបទ) ហើយត្រឡប់លេខនៃចំណុចចាប់ផ្តើមនៃអត្ថបទស្វែងរកពីតួអក្សរខាងឆ្វេងបំផុតនៃអត្ថបទ។

source: Parameter start_num specifies the character at which to start the search. The first character is character number 1. If start_num is omitted, it is assumed to be 1.
km: លេខចាប់ផ្តើមប៉ារ៉ាម៉ែត្របញ្ជាក់ពីតួអក្សរដែលត្រូវចាប់ផ្តើមស្វែងរក។ តួអក្សរទីមួយគឺតួអក្សរលេខ ១ ។ ប្រសិនបើលេខចាប់ផ្តើមត្រូវបានលុបវាត្រូវបានសន្មតថាជា ១ ។

source: You can also use function SEARCH, but unlike SEARCH, FIND is case-sensitive and does not allow wildcard characters.
km: អ្នកក៏អាចប្រើមុខងារ SEARCH ផងដែរប៉ុន្តែមិនដូច SEARCH នោះទេ FIND គឺប្រកាន់អក្សរតូចធំនិងមិនអនុញ្ញាតតួអក្សរជំនួស។

source: FIND(find_text;within_text;start_num)
km: FIND (អត្ថបទស្វែងរក; អត្ថបទ; ចំនួនចាប់ផ្តើម)

source: The text you want to find
km: អត្ថបទដែលអ្នកចង់រក

source: The text which may contain find_text
km: អត្ថបទដែលអាចមានអត្ថបទស្វែងរក

source: Specifies index to start the search
km: បញ្ជាក់លិបិក្រមដើម្បីចាប់ផ្តើមស្វែងរក

source: FIND("Cal";"Calligra") returns 1
km: FIND ("Cal"; "Calligra") ត្រឡប់ 1

source: FIND("i";"Calligra") returns 5
km: FIND ("i"; "Calligra") ត្រឡប់ ៥

source: FIND("a";"Sheets in Calligra";4) returns 12
km: FIND ("a"; "Sheets ក្នុង Calligra"; ៤) ត្រឡប់ ១២

source: The FINDB() function finds one text string (find_text) within another text string (within_text) and returns the number of the starting point of find_text, from the leftmost character of within_text using byte positions.
km: មុខងារ FINDB() រកឃើញខ្សែអត្ថបទមួយ (findtext) នៅក្នុងខ្សែអក្សរអត្ថបទមួយផ្សេងទៀត (អត្ថបទ) ហើយត្រឡប់លេខនៃចំណុចចាប់ផ្តើមនៃអត្ថបទស្វែងរកពីតួអក្សរខាងឆ្វេងបំផុតនៃអត្ថបទដោយប្រើទីតាំងបៃ។

source: Parameter BytePosition specifies the character at which to start the search. The first character is character number 2. If start_num is omitted, it is assumed to be 2.
km: ប៉ារ៉ាម៉ែតប៉ារ៉ាម៉ែត្របញ្ជាក់ពីតួអក្សរដែលត្រូវចាប់ផ្តើមស្វែងរក។ តួអក្សរទីមួយគឺតួអក្សរលេខ ២ ។ ប្រសិនបើលេខចាប់ផ្តើមត្រូវបានលុបវាត្រូវបានសន្មតថាជា ២ ។

source: FINDB(find_text;within_text;BytePosition Start)
km: FINDB (findtext; intext; BytePosition Start)

source: Specifies byte position to start the search
km: បញ្ជាក់ទីតាំងបៃដើម្បីចាប់ផ្តើមស្វែងរក

source: The FIXED() function rounds a number to the specified number of decimals, formats the number in decimal format string, and returns the result as text. If decimals is negative, number is rounded to the left of the decimal point. If you omit decimals, it is assumed to be 2. If optional parameter no_commas is True, thousand separators will not show up.
km: មុខងារ FIXED() បង្គត់ចំនួនមួយទៅនឹងចំនួនទសភាគដែលបានបញ្ជាក់ធ្វើទ្រង់ទ្រាយលេខជាខ្សែទ្រង់ទ្រាយទសភាគហើយត្រឡប់លទ្ធផលជាអត្ថបទ។ ប្រសិនបើទសភាគអវិជ្ជមានចំនួនត្រូវបានបង្គត់ទៅខាងឆ្វេងនៃគោលដប់។ ប្រសិនបើអ្នកលុបខ្ទង់ទសភាគវាត្រូវបានគេសន្មតថាជា ២ ។ ប្រសិនបើ nocommas ប៉ារ៉ាម៉ែត្រស្រេចចិត្តគឺជាការបំបែកខ្ទង់ពាន់នឹងមិនបង្ហាញទេ។

source: FIXED(number;decimals;no_commas)
km: FIXED (ចំនួន; ខ្ទង់ទសភាគ; nocommas)

source: No_commas
km: គ្មានសញ្ញាក្បៀស

source: FIXED(1234.567;1) returns "1,234.6"
km: FIXED (1234.567; 1) ត្រឡប់ "1,234.6"

source: FIXED(1234.567;1;FALSE) returns "1234.6"
km: FIXED (1234.567; 1; FALSE) ត្រឡប់ "1234.6"

source: FIXED(44.332) returns "44.33"
km: FIXED (44.332) ត្រឡប់ "44.33"

source: The JIS() function returns the full-width characters corresponding to the half-width argument.
km: មុខងារ JIS() ត្រឡប់តួអក្សរទទឹងពេញដែលត្រូវគ្នាទៅនឹងអាគុយម៉ង់ពាក់កណ្តាលទទឹង។

source: JIS(text)
km: JIS (អត្ថបទ)

source: Half-width characters
km: តួអក្សរពាក់កណ្តាលទទឹង

source: The LEFT() function returns a substring that contains the 'length' leftmost characters of the string. The whole string is returned if 'length' exceeds the length of the string. It is an error for the number of characters to be less than 0.
km: អនុគមន៍ LEFT() ត្រឡប់ខ្សែអក្សររងដែលមានតួអក្សរខាងឆ្វេងបំផុតនៃ 'ខ្សែអក្សរ' ។ ខ្សែអក្សរទាំងមូលត្រូវបានត្រឡប់មកវិញប្រសិនបើ 'ប្រវែង' លើសពីប្រវែងនៃខ្សែអក្សរ។ វាជាកំហុសមួយសម្រាប់ចំនួនតួអក្សរតិចជាង ០ ។

source: LEFT(text;length)
km: LEFT (អត្ថបទប្រវែង)

source: Number of characters
km: ចំនួនតួអក្សរ

source: LEFT("hello";2) returns "he"
km: LEFT ("hello"; ២) ត្រឡប់ "he"

source: LEFT("KSpread";10) returns "KSpread"
km: LEFT ("KSpread"; ១០) ត្រឡប់ "KSpread"

source: LEFT("KSpread") returns "K"
km: LEFT ("KSpread") ត្រឡប់ "K"

source: The LEFTB() function returns a substring that contains the 'length' leftmost characters of the string using byte positions. The whole string is returned if 'length' exceeds the length of the string. It is an error for the number of characters to be less than 0.
km: អនុគមន៍ LEFTB() ត្រឡប់ខ្សែអក្សររងដែលមានតួអក្សរខាងឆ្វេង 'ប្រវែង' នៃខ្សែអក្សរដោយប្រើទីតាំងបៃ។ ខ្សែអក្សរទាំងមូលត្រូវបានត្រឡប់មកវិញប្រសិនបើ 'ប្រវែង' លើសពីប្រវែងនៃខ្សែអក្សរ។ វាជាកំហុសមួយសម្រាប់ចំនួនតួអក្សរតិចជាង ០ ។

source: LEFTB(text;ByteLength)
km: LEFTB (អត្ថបទ; ប្រវែងបៃ)

source: Byte Length
km: ប្រវែងបៃ

source: The LEN() function returns the length of the string.
km: អនុគមន៍ LEN() ត្រឡប់ប្រវែងនៃខ្សែអក្សរ។

source: LEN(text)
km: LEN (អត្ថបទ)

source: LEN("hello") returns 5
km: LEN ("hello") ត្រឡប់ ៥

source: LEN("KSpread") returns 7
km: LEN ("KSpread") ត្រឡប់ 7

source: The LENB() function returns the length of the string using byte positions.
km: អនុគមន៍ LENB() ត្រឡប់ប្រវែងនៃខ្សែអក្សរដោយប្រើទីតាំងបៃ។

source: LENB(text)
km: LENB (អត្ថបទ)

source: The LOWER() function converts a string to lower case.
km: មុខងារ LOWER() បំលែងខ្សែអក្សរទៅជាអក្សរតូច។

source: LOWER(text)
km: LOWER (អត្ថបទ)

source: LOWER("hello") returns "hello"
km: LOWER ("hello") ត្រឡប់ "hello"

source: LOWER("HELLO") returns "hello"
km: LOWER ("HELLO") ត្រឡប់ "hello"

source: The MID() function returns a substring that contains 'length' characters of the string, starting at 'position' index.
km: មុខងារ MID() ត្រឡប់ខ្សែអក្សររងដែលមានតួអក្សរ 'ប្រវែង' នៃខ្សែអក្សរចាប់ផ្តើមនៅសន្ទស្សន៍ 'ទីតាំង' ។

source: MID(text;position;length)
km: MID (អត្ថបទទីតាំង; ប្រវែង)

source: Position
km: ទីតាំង

source: Length
km: ប្រវែង

source: MID("Calligra";2;3) returns "all"
km: MID ("Calligra"; ២; ៣) ត្រឡប់ "all"

source: MID("Calligra";2) returns "alligra"
km: MID ("Calligra"; ២) ត្រឡប់ "alligra"

source: The MIDB() function returns a substring that contains 'length' characters of the string, starting at 'position' index using byte positions.
km: មុខងារ MIDB() ត្រឡប់ខ្សែអក្សរដែលមានតួអក្សរ 'ប្រវែង' នៃខ្សែអក្សរចាប់ផ្តើមពីសន្ទស្សន៍ 'ទីតាំង' ដោយប្រើទីតាំងបៃ។

source: MIDB(text;BytePosition Start;ByteLength)
km: MIDB (អត្ថបទ; បៃធីងទីតាំងចាប់ផ្តើម; ប្រវែងបៃ)

source: Byte Position
km: ទីតាំងបៃ

source: The PROPER() function converts the first letter of each word to uppercase and the rest of the letters to lowercase.
km: មុខងារ PROPER() បំលែងអក្សរទីមួយនៃពាក្យនីមួយៗទៅជាអក្សរធំនិងអក្សរនៅសល់ជាអក្សរតូច។

source: PROPER(string)
km: PROPER (ខ្សែអក្សរ)

source: PROPER("this is a title") returns "This Is A Title"
km: PROPER ("this គឺជាចំណងជើង") ត្រឡប់ " នេះជាចំណងជើង Title"

source: Returns a part of the string that matches a regular expression. If the string does not match the given regular expression, value specified as default is returned.
km: ត្រឡប់ផ្នែកនៃខ្សែអក្សរដែលត្រូវនឹងកន្សោមធម្មតា។ ប្រសិនបើខ្សែអក្សរមិនផ្គូផ្គងនឹងកន្សោមធម្មតាដែលបានផ្តល់តម្លៃដែលបានបញ្ជាក់ជាលំនាំដើមត្រូវបានត្រឡប់។

source: If a back-reference is provided, then the value of that back-reference is returned.
km: ប្រសិនបើឯកសារយោងត្រឡប់មកវិញត្រូវបានផ្តល់បន្ទាប់មកតម្លៃនៃឯកសារយោងត្រឡប់មកវិញនោះត្រូវបានប្រគល់មកវិញ។

source: If no default value is given, an empty string is assumed. If no back-reference is given, 0 is assumed (so that entire matching part is returned).
km: ប្រសិនបើមិនផ្តល់តម្លៃលំនាំដើមខ្សែអក្សរទទេនឹងត្រូវបានសន្មត។ ប្រសិនបើគ្មានឯកសារយោងត្រឡប់មកវិញត្រូវបានគេសន្មត់ថា ០ (ដូច្នេះផ្នែកផ្គូផ្គងទាំងមូលត្រូវបានត្រឡប់) ។

source: REGEXP(text; regexp; default; backref)
km: REGEXP (អត្ថបទ; regexp; លំនាំដើម; backref)

source: Searched text
km: អត្ថបទស្វែងរក

source: Regular expression
km: កន្សោមធម្មតា

source: Default value (optional)
km: តម្លៃលំនាំដើម (ជាជម្រើស)

source: Back-reference (optional)
km: ឯកសារយោងត្រឡប់មកវិញ (ជាជំរើស)

source: REGEXP("Number is 15.";"[0-9]+") = "15"
km: REGEXP ("Number គឺ ១៥."; " [០-៩] + ") = "15"

source: REGEXP("15, 20, 26, 41";"([0-9]+), *[0-9]+$";"";1) = "26"
km: REGEXP ("15, ២០, ២៦, ៤១"; " ([០-៩] +), * [០-៩] + $"; ""; ១) = "26"26"26"26"26"26"26"26"26"26"26"26"26"26"26"26"26"26"26zxdb

source: Replaces all matches of a regular expression with the replacement text
km: ជំនួសការប្រកួតទាំងអស់នៃកន្សោមធម្មតាជាមួយអត្ថបទជំនួស

source: REGEXPRE(text; regexp; replacement)
km: REGEXPRE (អត្ថបទ; regexp; ការជំនួស)

source: Replacement
km: ការជំនួស

source: REGEXPRE("14 and 15 and 16";"[0-9]+";"num") returns "num and num and num"
km: REGEXPRE ("14 និង 15 និង 16"; " [0-9] + "; "num") ត្រឡប់ "num និងលេខនិង num"

source: The REPLACE() function replaces part of a text string with a different text string.
km: មុខងារ REPLACE() ជំនួសផ្នែកនៃខ្សែអក្សរដែលមានខ្សែអក្សរផ្សេង។

source: REPLACE(text;position;length;new_text)
km: REPLACE (អត្ថបទទីតាំង; ប្រវែង; អត្ថបទថ្មី)

source: Text which you want to replace some characters
km: អត្ថបទដែលអ្នកចង់ជំនួសតួអក្សរមួយចំនួន

source: Position of the characters to replace
km: ទីតាំងរបស់តួអង្គដើម្បីជំនួស

source: Number of characters to replace
km: ចំនួនតួអក្សរដែលត្រូវជំនួស

source: The text that will replace characters in old text
km: អត្ថបទដែលនឹងជំនួសតួអក្សរនៅក្នុងអត្ថបទចាស់

source: REPLACE("abcdefghijk";6;5;"-") returns "abcde-k"
km: REPLACE ("abcdefghijk"; ៦; ៥; "-") ត្រឡប់ "abcde-k"

source: REPLACE("2002";3;2;"03") returns "2003"
km: REPLACE ("2002"; 3; 2; "03") ត្រឡប់ "2003"

source: The REPLACEB() function replaces part of a text string with a different text string using byte positions.
km: មុខងារ REPLACEB() ជំនួសផ្នែកនៃខ្សែអក្សរដែលមានខ្សែអក្សរអត្ថបទខុសគ្នាដោយប្រើទីតាំងបៃ។

source: REPLACEB(text;BytePosition;ByteLength Len;new_text)
km: REPLACEB (អត្ថបទ; បៃធីងទីតាំង; បៃឡេតឡេនលេន; អត្ថបទថ្មី)

source: Text which you want to replace some characters using byte position
km: អត្ថបទដែលអ្នកចង់ជំនួសតួអក្សរមួយចំនួនដោយប្រើទីតាំងបៃ

source: Byte position of the characters to replace
km: ទីតាំងបៃនៃតួអក្សរដើម្បីជំនួស

source: The byte length of characters to replace
km: ប្រវែងបៃនៃតួអក្សរដើម្បីជំនួស

source: The REPT() function repeats the first parameter as many times as by the second parameter. The second parameter must not be negative, and this function will return an empty string if the second parameter is zero (or rounds down to zero).
km: មុខងារ REPT() ធ្វើឡើងវិញនូវប៉ារ៉ាម៉ែត្រទីមួយច្រើនដងដូចប៉ារ៉ាម៉ែត្រទី ២ ។ ប៉ារ៉ាម៉ែត្រទីពីរមិនត្រូវអវិជ្ជមានទេហើយមុខងារនេះនឹងត្រឡប់ខ្សែអក្សរទទេប្រសិនបើប៉ារ៉ាម៉ែត្រទីពីរគឺសូន្យ (ឬបង្គត់ចុះដល់សូន្យ) ។

source: REPT(text;count)
km: REPT (អត្ថបទ; រាប់)

source: Count of repetitions
km: ចំនួនពាក្យដដែលៗ

source: REPT("KSpread";3) returns "KSpreadKSpreadKSpread"
km: REPT ("KSpread"; 3) ត្រឡប់ "KS រីករាលដាលរីករាលដាលរីករាលដាល Zxdbquotxz

source: REPT("KSpread";0) returns ""
km: REPT ("KSpread"; 0) ត្រឡប់ ""

source: The RIGHT() function returns a substring that contains the 'length' rightmost characters of the string. The whole string is returned if 'length' exceeds the length of the string.
km: មុខងារ RIGHT() ត្រឡប់ខ្សែអក្សររងដែលមានតួអក្សរខាងស្តាំ 'ប្រវែង' នៃខ្សែអក្សរ។ ខ្សែអក្សរទាំងមូលត្រូវបានត្រឡប់មកវិញប្រសិនបើ 'ប្រវែង' លើសពីប្រវែងនៃខ្សែអក្សរ។

source: RIGHT(text;length)
km: RIGHT (អត្ថបទប្រវែង)

source: RIGHT("hello";2) returns "lo"
km: RIGHT ("hello"; 2) ត្រឡប់ "lo"

source: RIGHT("KSpread";10) returns "KSpread"
km: RIGHT ("KSpread"; 10) ត្រឡប់ "KSpread"

source: RIGHT("KSpread") returns "d"
km: RIGHT ("KSpread") ត្រឡប់ "d"

source: The RIGHTB() function returns a substring that contains the 'length' rightmost characters of the string using byte positions. The whole string is returned if 'length' exceeds the length of the string.
km: មុខងារ RIGHTB() ត្រឡប់ខ្សែអក្សររងដែលមានតួអក្សរខាងស្តាំ 'ប្រវែង' នៃខ្សែអក្សរដោយប្រើទីតាំងបៃ។ ខ្សែអក្សរទាំងមូលត្រូវបានត្រឡប់មកវិញប្រសិនបើ 'ប្រវែង' លើសពីប្រវែងនៃខ្សែអក្សរ។

source: RIGHTB(text;ByteLength)
km: RIGHTB (អត្ថបទ; ប្រវែងបៃ)

source: The ROT13() function encrypts text by replacing each letter with the one 13 places along in the alphabet. If the 13th position is beyond the letter Z, it begins again at A (rotation).
km: មុខងារ ROT13() អ៊ិនគ្រីបអត្ថបទដោយជំនួសអក្សរនីមួយៗជាមួយកន្លែង ១៣ តាមអក្ខរក្រម។ ប្រសិនបើទីតាំងទី 13 លើសពីអក្សរ Z វាចាប់ផ្តើមម្តងទៀតនៅអេ (ការបង្វិល) ។

source: By applying the encryption function again to the resulting text, you can decrypt the text.
km: ដោយអនុវត្តមុខងារអ៊ិនគ្រីបម្តងទៀតទៅអត្ថបទលទ្ធផលអ្នកអាចឌិគ្រីបអត្ថបទ។

source: ROT13(Text)
km: ROT13 (អត្ថបទ)

source: ROT13("KSpread") returns "XFcernq"
km: ROT13 ("KSpread") ត្រឡប់ "XFcernq"

source: ROT13("XFcernq") returns "KSpread"
km: ROT13 ("XFcernq") ត្រឡប់ "KSpread"

source: SEARCH
km: ស្វែងរក

source: The SEARCH() function finds one text string (find_text) within another text string (within_text) and returns the number of the starting point of find_text, from the leftmost character of within_text.
km: មុខងារ SEARCH() រកឃើញខ្សែអត្ថបទមួយ (findtext) នៅក្នុងខ្សែអក្សរអត្ថបទមួយផ្សេងទៀត (អត្ថបទ) ហើយត្រឡប់លេខនៃចំណុចចាប់ផ្តើមនៃអត្ថបទស្វែងរកពីតួអក្សរខាងឆ្វេងបំផុតនៃអត្ថបទ។
