Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: Finds a search value in a search region, and returns its position (starting from 1). Match type can be either -1, 0 or 1 and determines how is searched for the value. If match type is 0, the index of the first value that equals search value is returned. If match type is 1 (or omitted), the index of the first value that is less than or equal to the search value is returned and the values in the search region must be sorted in ascending order. If match type is -1, the smallest value that is greater than or equal to the search value is found, and the search region needs to be sorted in descending order.
km: ស្វែងរកតម្លៃស្វែងរកនៅក្នុងតំបន់ស្វែងរកហើយត្រឡប់មកទីតាំងវិញ (ចាប់ផ្តើមពីលេខ ១) ។ ប្រភេទនៃការប្រកួតអាចមានទាំង -1, 0 ឬ 1 និងកំណត់ពីរបៀបដែលត្រូវស្វែងរកតម្លៃ។ ប្រសិនបើប្រភេទនៃការប្រកួតគឺ ០ នោះសន្ទស្សន៍នៃតម្លៃទីមួយដែលស្មើនឹងតម្លៃស្វែងរកត្រូវបានប្រគល់មកវិញ។ ប្រសិនបើប្រភេទនៃការប្រកួតគឺ 1 (ឬត្រូវបានលុបចោល) សន្ទស្សន៍នៃតម្លៃដំបូងដែលតិចជាងឬស្មើនឹងតម្លៃស្វែងរកត្រូវបានត្រឡប់មកវិញហើយតម្លៃនៅក្នុងតំបន់ស្វែងរកត្រូវតែត្រូវបានតម្រៀបតាមលំដាប់ឡើង។ ប្រសិនបើប្រភេទនៃការប្រកួតគឺ -1 តម្លៃតូចបំផុតដែលធំជាងឬស្មើនឹងតម្លៃនៃការស្វែងរកត្រូវបានរកឃើញហើយតំបន់ស្វែងរកចាំបាច់ត្រូវតម្រៀបតាមលំដាប់ចុះ។

source: MATCH(Search value; Search region; Match type)
km: MATCH (តម្លៃស្វែងរក; តំបន់ស្វែងរក; ប្រភេទផ្គូផ្គង)

source: Search value
km: តម្លៃស្វែងរក

source: Search region
km: ស្វែងរកតំបន់

source: Reference/Array
km: ឯកសារយោង / អារេ

source: Match type (optional)
km: ប្រភេទការប្រកួត (ជាជម្រើស)

source: MULTIPLE.OPERATIONS executes the formula expression pointed to by FormulaCell and all formula expressions it depends on while replacing all references to RowCell with references to RowReplacement respectively all references to ColumnCell with references to ColumnReplacement. The function may be used to easily create tables of expressions that depend on two input parameters.
km: MULTIPLE.OPERATIONS ប្រតិបត្តិកន្សោមរូបមន្តដែលចង្អុលបង្ហាញដោយ FormulaCell និងកន្សោមរូបមន្តទាំងអស់វាអាស្រ័យលើខណៈពេលជំនួសឯកសារយោងទាំងអស់ទៅ RowCell ដោយយោងទៅលើ RowReplacement រៀងៗខ្លួនសេចក្តីយោងទាំងអស់ទៅ ColumnCell ដោយយោងតាម ColumnReplacement ។ មុខងារអាចត្រូវបានប្រើដើម្បីបង្កើតតារាងកន្សោមដែលពឹងផ្អែកលើប៉ារ៉ាម៉ែត្របញ្ចូលពីរ។

source: MULTIPLE.OPERATIONS(Formula cell; Row cell; Row replacement; Column cell; Column replacement)
km: MULTIPLE.OPERATIONS (ក្រឡារូបមន្ត; ក្រឡាជួរដេក; ការជំនួសជួរដេក; ក្រឡាជួរឈរ; ការជំនួសជួរឈរ)

source: Formula cell
km: កោសិការូបមន្ត

source: Row cell
km: ក្រឡាជួរដេក

source: Row replacement
km: ការជំនួសជួរដេក

source: Column cell (optional)
km: ក្រឡាជួរឈរ (ជាជម្រើស)

source: Column replacement (optional)
km: ការជំនួសជួរឈរ (ជាជម្រើស)

source: Modifies a reference's position and dimension.
km: កែប្រែទីតាំងនិងវិមាត្រយោង។

source: OFFSET(Reference reference; Integer rowOffset; Integer columnOffset; Integer newHeight; Integer newWidth)
km: OFFSET (សេចក្តីយោងសេចក្តីយោង; ជួរដេកជួរចាប់ផ្តើមនៃចំនួន; ជួរឈរចាប់ផ្តើមឡើងវិញចំនួនគត់; ចំនួនថ្មីខ្ពស់របស់គាត់; ចំនួនគត់ថ្មី) ។

source: Reference or range
km: សេចក្តីយោងឬជួរ

source: Number of rows to offset
km: ចំនួនជួរដើម្បីទូទាត់

source: Number of columns to offset
km: ចំនួនជួរឈរដើម្បីទូទាត់

source: Height of the offset range (optional)
km: កម្ពស់ជួរអុហ្វសិត (ស្រេចចិត្ត)

source: Width of the offset range (optional)
km: ទទឹងនៃជួរអុហ្វសិត (ស្រេចចិត្ត)

source: The ROW function returns the row of given cell reference. If no parameter is specified the row of the current cell gets returned.
km: អនុគមន៍ ROW ត្រឡប់ជួរនៃសេចក្ដីយោងក្រឡាដែលបានផ្ដល់។ ប្រសិនបើគ្មានប៉ារ៉ាម៉ែត្រត្រូវបានបញ្ជាក់ជួរដេកនៃក្រឡាបច្ចុប្បន្នត្រូវបានត្រឡប់មកវិញ។

source: ROW(reference)
km: ជួរដេក (ឯកសារយោង)

source: ROW(A1) returns 1
km: ROW (A1) ត្រឡប់ 1

source: ROW(D2) returns 2
km: ROW (D2) ត្រឡប់ 2

source: The ROWS function returns the number of rows in a reference.
km: អនុគមន៍ ROWS ត្រឡប់ចំនួនជួរដេកក្នុងសេចក្តីយោង។

source: ROWS(reference)
km: ROWS (យោង)

source: ROWS(A1:C3) returns 3
km: ROWS (A1: C3) ត្រឡប់ 3

source: ROWS(D2) returns 1
km: ROWS (D2) ត្រឡប់ 1

source: Returns the sheet number of the reference or the string representing a sheet name.
km: ត្រឡប់លេខសន្លឹកនៃសេចក្តីយោងឬខ្សែអក្សរដែលតំណាងឱ្យឈ្មោះសន្លឹក។

source: SHEET(reference)
km: SHEET (ឯកសារយោង)

source: SHEET(Sheet1!C7) returns 1
km: SHEET (សន្លឹក ១! ស៊ី ៧) ត្រឡប់ ១

source: SHEET(Sheet2!C7) returns 2
km: SHEET (សន្លឹក ២! ស៊ី .៧) ត្រឡប់ ២

source: Returns the number of sheets in a reference or current document.
km: ត្រឡប់ចំនួនសន្លឹកក្នុងឯកសារយោងឬឯកសារបច្ចុប្បន្ន។

source: SHEETS(reference)
km: SHEETS (ឯកសារយោង)

source: Look for a matching value in the first column of the given table, and return the value of the indicated column.
km: រកមើលតម្លៃដែលត្រូវគ្នានៅក្នុងជួរទីមួយនៃតារាងដែលបានផ្តល់ហើយត្រឡប់តម្លៃនៃជួរឈរដែលបានចង្អុលបង្ហាញ។

source: Looks up the 'lookup value' in the first column of the 'data source'. If a value matches, the value in the 'column' and the row, the value was found in, is returned. If 'sorted' is true (default), the first column is assumed to be sorted. The search will end, if the 'lookup value' is lower than the value, currently compared to.
km: រកមើល 'តម្លៃរកមើល' នៅក្នុងជួរឈរដំបូងនៃ 'ប្រភពទិន្នន័យ' ។ ប្រសិនបើតម្លៃត្រូវគ្នាតម្លៃនៅក្នុង 'ជួរឈរ' និងជួរដេកតម្លៃត្រូវបានរកឃើញនឹងត្រូវបានត្រឡប់មកវិញ។ ប្រសិនបើ 'តម្រៀប' ជាការពិត (លំនាំដើម) ជួរទីមួយត្រូវបានសន្មតថាត្រូវបានតម្រៀប។ ការស្វែងរកនឹងបញ្ចប់ប្រសិនបើ 'តម្លៃរកមើល' ទាបជាងតម្លៃបច្ចុប្បន្នបើប្រៀបធៀបទៅនឹង។

source: VLOOKUP(Lookup value; data source; Column; Sorted)
km: VLOOKUP (តម្លៃរកមើល; ប្រភពទិន្នន័យ; ជួរឈរ; តម្រៀប)

source: Math
km: គណិតវិទ្យា

source: The ABS() function returns the absolute value of the floating-point number x.
km: មុខងារ ABS() ត្រឡប់តម្លៃដាច់ខាតនៃលេខអណ្តែតទឹក x ។

source: A floating point value
km: តម្លៃចំណុចអណ្តែត

source: ABS(12.5) equals 12.5
km: ABS (១២.៥) ស្មើនឹង ១២.៥

source: ABS(-12.5) equals 12.5
km: ABS (-១២.៥) ស្មើនឹង ១២.៥

source: The CEIL() function rounds x up to the nearest integer which is greater than the input, returning that value as a double.
km: អនុគមន៍ CEIL() បង្គត់ x រហូតដល់ចំនួនគត់ជិតបំផុតដែលធំជាងការបញ្ចូលដោយត្រឡប់តម្លៃនោះជាទ្វេ។

source: An integer (like 0, -5, 14 )
km: ចំនួនគត់ (ដូចជា ០, ៥, ១៤)

source: CEIL(12.5) equals 13
km: CEIL (១២.៥) ស្មើ ១៣

source: CEIL(-12.5) equals -12
km: CEIL (-12.5) ស្មើនឹង -12

source: <link linkend="ROUNDUP">ROUNDUP</link>&nbsp;
km: <link linkend="ROUNDUP"> ROUNDUPV </link>&nbsp;

source: The CEILING() function rounds x up (away from zero) to the nearest multiple of Significance which is greater than the input. The default value for Significance is 1 (or -1 if the value is negative), which means rounding up to the nearest integer. If the Mode parameter is non-zero, the function rounds away from zero, instead of up towards the positive infinity.
km: អនុគមន៍ CEILING() បង្គត់ x ឡើង (ឆ្ងាយពីសូន្យ) ទៅពហុគុណជិតបំផុតនៃសំខាន់ដែលធំជាងការបញ្ចូល។ តម្លៃលំនាំដើមសម្រាប់សំខាន់គឺ ១ (ឬ -1 ប្រសិនបើតម្លៃអវិជ្ជមាន) ដែលមានន័យថាបង្គត់ដល់ចំនួនគត់ជិតបំផុត។ ប្រសិនបើប៉ារ៉ាម៉ែត្ររបៀបមិនមែនសូន្យមុខងារវិលជុំវិញសូន្យជំនួសឱ្យឆ្ពោះទៅរកភាពវិជ្ជមាន។

source: Significance (optional)
km: សំខាន់ (ជាជម្រើស)

source: Mode (optional)
km: របៀប (ស្រេចចិត្ត)

source: CEILING(12.5) equals 13
km: CEILING (១២.៥) ស្មើ ១៣

source: CEILING(6.43; 4) equals 8
km: CEILING (៦.៤៣; ៤) ស្មើ ៨

source: CEILING(-6.43; -4; 1) equals -8
km: CEILING (-៦.៤៣; -៤; ១) ស្មើនឹង -៨

source: CEILING(-6.43; -4; 0) equals -4
km: CEILING (-៦.៤៣; -៤; ០) ស្មើ -៤

source: This function returns the count of integer or floating arguments passed. You can count using a range: COUNT(A1:B5) or using a list of values like COUNT(12;5;12.5).
km: មុខងារនេះត្រឡប់ចំនួននៃចំនួនគត់ឬអាគុយម៉ង់អណ្តែតដែលបានអនុម័ត។ អ្នកអាចរាប់ដោយប្រើជួរ៖ COUNT (A1: B5) ឬប្រើបញ្ជីតម្លៃដូចជា COUNT (12; 5; 12.5) ។

source: COUNT(value;value;value...)
km: COUNT (តម្លៃ; តម្លៃ; តម្លៃ ... )

source: COUNT(-5;"KSpread";2) returns 2
km: COUNT (-5; "KSpread"; 2) ត្រឡប់ 2

source: COUNT(5) returns 1
km: COUNT (៥) ត្រឡប់ ១

source: This function returns the count of all non empty arguments passed. You can count using a range: COUNTA(A1:B5) or using a list of values like COUNTA(12;5;12.5).
km: មុខងារនេះត្រឡប់ការរាប់អាគុយម៉ង់មិនទទេទាំងអស់ដែលបានឆ្លងកាត់។ អ្នកអាចរាប់ដោយប្រើជួរ៖ COUNTA (A1: B5) ឬប្រើបញ្ជីតម្លៃដូចជា COUNTA (១២, ៥, ១២.៥) ។

source: COUNTA(value;value;value...)
km: COUNTA (តម្លៃ; តម្លៃ; តម្លៃ ... )

source: COUNTA(-5;"KSpread";2) returns 3
km: COUNTA (-5; "KSpread"; ២) ត្រឡប់ ៣

source: COUNTA(5) returns 1
km: COUNTA (៥) ត្រឡប់ ១

source: This function returns the count of all empty cells within the range.
km: អនុគមន៍នេះត្រឡប់ការរាប់ក្រឡាទទេទាំងអស់ក្នុងជួរ។

source: COUNTBLANK(range)
km: COUNTBLANK (ជួរ)

source: Cell range
km: ជួរក្រឡា

source: Range
km: ជួរ

source: The COUNTIF() function returns the number of cells in the given range that meet the given criteria.
km: អនុគមន៍ COUNTIF() ត្រឡប់ចំនួនក្រឡាក្នុងជួរដែលបានផ្តល់ដែលត្រូវនឹងលក្ខណៈវិនិច្ឆ័យដែលបានផ្តល់។

source: COUNTIF(range;criteria)
km: COUNTIF (ជួរ; លក្ខណៈវិនិច្ឆ័យ)

source: A range of floating point values (like 1.3, 0.343, 253 )
km: តម្លៃនៃចំណុចអណ្តែត (ដូចជា ១.៣, ០៣៤៣, ២៥៣)

source: Criteria
km: លក្ខណៈវិនិច្ឆ័យ

source: COUNTIF(A2:A3;"14") returns 1 if A2 is -4 and A3 is 14
km: COUNTIF (A2: A3; "14") ត្រឡប់ 1 ប្រសិនបើ A2 គឺ -4 និង A3 គឺ 14

source: The CUR() function returns the non-negative cube root of x.
km: មុខងារ CUR() ត្រឡប់ឫសគូបមិនអវិជ្ជមាននៃ x ។

source: CUR(27) equals 3
km: CUR (២៧) ស្មើ ៣

source: The DIV() function divides the first value by the other values in turn.
km: មុខងារឌីវី() បែងចែកតម្លៃទីមួយដោយតម្លៃផ្សេងទៀតនៅក្នុងវេន។

source: DIV(value;value;...)
km: DIV (តម្លៃ; តម្លៃ; ... )

source: DIV(20;2;2) returns 5
km: DIV (២០; ២; ២) ត្រឡប់ ៥

source: DIV(25;2.5) returns 10
km: DIV (២៥; ២,៥) ត្រឡប់ ១០

source: EPS() returns the machine epsilon; this is the difference between 1 and the next largest floating-point number. Because computers use a finite number of digits, roundoff error is inherent (but usually insignificant) in all calculations.
km: EPS() ត្រឡប់ម៉ាស៊ីន epsilon; នេះគឺជាភាពខុសគ្នារវាងលេខ ១ និងលេខចំណុចអណ្តែតធំបំផុតបន្ទាប់។ ដោយសារតែកុំព្យួទ័រប្រើចំនួនខ្ទង់ខ្ទង់តួលេខកំហុសជុំគឺមិនមាននៅក្នុង (ប៉ុន្តែជាទូទៅមិនសូវសំខាន់) នៅក្នុងការគណនាទាំងអស់។

source: On most systems, this returns 2^-52=2.2204460492503131e-16
km: នៅលើប្រព័ន្ធភាគច្រើនការត្រឡប់មកវិញនេះ 2 ^ -៥២ = 2.2204460492503131e-16

source: 0.5*EPS() returns the "unit round"; this value is interesting because it is the largest number x where (1+x)-1=0 (due to roundoff errors).
km: 0.5 * EPS() ត្រឡប់ "unit round"; តម្លៃនេះគួរអោយចាប់អារម្មណ៍ព្រោះវាជាលេខធំបំផុត x ដែល (1 + x) -1 = 0 (ដោយសារកំហុសជុំ) ។

source: EPS() is so small that &sheets; displays 1+eps() as 1
km: EPS() គឺតូចណាស់ដែលសន្លឹក; បង្ហាញ ១ + eps() ជា ១

source: Pick a number x between 0 and EPS(). Observe that 1+x rounds x to either 0 or EPS() by using the equation (1+x)-1
km: ជ្រើសរើសលេខមួយនៅចន្លោះ ០ និង EPS() ។ សង្កេតមើលថា ១ + x ជុំ x ដល់ ០ ឬ EPS() ដោយប្រើសមីការ (១ + x) -1

source: The EVEN() function returns the number rounded up to the nearest even integer.
km: មុខងារ EVEN() ត្រឡប់លេខដែលបានបង្គត់ទៅចំនួនគត់ជិតបំផុត។

source: EVEN(value)
km: EVEN (តម្លៃ)

source: EVEN(1.2) returns 2
km: EVEN (1.2) ត្រឡប់ 2

source: EVEN(2) returns 2
km: EVEN (2) ត្រឡប់ 2

source: The EXP() function returns the value of e (the base of natural logarithms) raised to the power of x.
km: អនុគមន៍ EXP() ត្រឡប់តម្លៃនៃអ៊ី (មូលដ្ឋាននៃលោការីតធម្មជាតិ) ដែលបានលើកឡើងជាស្វ័យគុណនៃ x ។

source: EXP(9) equals 8 103.08392758
km: EXP (៩) ស្មើនឹង ៨ ១០៣.០៨៣៩២៧៥៨

source: EXP(-9) equals 0.00012341
km: EXP (-9) ស្មើនឹង 0.00012341

source: The FACT() function calculates the factorial of the parameter. The mathematical expression is (value)!.
km: មុខងារ FACT() គណនាហ្វាក់តូរីយ្យែលនៃប៉ារ៉ាម៉ែត្រ។ កន្សោមគណិតវិទ្យាគឺ (តម្លៃ)! ។

source: FACT(number)
km: FACT (ចំនួន)

source: FACT(10) returns 3628800
km: FACT (១០) ត្រឡប់ ៣៦២៨៨០០

source: FACT(0) returns 1
km: FACT (០) ត្រឡប់ ១

source: The FACTDOUBLE() function calculates the double factorial of a number, i.e. x!!.
km: អនុគមន៍ FACTDOUBLE() គណនាហ្វាក់តូរីយ្យែលទ្វេនៃលេខឧទាហរណ៍ x !! ។

source: FACTDOUBLE(number)
km: FACTDOUBLE (ចំនួន)

source: FACTDOUBLE(6) returns 48
km: FACTDOUBLE (៦) ត្រឡប់ ៤៨

source: FACTDOUBLE(7) returns 105
km: FACTDOUBLE (៧) ត្រឡប់ ១០៥

source: Function FIB calculates the Nth term of a Fibonacci sequence (1, 1, 2, 3, 5, 8, 13, 21...), in which each number, after the first two, is the sum of the two numbers immediately preceding it. FIB(0) is defined to be 0.
km: មុខងារ FIB គណនាពាក្យទី N នៃលំដាប់ Fibonacci (១, ១, ២, ៣, ៥, ៨, ១៣, ២១ …) ដែលក្នុងនោះលេខនីមួយៗបន្ទាប់ពីពីរដំបូងគឺផលបូកនៃលេខទាំងពីរមុនភ្លាមៗ វា។ FIB (0) ត្រូវបានកំណត់ជាលេខ ០ ។

source: Nth term
km: ពាក្យទី N

source: FIB(9) returns 34
km: FIB (៩) ត្រឡប់ ៣៤

source: FIB(26) returns 121393
km: FIB (26) ត្រឡប់ 121393

source: Round a number x down to the nearest multiple of the second parameter, Significance.
km: បង្គត់លេខ x ចុះទៅពហុគុណជិតបំផុតនៃប៉ារ៉ាម៉ែត្រទីពីរគឺសំខាន់។

source: The FLOOR() function rounds x down (towards zero) to the nearest multiple of Significance which is smaller than the input. The default value for Significance is 1, if x is positive. It is -1, if the value is negative, which means rounding up to the nearest integer. If mode is given and not equal to zero, the amount of x is rounded toward zero to a multiple of significance and then the sign applied. Otherwise, it rounds toward negative infinity. If any of the two parameters x or Significance is zero, the result is zero.
km: មុខងារ FLOOR() មូល x ចុះ (ឆ្ពោះទៅសូន្យ) ទៅពហុគុណជិតបំផុតនៃសំខាន់ដែលតូចជាងការបញ្ចូល។ តម្លៃលំនាំដើមសម្រាប់សំខាន់គឺ ១ ប្រសិនបើ x វិជ្ជមាន។ វាគឺ -១ ប្រសិនបើតម្លៃអវិជ្ជមានដែលមានន័យថាបង្គត់ដល់ចំនួនគត់ជិតបំផុត។ ប្រសិនបើរបៀបត្រូវបានផ្តល់និងមិនស្មើនឹងសូន្យចំនួន x ត្រូវបានបង្គត់ឆ្ពោះទៅសូន្យទៅពហុគុណនៃសារៈសំខាន់ហើយបន្ទាប់មកសញ្ញានេះត្រូវបានអនុវត្ត។ បើមិនដូច្នោះទេវាមូលឆ្ពោះទៅរកភាពគ្មានទីបញ្ចប់អវិជ្ជមាន។ ប្រសិនបើក្នុងចំណោមប៉ារ៉ាម៉ែត្រទាំងពីរ x ឬសារៈសំខាន់គឺសូន្យលទ្ធផលគឺសូន្យ។

source: FLOOR(12.5) equals 12
km: FLOOR (១២.៥) ស្មើ ១២

source: FLOOR(-12.5) equals -13
km: FLOOR (-12.5) ស្មើ -13

source: FLOOR(5; 2) equals 4
km: FLOOR (៥; ២) ស្មើ ៤

source: FLOOR(5; 2.2) equals 4.4
km: FLOOR (5; 2.2) ស្មើនឹង 4.4

source: The GAMMA() function returns the gamma function value.
km: អនុគមន៍ GAMMA() ត្រឡប់តម្លៃអនុគមន៍ហ្គាម៉ា។

source: GAMMA(value)
km: GAMMA (តម្លៃ)

source: GAMMA(1) returns 1
km: GAMMA (១) ត្រឡប់ ១

source: The GCD() function returns the greatest common denominator for two or more integer values.
km: អនុគមន៍ GCD() ត្រឡប់ភាគបែងធំបំផុតសម្រាប់តម្លៃចំនួនគត់ពីរឬច្រើន។

source: GCD(value; value)
km: GCD (តម្លៃ; តម្លៃ)

source: A range of whole numbers (like 1, 132, 2344)
km: ជួរនៃលេខទាំងមូល (ដូចជាលេខ ១, ១៣២, ២៣៤៤)

source: Third number
km: លេខទីបី

source: GCD(6;4) returns 2
km: GCD (6; 4) ត្រឡប់ 2

source: GCD(10;20) returns 10
km: GCD (10; 20) ត្រឡប់ 10

source: GCD(20;15;10) returns 5
km: GCD (២០; ១៥; ១០) ត្រឡប់ ៥

source: The G_PRODUCT() function is the same as KPRODUCT. It is provided for Gnumeric compatibility.
km: មុខងារ GPRODUCT() គឺដូចគ្នានឹង KPRODUCT ដែរ។ វាត្រូវបានផ្តល់ជូនសម្រាប់ភាពឆបគ្នារបស់ Gnumeric ។

source: G_PRODUCT(value;value;...)
km: GPRODUCT (តម្លៃ; តម្លៃ; ... )

source: The INT() function returns the integer part of the value.
km: មុខងារ INT() ត្រឡប់ផ្នែកចំនួនគត់នៃតម្លៃ។

source: INT(12.55) equals 12
km: INT (១២.៥៥) ស្មើនឹង ១២

source: INT(15) equals 15
km: INT (១៥) ស្មើនឹង ១៥

source: This function multiplies each value by -1.
km: មុខងារនេះគុណតម្លៃនីមួយៗដោយ -1 ។

source: INV(value)
km: INV (តម្លៃ)

source: INV(-5) equals 5
km: INV (-៥) ស្មើ ៥

source: INV(5) equals -5
km: INV (៥) ស្មើនឹង -៥

source: INV(0) equals 0
km: INV (០) ស្មើ ០

source: The KPRODUCT() function calculates the product of all the values given as parameters. You can calculate the product of a range: KPRODUCT(A1:B5) or a list of values like KPRODUCT(12;5;12.5). If no numeric values are found 1 is returned.
km: មុខងារ KPRODUCT() គណនាផលិតផលនៃតម្លៃទាំងអស់ដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រ។ អ្នកអាចគណនាផលិតផលនៃជួរមួយ: KPRODUCT (A1: B5) ឬបញ្ជីតម្លៃដូចជា KPRODUCT (12; 5; 12.5) ។ ប្រសិនបើរកមិនឃើញតម្លៃលេខទេលេខ 1 ត្រូវបានត្រឡប់។

source: KPRODUCT(value;value;...)
km: KPRODUCT (តម្លៃ; តម្លៃ; ... )

source: KPRODUCT(3;5;7) equals 105
km: KPRODUCT (៣; ៥; ៧) ស្មើនឹង ១០៥

source: KPRODUCT(12.5;2) equals 25
km: KPRODUCT (១២.៥; ២) ស្មើ ២៥

source: The LCM() function returns the least common multiple for two or more float values
km: អនុគមន៍ LCM() ត្រឡប់ពហុគុណទូទៅតិចបំផុតសម្រាប់តម្លៃអណ្តែតពីរឬច្រើន

source: LCM(value; value)
km: LCM (តម្លៃ; តម្លៃ)

source: LCM(6;4) returns 12
km: LCM (៦; ៤) ត្រឡប់ ១២

source: LCM(1.5;2.25) returns 4.5
km: LCM (1.5; 2.25) ត្រឡប់ 4.5

source: LCM(2;3;4) returns 12
km: LCM (២; ៣; ៤) ត្រឡប់ ១២

source: The LN() function returns the natural logarithm of x.
km: អនុគមន៍ LN() ត្រឡប់លោការីតធម្មជាតិនៃ x ។

source: LN(0.8) equals -0.22314355
km: LN (០.៨) ស្មើនឹង -២០២២៣១៤៣៥៥

source: LN(0) equals -inf
km: LN (០) ស្មើ -inf

source: The LOG() function returns the base-10 logarithm of x.
km: អនុគមន៍ LOG() ត្រឡប់លោការីតទី ១០ នៃ x ។

source: A floating point value, greater than zero
km: តម្លៃចំណុចអណ្តែតធំជាងសូន្យ

source: LOG(0.8) equals -0.09691001
km: LOG (0,8) ស្មើ -0.09691001

source: LOG(0) is an error.
km: LOG (0) គឺជាកំហុស។

source: The LOG10() function returns the base-10 logarithm of the argument.
km: អនុគមន៍ LOG10() ត្រឡប់លោការីតគោល ១០ នៃអាគុយម៉ង់។

source: A positive floating point value
km: តម្លៃចំណុចអណ្តែតវិជ្ជមាន

source: LOG10(10) equals 1.
km: LOG10 (១០) ស្មើ ១ ។

source: LOG10(0) is an error.
km: LOG10 (0) គឺជាកំហុស។

source: The LOG2() function returns the base-2 logarithm of x.
km: អនុគមន៍ LOG2() ត្រឡប់លោការីតទី ២ នៃ x ។

source: LOG2(0.8) equals -0.32192809
km: LOG2 (០.៨) ស្មើ -០.៣២១៩២៨០៩

source: LOG2(0) equals -inf.
km: LOG2 (0) ស្មើ -inf ។

source: The LOGn() function returns the base n logarithm of x.
km: អនុគមន៍ LOGn() ត្រឡប់មូលដ្ឋានលោការីតនៃ x ។

source: LOGn(value;base)
km: LOGn (តម្លៃ; មូលដ្ឋាន)

source: LOGn(12;10) equals 1.07918125
km: LOGn (12; 10) ស្មើនឹង 1.07918125

source: LOGn(12;2) equals 3.5849625
km: LOGn (១២; ២) ស្មើ ៣.៥៨៤៩៦២៥

source: The MAX() function returns the largest value given in the parameters. String and logical values are ignored.
km: មុខងារ MAX() ត្រឡប់តម្លៃធំបំផុតដែលបានផ្តល់នៅក្នុងប៉ារ៉ាម៉ែត្រ។ តម្លៃខ្សែអក្សរនិងឡូជីខលត្រូវបានគេមិនអើពើ។

source: MAX(value;value;...)
km: MAX (តម្លៃ; តម្លៃ; ... )

source: MAX(12;5; 7) returns 12
km: MAX (១២; ៥; ៧) ត្រឡប់ ១២

source: MAX(12.5; 2) returns 12.5
km: MAX (១២.៥; ២) ត្រឡប់ ១២.៥

source: MAX(0.5; 0.4; TRUE; 0.2) returns 0.5
km: MAX (0.5; 0.4; TRUE; 0.2) ត្រឡប់ 0,5

source: <link linkend="MINA">MINA</link>&nbsp;
km: <link linkend="MINA"> មីន </link>&nbsp;

source: The MAXA() function returns the largest value given in the parameters. TRUE evaluates to 1, FALSE evaluates to 0. String values are ignored.
km: មុខងារ MAXA() ត្រឡប់តម្លៃធំបំផុតដែលបានផ្តល់នៅក្នុងប៉ារ៉ាម៉ែត្រ។ TRUE វាយតម្លៃទៅ ១, FALSE វាយតំលៃ ០។ តម្លៃខ្សែអក្សរត្រូវបានមិនអើពើ។

source: MAXA(value;value;...)
km: MAXA (តម្លៃ; តម្លៃ; ... )

source: MAXA(12;5; 7) returns 12
km: MAXA (១២; ៥; ៧) ត្រឡប់ ១២

source: MAXA(12.5; 2) returns 12.5
km: MAXA (១២.៥; ២) ត្រឡប់ ១២.៥

source: MAXA(0.5; 0.4; TRUE; 0.2) returns 1
km: MAXA (0.5; 0.4; TRUE; 0.2) ត្រឡប់ 1

source: Function MDETERM returns the determinant of a given matrix. The matrix must be of type n x n.
km: អនុគមន៍ MDETERM ត្រឡប់កត្តាកំណត់ម៉ាទ្រីសដែលបានផ្តល់។ ម៉ាទ្រីសត្រូវតែមានប្រភេទ nx n ។

source: MDETERM(matrix)
km: MDETERM (ម៉ាទ្រីស)

source: The MIN() function returns the smallest value given in the parameters. String and logical values are ignored.
km: អនុគមន៍ MIN() ត្រឡប់តម្លៃតូចបំផុតដែលបានផ្ដល់ក្នុងប៉ារ៉ាម៉ែត្រ។ តម្លៃខ្សែអក្សរនិងឡូជីខលត្រូវបានគេមិនអើពើ។

source: MIN(value;value;...)
km: MIN (តម្លៃ; តម្លៃ; ... )

source: MIN(12;5; 7) returns 5
km: MIN (១២; ៥; ៧) ត្រឡប់ ៥

source: MIN(12.5; 2) returns 2
km: MIN (១២.៥; ២) ត្រឡប់ ២

source: MIN(0.4; 2; FALSE; 0.7) returns 0.4
km: MIN (០.៤; ២; FALSE; ០.៧) ត្រឡប់ ០.៤

source: The MINA() function returns the smallest value given in the parameters. TRUE evaluates to 1, FALSE to 0. String values are ignored.
km: មុខងារ MINA() ត្រឡប់តម្លៃតូចបំផុតដែលបានផ្តល់នៅក្នុងប៉ារ៉ាម៉ែត្រ។ TRUE វាយតម្លៃទៅ ១, FALSE ទៅ ០។ តម្លៃខ្សែអក្សរត្រូវបានមិនអើពើ។

source: MINA(value;value;...)
km: MINA (តម្លៃ; តម្លៃ; ... )

source: MINA(12;5; 7) returns 5
km: MINA (១២; ៥; ៧) ត្រឡប់ ៥

source: MINA(12.5; 2) returns 2
km: MINA (១២.៥; ២) ត្រឡប់ ២

source: MINA(0.4; 2; FALSE; 0.7) returns 0.
km: MINA (០,៤; ២; FALSE; ០.៧) ត្រឡប់ ០ ។

source: Calculates the inverse of the matrix.
km: គណនាបញ្ច្រាសម៉ាទ្រីស។

source: The matrix multiplied with its inverse results in the unity matrix of the same dimension.
km: ម៉ាទ្រីសគុណនឹងលទ្ធផលច្រាសរបស់វានៅក្នុងម៉ាទ្រីសឯកភាពនៃវិមាត្រដូចគ្នា។

source: Invertible matrices have a non-zero determinant.
km: ម៉ាទ្រីសបញ្ច្រាសមានកត្តាកំណត់មិនមែនសូន្យ។

source: MINVERSE(matrix)
km: MINVERSE (ម៉ាទ្រីស)

source: Matrix
km: ម៉ាទ្រីស

source: <link linkend="MUNIT">MUNIT</link>&nbsp;
km: <link linkend="MUNIT"> ម៉ាន់នីត </link>&nbsp;

source: Function MMULT multiplies two matrices. Number of columns of the first matrix must be the same as row count of the second one. The result is a matrix.
km: អនុគមន៍ MMULT គុណនឹងពីរ។ ចំនួនជួរឈរនៃម៉ាទ្រីសទីមួយត្រូវតែដូចគ្នានឹងចំនួនជួរដេកនៃជួរទីពីរដែរ។ លទ្ធផលគឺជាម៉ាទ្រីស។

source: MMULT(matrix1;matrix2)
km: MMULT (ម៉ាទ្រីស ១; ម៉ាទ្រីស ២)

source: First matrix
km: ម៉ាទ្រីសដំបូង

source: Second matrix
km: ម៉ាទ្រីសទីពីរ

source: The MOD() function returns the remainder after division. If the second parameter is null the function returns #DIV/0.
km: មុខងារ MOD() ត្រឡប់នៅសល់បន្ទាប់ពីការបែងចែក។ ប្រសិនបើប៉ារ៉ាម៉ែត្រទី ២ គឺទុកជាមោឃៈអនុគមន៍នឹងត្រឡប់ #DIV/0។

source: MOD(value;value)
km: MOD (តម្លៃ; តម្លៃ)

source: MOD(12;5) returns 2
km: MOD (12; 5) ត្រឡប់ 2

source: MOD(5;5) returns 0
km: MOD (5; 5) ត្រឡប់ 0

source: The MROUND() function returns the value rounded to the specified multiple. The value and the multiple must have the same sign
km: អនុគមន៍ MROUND() ត្រឡប់តម្លៃបង្គត់ទៅពហុគុណដែលបានបញ្ជាក់។ តម្លៃនិងពហុគុណត្រូវតែមានសញ្ញាដូចគ្នា

source: MROUND(value; multiple)
km: MROUND (តម្លៃ; ច្រើន)

source: Multiple
km: ច្រើន

source: MROUND(1.252; 0.5) equals 1.5
km: MROUND (១.២៥២; ០,៥) ស្មើនឹង ១.៥

source: MROUND(-1.252; -0.5) equals -1.5
km: MROUND (-1.252; -0.5) ស្មើនឹង -1.5

source: The MULTINOMIAL() function returns the multinomial of each number in the parameters. It uses this formula for MULTINOMIAL(a,b,c):
km: មុខងារ MULTINOMIAL() ត្រឡប់ពហុគុណនៃលេខនីមួយៗក្នុងប៉ារ៉ាម៉ែត្រ។ វាប្រើរូបមន្តនេះសម្រាប់មុខជំនាញ (a, b, c)៖

source: (a+b+c)! / a!b!c!
km: (a + b + គ)! / a! b! c!

source: MULTINOMIAL(value;value;...)
km: MULTINOMIAL (តម្លៃ; តម្លៃ; ... )

source: MULTINOMIAL(3;4;5) equals 27720
km: MULTINOMIAL (៣; ៤; ៥) ស្មើ ២៧៧២០

source: The MULTIPLY() function multiplies all the values given in the parameters. You can multiply values given by a range MULTIPLY(A1:B5) or a list of values like MULTIPLY(12;5;12.5). It's equivalent to PRODUCT.
km: មុខងារ MULTIPLY() គុណតម្លៃទាំងអស់ដែលបានផ្តល់នៅក្នុងប៉ារ៉ាម៉ែត្រ។ អ្នកអាចគុណតម្លៃដែលបានផ្តល់ឱ្យដោយជួរ MULTIPLY (A1: B5) ឬបញ្ជីតម្លៃដូចជា MULTIPLY (12; 5; 12.5) ។ វាស្មើនឹងផលិតផល PRODUCT ។

source: MULTIPLY(value;value;...)
km: MULTIPLY (តម្លៃ; តម្លៃ; ... )

source: MULTIPLY(12;5;7) equals 420
km: MULTIPLY (១២; ៥; ៧) ស្មើ ៤២០

source: MULTIPLY(12.5;2) equals 25
km: MULTIPLY (១២.៥; ២) ស្មើ ២៥

source: Creates the unity matrix of the given dimension.
km: បង្កើតម៉ាទ្រីសឯកភាពនៃវិមាត្រដែលបានផ្តល់ឱ្យ។

source: MUNIT(dimension)
km: MUNIT (វិមាត្រ)

source: Dimension
km: វិមាត្រ

source: MUNIT(3) creates a 3x3 unity matrix
km: MUNIT (៣) បង្កើតម៉ាទ្រីសសាមគ្គី ៣x៣
