Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: The function DAYSINMONTH() returns the number of days in the given year and month.
km: មុខងារ DAYSINMONTH() ត្រឡប់ចំនួនថ្ងៃក្នុងឆ្នាំនិងខែដែលបានផ្តល់។

source: DAYSINMONTH(year;month)
km: DAYSINMONTH (ឆ្នាំ; ខែ)

source: DAYSINMONTH(2000;2) returns 29
km: DAYSINMONTH (២០០០; ២) ត្រឡប់ ២៩

source: The function DAYSINYEAR() returns the number of days in the given year.
km: អនុគមន៍ DAYSINYEAR() ត្រឡប់ចំនួនថ្ងៃក្នុងឆ្នាំដែលបានផ្តល់។

source: DAYSINYEAR(year)
km: DAYSINYEAR (ឆ្នាំ)

source: DAYSINYEAR(2000) returns 366
km: DAYSINYEAR (២០០០) ត្រឡប់ ៣៦៦

source: The EASTERSUNDAY() function returns the date which corresponds to Easter Sunday in the year given as the parameter.
km: អនុគមន៍ EASTERSUNDAY() ត្រឡប់កាលបរិច្ឆេទដែលត្រូវនឹងបុណ្យអ៊ីស្ទើរថ្ងៃអាទិត្យក្នុងឆ្នាំដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រ។

source: EASTERSUNDAY(year)
km: EASTERSUNDAY (ឆ្នាំ)

source: EASTERSUNDAY(2003) returns "20th April 2003"
km: EASTERSUNDAY (២០០៣) ត្រឡប់ "20 ថ្ងៃទី ២០០ មេសា ២០០៣"

source: The EDATE functions returns the date that is specified by a given date and a number of months before or after that date.
km: មុខងារ EDATE ត្រឡប់កាលបរិច្ឆេទដែលត្រូវបានបញ្ជាក់តាមកាលបរិច្ឆេទដែលបានផ្តល់និងចំនួនខែមុនឬក្រោយកាលបរិច្ឆេទនោះ។

source: EDATE(date; months)
km: EDATE (កាលបរិច្ឆេទខែខែ)

source: Months
km: ខែ

source: EDATE("2/22/2002"; 3) returns "5/22/2002"
km: EDATE ("2 / 22 / 2002"; 3) ត្រឡប់ "5 / 22 / 2002"

source: EDATE("3/31/2002"; -1) returns "2/28/2002"
km: EDATE ("3 / 31 / 2002"; -1) ត្រឡប់ "2 / 28 / 2002"

source: The EOMONTH functions returns the last day in the month specified by a date and the number of months from that date.
km: អនុគមន៍ EOMONTH ត្រឡប់ថ្ងៃចុងក្រោយក្នុងខែដែលបានបញ្ជាក់តាមកាលបរិច្ឆេទនិងចំនួនខែចាប់ពីកាលបរិច្ឆេទនោះ។

source: EOMONTH(date; months)
km: EOMONTH (កាលបរិច្ឆេទខែខែ)

source: EOMONTH("2/22/2002"; 3) returns "5/31/2002"
km: EOMONTH ("2 / 22 / 2002"; 3) ត្រឡប់ "5 / 31 / 2002"

source: EOMONTH("3/12/2002"; -1) returns "2/28/2002"
km: EOMONTH ("3 / 12 / 2002"; -1) ត្រឡប់ "2 / 28 / 2002"

source: EOMONTH("3/12/2002"; 0) returns "3/31/2002"
km: EOMONTH ("3 / 12 / 2002"; 0) ត្រឡប់ "3 / 31 / 2002"

source: The HOUR functions returns the hour of a time. If no parameter is specified the current hour gets returned.
km: មុខងារ HOUR ត្រឡប់ម៉ោងនៃពេលវេលា។ ប្រសិនបើគ្មានប៉ារ៉ាម៉ែត្រត្រូវបានបញ្ជាក់ម៉ោងបច្ចុប្បន្ននឹងត្រូវបានត្រឡប់មកវិញ។

source: HOUR(time)
km: HOUR (ពេលវេលា)

source: Time
km: ពេលវេលា

source: HOUR("22:10:12") returns 22
km: HOUR ("22: ១០: ១២") ត្រឡប់ ២២

source: HOUR(0.1285) returns 3
km: HOUR (0.1285) ត្រឡប់ 3

source: The HOURS() function returns the value of the hours in a time expression.
km: អនុគមន៍ HOURS() ត្រឡប់តម្លៃម៉ោងក្នុងកន្សោមពេលវេលា។

source: HOURS(time)
km: HOURS (ពេលវេលា)

source: HOURS("10:5:2") returns 10
km: HOURS ("10: 5: 2") ត្រឡប់ ១០

source: The function ISLEAPYEAR() returns True if the given year is leap.
km: អនុគមន៍ ISLEAPYEAR() ត្រឡប់ពិតប្រសិនបើឆ្នាំដែលបានផ្តល់ឱ្យត្រូវបានបង្គ្រប់។

source: ISLEAPYEAR(year)
km: ISLEAPYEAR (ឆ្នាំ)

source: ISLEAPYEAR(2000) returns True
km: ISLEAPYEAR (២០០០) ត្រឡប់ពិត

source: The ISOWEEKNUM() function returns number of the week which the date falls into. Note that this function is compliant with the ISO8601 standard: a week always begins on a Monday, and ends on a Sunday. The first week of a year is that week which contains the first Thursday of the year.
km: អនុគមន៍ ISOWEEKNUM() ត្រឡប់ចំនួនសប្តាហ៍ដែលកាលបរិច្ឆេទធ្លាក់ចូល។ ចំណាំថាមុខងារនេះអនុលោមតាមស្តង់ដារ ISO8601: មួយសប្តាហ៍តែងតែចាប់ផ្តើមនៅថ្ងៃច័ន្ទនិងបញ្ចប់នៅថ្ងៃអាទិត្យ។ សប្តាហ៍ដំបូងនៃឆ្នាំគឺជាសប្តាហ៍ដែលមានថ្ងៃព្រហស្បតិ៍ដំបូងនៃឆ្នាំ។

source: ISOWEEKNUM(date)
km: ISOWEEKNUM (កាលបរិច្ឆេទ)

source: ISOWEEKNUM(A1) returns 51 when A1 is "21st of Dec".
km: ISOWEEKNUM (A1) ត្រឡប់មកវិញ 51 នៅពេលដែល A1 គឺ "21st នៃ Dec" ។

source: The MINUTE functions returns the minutes of a time. If no parameter is specified the current minute is returned.
km: មុខងារ MINUTE ត្រឡប់នាទីនៃពេលវេលា។ ប្រសិនបើគ្មានប៉ារ៉ាម៉ែត្រត្រូវបានបញ្ជាក់នាទីបច្ចុប្បន្នត្រូវបានត្រឡប់មកវិញ។

source: MINUTE(time)
km: MINUTE (ពេលវេលា)

source: MINUTE("22:10:12") returns 10
km: MINUTE ("22: ១០: ១២") ត្រឡប់ ១០

source: MINUTE(0.1234) returns 57
km: MINUTE (0.1234) ត្រឡប់ 57

source: The MINUTES() function returns the value of the minutes in a time expression.
km: អនុគមន៍ MINUTES() ត្រឡប់តម្លៃនាទីក្នុងកន្សោមពេលវេលា។

source: MINUTES(time)
km: MINUTES (ពេលវេលា)

source: MINUTES("10:5:2") returns 5
km: MINUTES ("10: 5: 2") ត្រឡប់ ៥

source: The MONTH functions returns the month of a date. If no parameter is specified the current month gets returned.
km: មុខងារ MONTH ត្រឡប់ខែនៃកាលបរិច្ឆេទ។ ប្រសិនបើគ្មានប៉ារ៉ាម៉ែត្រត្រូវបានបញ្ជាក់ខែបច្ចុប្បន្នត្រូវបានត្រឡប់មកវិញ។

source: MONTH(date)
km: MONTH (កាលបរិច្ឆេទ)

source: MONTH("2/22/2002") returns 2
km: MONTH ("2 / 22 / 2002") ត្រឡប់ 2

source: MONTH(2323.1285) returns 5
km: MONTH (២៣២៣.១២៨៥) ត្រឡប់ ៥

source: The MONTHNAME() function returns the name of the month (1...12).
km: មុខងារ MONTHNAME() ត្រឡប់ឈ្មោះខែ (១ ... ១២) ។

source: MONTHNAME(number)
km: MONTHNAME (ចំនួន)

source: Number of month (1..12)
km: ចំនួនខែ (1..12)

source: MONTHNAME(5) returns May
km: MONTHNAME (៥) ត្រឡប់មកឧសភា

source: The MONTHS() function returns the difference between two dates in months.The third parameter indicates the calculation mode: if the mode is 0, MONTHS() returns the maximal possible number of months between those days. If the mode is 1, it only returns the number of complete months in between.
km: អនុគមន៍ MONTHS() ត្រឡប់ភាពខុសគ្នារវាងកាលបរិច្ឆេទពីរក្នុងខែ។ ប្រសិនបើរបៀបគឺ ១ នោះវានឹងបញ្ជូនតែចំនួនខែពេញលេញរវាង។

source: MONTHS(date2; date1; mode)
km: MONTHS (កាលបរិច្ឆេទ ២; កាលបរិច្ឆេទ ១; របៀប)

source: Calculation mode
km: របៀបគណនា

source: MONTHS("2002-01-18"; "2002-02-26"; 0) returns 1, because there is 1 month and 8 days in between
km: MONTHS ("2002-01-18"; "2002-02-26"; 0) ត្រឡប់ 1 ពីព្រោះមានចន្លោះពី 1 ខែនិង 8 ថ្ងៃ

source: MONTHS("2002-01-19"; "2002-02-26"; 1) returns 0, because there is not a whole month in between, starting at the first day of the month
km: MONTHS ("2002-01-19"; "2002-02-26"; 1) ត្រឡប់ 0 ពីព្រោះមិនមានរយៈពេលមួយខែនៅចន្លោះពេលចាប់ផ្តើមពីថ្ងៃដំបូងនៃខែ

source: The NETWORKDAY() function returns the number of working days between startdate and enddate.
km: មុខងារ NETWORKDAY() ត្រឡប់ចំនួនថ្ងៃធ្វើការរវាងថ្ងៃចាប់ផ្តើមនិងថ្ងៃបញ្ចប់។

source: Holidays must be one of the following: number = days to add, a single date or an array of dates.
km: ថ្ងៃឈប់សម្រាកត្រូវតែមានដូចខាងក្រោមៈលេខ = ថ្ងៃត្រូវបន្ថែមកាលបរិច្ឆេទតែមួយឬជួរកាលបរិច្ឆេទ។

source: NETWORKDAY(start date; end date; holidays)
km: NETWORKDAY (កាលបរិច្ឆេទចាប់ផ្តើម, កាលបរិច្ឆេទបញ្ចប់, ថ្ងៃឈប់សម្រាក)

source: Start date
km: ថ្ងៃ​ចាប់ផ្តើម

source: End date
km: កាលបរិច្ឆេទបញ្ចប់

source: Holidays
km: ថ្ងៃឈប់សម្រាក

source: NETWORKDAY("01/01/2001";"01/08/2001") returns 5 workdays
km: NETWORKDAY ("01 / 01 / 2001"; "01 / 08 / 2001") ត្រឡប់ថ្ងៃធ្វើការ 5 ថ្ងៃ

source: NETWORKDAY("01/01/2001";"01/08/2001";2) returns 3 workdays
km: NETWORKDAY ("01 / 01 / 2001"; "01 / 08 / 2001"; 2) ត្រឡប់ 3 ថ្ងៃធ្វើការ

source: The NOW() function returns the current date and time. It is identical with CURRENTDATETIME and provided for compatibility with other applications.
km: មុខងារ NOW() ត្រឡប់កាលបរិច្ឆេទនិងពេលវេលាបច្ចុប្បន្ន។ វាគឺដូចគ្នាបេះបិទនឹង CURRENTDATETIME និងផ្តល់សម្រាប់ភាពឆបគ្នាជាមួយកម្មវិធីផ្សេងទៀត។

source: NOW() returns "Saturday 13 April 2002 19:12:01"
km: NOW() ត្រឡប់ " ថ្ងៃសៅរ៍ទី ១៣ ខែមេសាឆ្នាំ ២០០២ ម៉ោង ១៩: ១២: ០១"

source: The SECOND functions returns the seconds of a time. If no parameter is specified the current second is returned.
km: មុខងារ SECOND ត្រឡប់វិនាទីនៃពេលវេលា។ ប្រសិនបើគ្មានប៉ារ៉ាម៉ែត្រត្រូវបានបញ្ជាក់ទេវិនាទីបច្ចុប្បន្នត្រូវបានត្រឡប់មកវិញ។

source: SECOND(time)
km: SECONDS(ម៉ោង)

source: SECOND("22:10:12") returns 12
km: SECOND ("22: ១០: ១២") ត្រឡប់ ១២

source: SECOND(0.1234) returns 42
km: SECOND (0.1234) ត្រឡប់ 42

source: The SECONDS() function returns the value of the seconds in a time expression.
km: អនុគមន៍ SECONDS() ត្រឡប់តម្លៃវិនាទីក្នុងកន្សោមពេលវេលា។

source: SECONDS(time)
km: វិនាទី (ពេលវេលា)

source: SECONDS("10:5:2") returns 2
km: វិនាទី ("10: 5: 2") ត្រឡប់ 2

source: The TIME() function returns the time formatted with local parameters.
km: មុខងារ TIME() ត្រឡប់ពេលវេលាដែលបានធ្វើទ្រង់ទ្រាយជាមួយប៉ារ៉ាម៉ែត្រមូលដ្ឋាន។

source: TIME(hours;minutes;seconds)
km: TIME (ម៉ោងនាទីនាទី; វិនាទី)

source: TIME(10;2;2) returns 10:02:02
km: TIME (10; 2; 2) ត្រឡប់ 10:02:02

source: TIME(10;70;0) returns 11:10:0
km: TIME (10; 70; 0) ត្រឡប់ 11: 10: 0

source: TIME(10;-40;0) returns 9:20:0
km: TIME (10; -40; 0) ត្រឡប់ 9: 20: 0

source: The TIMEVALUE() function returns a number (between 0 and 1) representing the time of day.
km: អនុគមន៍ TIMEVALUE() ត្រឡប់លេខ (រវាង ០ និង ១) ដែលតំណាង ឲ្យ ពេលវេលានៃថ្ងៃ។

source: TIMEVALUE(time)
km: TIMEVALUE (ពេលវេលា)

source: TIMEVALUE("10:05:02") returns 0.42
km: TIMEVALUE ("10: 05: 02") ត្រឡប់ 0,42

source: The TODAY() function returns the current date.
km: អនុគមន៍ TODAY() ត្រឡប់កាលបរិច្ឆេទបច្ចុប្បន្ន។

source: TODAY() returns "Saturday 13 April 2002"
km: TODAY() ត្រឡប់ " ថ្ងៃសៅរ៍ទី ១៣ ខែមេសាឆ្នាំ ២០០២"

source: UNIX2DATE() function converts unix time to a date and time value.
km: UNIX2DATE() បម្លែងពេលវេលាយូនីកទៅតម្លៃកាលបរិច្ឆេទនិងពេលវេលា។

source: UNIX2DATE(unixtime)
km: UNIX2DATE (ម៉ោង unix)

source: UNIX2DATE(0) returns 1970-01-01
km: UNIX2DATE (០) ត្រឡប់ ១៩៧០-០១-០១

source: The WEEKDAY() function returns the weekday of given date. If the method is 1 (default) WEEKDAY() returns 1 for sunday, 2 for monday,.. If the method is 2, monday is 1, tuesday 2, ... and if the method is 3 WEEKDAY() returns 0 for monday, 1 for tuesday,...
km: អនុគមន៍ WEEKDAY() ត្រឡប់ថ្ងៃធ្វើការនៃកាលបរិច្ឆេទដែលបានផ្ដល់។ ប្រសិនបើវិធីសាស្រ្តគឺ ១ (លំនាំដើម) WEEKDAY() ត្រឡប់ ១ សំរាប់ថ្ងៃអាទិត្យ, ២ សំរាប់ថ្ងៃច័ន្ទ, .. ប្រសិនបើវិធីសាស្ត្រគឺ ២, ថ្ងៃច័ន្ទគឺ ១, ថ្ងៃអង្គារ ២, …ហើយប្រសិនបើវិធីសាស្ត្រគឺ ៣ ចុងសប្តាហ៍() ត្រឡប់ ០ សំរាប់ ថ្ងៃច័ន្ទ ១ ថ្ងៃអង្គារ, …

source: WEEKDAY(date; method)
km: WEEKDAY (កាលបរិច្ឆេទ; វិធីសាស្ត្រ)

source: Method (optional)
km: វិធីសាស្រ្ត (ស្រេចចិត្ត)

source: WEEKDAY("2002-02-22"; 2) returns 5
km: WEEKDAY ("2002-02-22"; 2) ត្រឡប់ 5

source: The WEEKNUM() function returns the non-ISO week number in which the date falls into.
km: អនុគមន៍ WEEKNUM() ត្រឡប់លេខសប្តាហ៍មិនមែនអាយអេសអូដែលកាលបរិច្ឆេទបានធ្លាក់។

source: WEEKNUM(date; method)
km: WEEKNUM (កាលបរិច្ឆេទ; វិធីសាស្ត្រ)

source: WEEKNUM(A1; 1) returns 11 when A1 is "9th of March 2008". Number of the week in the year, with a week beginning on Sunday (1, this is the default if Method is omitted.)
km: WEEKNUM (A1; 1) ត្រឡប់ 11 នៅពេល A1 គឺ "9 នៃខែមីនា 2008" ។ ចំនួនសប្តាហ៍ក្នុងមួយឆ្នាំដោយមួយសប្តាហ៍នឹងចាប់ផ្តើមនៅថ្ងៃអាទិត្យ (១ នេះជាលំនាំដើមប្រសិនបើវិធីត្រូវបានលុបចោល។ )

source: WEEKNUM(A1; 2) returns 10 when A1 is "9th of March 2008". Number of the week in the year, with a week beginning on Monday (2)
km: WEEKNUM (A1; 2) ត្រឡប់ 10 នៅពេល A1 គឺ "9 នៃខែមីនា 2008" ។ ចំនួនសប្តាហ៍ក្នុងមួយឆ្នាំដោយសប្តាហ៍ចាប់ផ្តើមនៅថ្ងៃច័ន្ទ (២)

source: The WEEKS() function returns the difference between two dates in weeks.The third parameter indicates the calculation mode: if the mode is 0, WEEKS() returns the maximal possible number of weeks between those days. If the mode is 1, it only returns the number of whole weeks in between.
km: អនុគមន៍ WEEKS() ត្រឡប់ភាពខុសគ្នារវាងកាលបរិច្ឆេទពីរក្នុងសប្តាហ៍។ ប៉ារ៉ាម៉ែត្រទីបីបង្ហាញពីរបៀបគណនា៖ ប្រសិនបើរបៀបគឺ ០, WEEKS() ត្រឡប់ចំនួនសប្តាហ៍អតិបរមាដែលអាចមានរវាងថ្ងៃទាំងនោះ។ ប្រសិនបើរបៀបគឺ 1 វានឹងត្រឡប់ចំនួនសប្តាហ៍ទាំងមូលនៅចន្លោះពេល។

source: WEEKS(date2; date1; mode)
km: សប្ដាហ៍ (កាលបរិច្ឆេទ ២; កាលបរិច្ឆេទ ១; របៀប)

source: WEEKS("2002-02-18"; "2002-02-26"; 0) returns 1, because there is one week and 1 day in between
km: WEEKS ("2002-02-18"; "2002-02-26"; 0) ត្រឡប់ 1 ពីព្រោះមានចន្លោះពេលមួយសប្តាហ៍និង 1 ថ្ងៃ

source: WEEKS("2002-19-02"; "2002-19-02"; 1) returns 0, because there is not a whole week in between, starting at the first day of the week (monday or sunday, depending on your local settings)
km: WEEKS ("2002-19-02"; "2002-19-02"; 1) ត្រឡប់ 0 ពីព្រោះមិនមានមួយសប្តាហ៍នៅចន្លោះពេលចាប់ផ្តើមពីថ្ងៃដំបូងនៃសប្ដាហ៍ (ថ្ងៃច័ន្ទឬថ្ងៃអាទិត្យអាស្រ័យលើការកំណត់មូលដ្ឋានរបស់អ្នក)

source: The function WEEKSINYEAR() returns the number of weeks in the given year.
km: មុខងារ WEEKSINYEAR() ត្រឡប់ចំនួនសប្តាហ៍ក្នុងឆ្នាំដែលបានផ្តល់។

source: WEEKSINYEAR(year)
km: WEEKSINYEAR (ឆ្នាំ)

source: WEEKSINYEAR(2000) returns 52
km: WEEKSINYEAR (២០០០) ត្រឡប់ ៥២

source: The WORKDAY() function returns the date which is working days from the start date.
km: អនុគមន៍ WORKDAY() ត្រឡប់កាលបរិច្ឆេទដែលជាថ្ងៃធ្វើការចាប់ពីថ្ងៃចាប់ផ្តើម។

source: WORKDAY(start date; days; holidays)
km: WORKDAY (កាលបរិច្ឆេទចាប់ផ្តើមថ្ងៃថ្ងៃឈប់សម្រាក)

source: Working days
km: ថ្ងៃ​ធ្វើការ

source: if B9 is "01/01/2001", D3 is "01/03/2001", D4 is "01/04/2001" then WORKDAY(B9;2;D3:D4) returns "Fri Jan 5 2001"
km: ប្រសិនបើ B9 គឺ "01 / 01 / 2001", D3 គឺ "01 / 03 / 2001", D4 គឺ "01 / 04 / 2001" បន្ទាប់មក WORKDAY (B9; 2; D3: D4) ត្រឡប់ zxdbquotz

source: The YEAR functions returns the year of a date. If no parameter is specified the current year gets returned.
km: មុខងារ YEAR ត្រឡប់ឆ្នាំនៃកាលបរិច្ឆេទ។ ប្រសិនបើគ្មានប៉ារ៉ាម៉ែត្រត្រូវបានបញ្ជាក់ឆ្នាំបច្ចុប្បន្នត្រូវបានត្រឡប់មកវិញ។

source: YEAR(date)
km: YEAR (កាលបរិច្ឆេទ)

source: YEAR("2/22/2002") returns 2002
km: YEAR ("2 / 22 / 2002") ត្រឡប់ឆ្នាំ ២០០២

source: YEAR(2323.1285) returns 1906
km: YEAR (២៣២៣.១២៨៥) ត្រឡប់ ១៩០៦

source: The YEARFRAC() function returns the number of full days between start date and end date according to the basis.
km: អនុគមន៍ YEARFRAC() ត្រឡប់ចំនួនថ្ងៃពេញរវាងកាលបរិច្ឆេទចាប់ផ្តើមនិងកាលបរិច្ឆេទបញ្ចប់យោងទៅតាមមូលដ្ឋាន។

source: Basis must be one of the following: 0 = 30/360 US, 1 = Actual/actual, 2 = Actual/360, 3 = Actual/365, 4 = European 30/360
km: មូលដ្ឋានត្រូវតែជាចំណុចមួយក្នុងចំណោមចំណុចដូចខាងក្រោមៈ ០ = ៣០/៣៦០ អាមេរិក ១ = ជាក់ស្តែង / ជាក់ស្តែង ២ = ជាក់ស្តែង / ៣៦០, ៣ = ជាក់ស្តែង / ៣៦៥, ៤ = អឺរ៉ុប ៣០/៣៦០

source: YEARFRAC(start date; end date; basis)
km: YEARFRAC (កាលបរិច្ឆេទចាប់ផ្តើម; កាលបរិច្ឆេទបញ្ចប់; មូលដ្ឋាន)

source: The YEARS() function returns the difference between two dates in years. The third parameter indicates the calculation mode: if the mode is 0, YEARS() returns the maximal possible number of years between those days. If the mode is 1, it only returns whole years, starting at the 1st Jan and ending on the 31st Dec.
km: មុខងារ YEARS() ត្រឡប់ភាពខុសគ្នារវាងកាលបរិច្ឆេទពីរក្នុងឆ្នាំ។ ប៉ារ៉ាម៉ែត្រទីបីចង្អុលបង្ហាញរបៀបគណនា: ប្រសិនបើរបៀបគឺ 0, YEARS() ត្រឡប់ចំនួនឆ្នាំអតិបរិមាដែលអាចទៅរួចរវាងថ្ងៃទាំងនោះ។ ប្រសិនបើរបៀបគឺ 1 វានឹងវិលត្រឡប់ពេញមួយឆ្នាំដោយចាប់ផ្តើមពីថ្ងៃទី 1 ខែមករានិងបញ្ចប់នៅថ្ងៃទី 31 ខែធ្នូ។

source: YEARS(date2; date1; mode)
km: YEARS (កាលបរិច្ឆេទ ២; កាលបរិច្ឆេទ ១; របៀប)

source: YEARS("2001-02-19"; "2002-02-26"; 0) returns 1, because there is one year and 7 days in between
km: YEARS ("2001-02-19"; "2002-02-26"; 0) ត្រឡប់ 1 ពីព្រោះមានចន្លោះពេលមួយឆ្នាំនិង 7 ថ្ងៃ

source: YEARS("2002-02-19"; "2002-02-26"; 1) returns 0, because there is not a whole year in between, starting at the first day of the year
km: YEARS ("2002-02-19"; "2002-02-26"; 1) ត្រឡប់ 0 ពីព្រោះមិនមានរយៈពេលពេញមួយឆ្នាំរវាងចាប់ផ្តើមនៅថ្ងៃដំបូងនៃឆ្នាំ

source: Engineering
km: វិស្វកម្ម

source: The BASE() function converts a number from base-10 to a string value in a target base from 2 to 36.
km: មុខងារ BASE() បំលែងលេខពីគោល ១០ ទៅតម្លៃខ្សែនៅក្នុងមូលដ្ឋានគោលដៅពី ២ ដល់ ៣៦ ។

source: BASE(number;base;prec)
km: BASE (ចំនួន; មូលដ្ឋាន; ជាក់លាក់)

source: Base
km: មូលដ្ឋាន

source: MinLength
km: ប្រវែងអប្បបរមា

source: BASE(128;8) returns "200"
km: BASE (128; 8) ត្រឡប់ "200"

source: The BESSELI() function returns the modified Bessel function In(x).
km: មុខងារ BESSELI() ត្រឡប់អនុគមន៍ Bessel ដែលបានកែប្រែនៅក្នុង (x) ។

source: Where the function is evaluated
km: កន្លែងដែលមុខងារត្រូវបានវាយតម្លៃ

source: Order of the function
km: លំដាប់នៃមុខងារ

source: BESSELI(0.7;3) returns 0.007367374
km: BESSELI (០.៧; ៣) ត្រឡប់ ០.០០៧៣៦៧៣៧៤

source: The BESSELJ() function returns the Bessel function.
km: មុខងារ BESSELJ() ត្រឡប់មុខងារ Bessel ។

source: BESSELJ(0.89;3) returns 0.013974004
km: BESSELJ (០.៨៩; ៣) ត្រឡប់ ០.០១៣៩៧៤០០៤

source: The BESSELK() function returns the modified Bessel function, which is equivalent to the Bessel function evaluated for purely imaginary arguments.
km: មុខងារ BESSELK() ត្រឡប់មុខងារ Bessel ដែលបានកែប្រែដែលស្មើនឹងមុខងាររបស់ Bessel ដែលត្រូវបានវាយតម្លៃសម្រាប់អាគុយម៉ង់ស្រមើលស្រមៃសុទ្ធសាធ។

source: BESSELK(3;9) returns 397.95880
km: BESSELK (3; 9) ត្រឡប់ 397.95880

source: BESSELY
km: សមហេតុផល

source: The BESSELY() function returns the Bessel function, which is also called the Weber function or the Neumann function.
km: មុខងារ BESSELY() ត្រឡប់មុខងារ Bessel ដែលត្រូវបានគេហៅថាមុខងារ Weber ឬមុខងារ Neumann ។

source: BESSELY(X;N)
km: ធនធាន (X; អិន)

source: BESSELY(4;2) equals 0.215903595
km: BESSELY (4; 2) ស្មើនឹង 0.215903595

source: The BIN2DEC() function returns the value formatted as a decimal number.
km: មុខងារ BIN2DEC() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលដប់។

source: BIN2DEC(value)
km: BIN2DEC (តម្លៃ)

source: The value to convert
km: តម្លៃដើម្បីបម្លែង

source: BIN2DEC("1010") returns 10
km: BIN2DEC ("1010") ត្រឡប់ ១០

source: BIN2DEC("11111") returns 31
km: BIN2DEC ("11111") ត្រឡប់ 31

source: The BIN2HEX() function returns the value formatted as a hexadecimal number.
km: អនុគមន៍ BIN2HEX() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលដប់ប្រាំមួយ។

source: BIN2HEX(value)
km: BIN2HEX (តម្លៃ)

source: The minimum length of the output
km: ប្រវែងអប្បបរមានៃលទ្ធផល

source: BIN2HEX("1010") returns "a"
km: BIN2HEX ("1010") ត្រឡប់ "a"

source: BIN2HEX("11111") returns "1f"
km: BIN2HEX ("11111") ត្រឡប់ "1f"

source: The BIN2OCT() function returns the value formatted as an octal number.
km: អនុគមន៍ BIN2OCT() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលប្រាំបី។

source: BIN2OCT(value)
km: BIN2OCT (តម្លៃ)

source: BIN2OCT("1010") returns "12"
km: BIN2OCT ("1010") ត្រឡប់ "12"

source: BIN2OCT("11111") returns "37"
km: BIN2OCT ("11111") ត្រឡប់ "37"

source: The COMPLEX(real;imag) returns a complex number of form x+yi.
km: COMPLEX (រូបភាពពិត) ត្រឡប់ចំនួនកុំផ្លិចនៃទម្រង់ x + yi ។

source: COMPLEX(real;imag)
km: COMPLEX (រូបភាពពិត)

source: Real coefficient
km: មេគុណពិតប្រាកដ

source: Imaginary coefficient
km: មេគុណស្រមើលស្រមៃ

source: COMPLEX(1.2;3.4) returns "1.2+3.4i"
km: COMPLEX (1.2; 3.4) ត្រឡប់ "1.2 + 3.4i"

source: COMPLEX(0;-1) returns "-i"
km: COMPLEX (0; -1) ត្រឡប់ "-i"

source: The CONVERT() function returns a conversion from one measurement system to another.
km: មុខងារ CONVERT() ត្រឡប់ការបំលែងពីប្រព័ន្ធវាស់មួយទៅប្រព័ន្ធមួយទៀត។

source: Supported mass units: g (gram), sg (pieces), lbm (pound), u (atomic mass), ozm (ounce), stone, ton, grain, pweight (pennyweight), hweight (hundredweight).
km: គ្រឿងម៉ាស់ដែលបានគាំទ្រ: g (ក្រាម), sg (បំណែក), lbm (ផោន), u (ម៉ាស់អាតូម) ozm (អោន), ថ្ម, តោន, គ្រាប់ធញ្ញជាតិ, pweight (ទម្ងន់ស្រាល), hweight (រយផោន) ។

source: Supported distance units: m (meter), in (inch), ft (feet), mi (mile), Nmi (nautical mile), ang (Angstrom), parsec, lightyear.
km: ឯកតាចម្ងាយដែលបានគាំទ្រ: m (ម៉ែត្រ), (អ៊ីញ), in (ហ្វីត), mi (ម៉ាយ), Nmi (ម៉ាយល៍), ang (អាងហែលទឹក), parsec, lightyear។

source: Supported pressure units: Pa (Pascal), atm (atmosphere), mmHg (mm of Mercury), psi, Torr.
km: ឯកតាសម្ពាធដែលបានគាំទ្រ: Pa (ប៉ាស្កាល់), atm (បរិយាកាស) mmHg (mm នៃ បារត), psi, Torr។

source: Supported force units: N (Newton), dyn, pound.
km: ខ្នាតកម្លាំងគាំទ្រ: N (ញូតុន) ឌីដុន, ផោន។

source: Supported energy units: J (Joule), e (erg), c (Thermodynamic calorie), cal (IT calorie), eV (electronvolt), HPh (Horsepower-hour), Wh (Watt-hour), flb (foot-pound), BTU.
km: ផ្នែកថាមពលដែលគាំទ្រ៖ J (Joule), e (erg), c (កម្តៅកាឡូរី), cal (កាឡូរីអាយធី) eV (អេឡិចត្រុងអេឡិចត្រុង) HPh (កម្លាំងសេះម៉ោង), Wh (វ៉ាត់ម៉ោង), flb (ផោន - ផោន), BTU។

source: Supported power units: W (Watt), HP (horsepower), PS (Pferdestaerke).
km: អង្គភាពថាមពលដែលគាំទ្រ: W (វ៉ាត់), HP (កម្លាំងសេះ), PS (Pferdestaerke) ។

source: Supported magnetism units: T (Tesla), ga (Gauss).
km: ឯកតាម៉ាញេទិកដែលគាំទ្រ: T (Tesla), ga (Gauss) ។

source: Supported temperature units: C (Celsius), F (Fahrenheit), K (Kelvin).
km: ឯកតាសីតុណ្ហភាពដែលគាំទ្រ: C (អង្សាសេ), F (ហ្វារិនហៃ), K (ខេលវិន) ។

source: Supported volume units: l (liter), tsp (teaspoon), tbs (tablespoon), oz (ounce liquid), cup, pt (pint), qt (quart), gal (gallon), barrel, m3 (cubic meter), mi3 (cubic mile), Nmi3 (cubic Nautical mile), in3 (cubic inch), ft3 (cubic foot), yd3 (cubic yard), GRT or regton (gross register ton).
km: ផ្នែកបរិមាណដែលគាំទ្រ៖ l (លីត្រ) ,tsp (ស្លាបព្រាកាហ្វេ), tbs (ស្លាបព្រា), oz (រាវអោន), cup, pt (ភីត), qt (បួន), gal (ហ្គាឡុង), barrel, m3 (ម៉ែត្រគូប) ។ mi3 (ម៉ាយល៍គូប), Nmi3 (ម៉ាយធីតគូប), in3 (អ៊ីញគូប), ft3 (ហ្វីតគូប), yd3 (គូប), GRT រឺ regton (តោនចុះឈ្មោះសរុប) ។

source: Supported area units: m2 (square meter), mi2 (square mile), Nmi2 (square Nautical mile), in2 (square inch), ft2 (square foot), yd2 (square yard), acre, ha (hectare).
km: ឯកតាតំបន់ដែលគាំទ្រ៖ m2 (ម៉ែត្រការ៉េ), mi2 (ម៉ាយការ៉េ), Nmi2 (ម៉ាយល៍ការ៉េ), in2 (អ៊ីញការ៉េ), ft2 (ហ្វីតការ៉េ), yd2 (ទីធ្លាការ៉េ), ha (ហិកតា) ។

source: Supported speed units: m/s (meters per second), m/h (meters per hour), mph (miles per hour), kn (knot).
km: ឯកតាល្បឿនដែលបានគាំទ្រ: m/s (ម៉ែត្រក្នុងមួយវិនាទី), m/h (ម៉ែត្រក្នុងមួយម៉ោង), mph (ម៉ាយក្នុងមួយម៉ោង), kn (knot) ។

source: For metric units any of the following prefixes can be used: E (exa, 1E+18), P (peta, 1E+15), T (tera, 1E+12), G (giga, 1E+09), M (mega, 1E+06), k (kilo, 1E+03), h (hecto, 1E+02), e (dekao, 1E+01), d (deci, 1E-01), c (centi, 1E-02), m (milli, 1E-03), u (micro, 1E-06), n (nano, 1E-09), p (pico, 1E-12), f (femto, 1E-15), a (atto, 1E-18).
km: សម្រាប់ឯកតាម៉ែត្រណាមួយនៃបុព្វបទដូចខាងក្រោមអាចត្រូវបានប្រើ: អ៊ី (exa, 1E + 18), P (peta, 1E + 15), T (tera, 1E + 12), G (giga, 1E + 09), M ( មេហ្គា, ១ អ៊ី + ០៦), k (គីឡូ, ១ អ៊ី + ០៣), h (ហិកតា, ១ អ៊ី + ០២), e (ឌីកាកូ, ១ អ៊ី + ០១), d (ឌី, ១ អ៊ី - ០១), c (សេអ៊ី, ១ អ៊ី -២២ ), m (មីលី, ១ អ៊ី -៣៣), u (មីក្រូ, ១ អ៊ី -៦៦), n (ណាណូ, ១ អ៊ី -៩៩), p (ភីកូ, ១ អ៊ី -១២), f (femto, ១E-១៥), a(atto , 1E-18) ។

source: CONVERT(Number; From Unit; To Unit)
km: CONVERT (ចំនួនពីខ្នាតមួយទៅខ្នាតមួយទៀត)

source: From unit
km: ពីឯកតា

source: To unit
km: ទៅឯកតា

source: CONVERT(32;"C";"F") equals 89.6
km: CONVERT (32; "C"; "F") ស្មើនឹង ៨៩.៦

source: CONVERT(3;"lbm";"kg") equals 1.3608
km: CONVERT (៣; "lbm"; "kg") ស្មើនឹង ១.៣៦០៨

source: CONVERT(7.9;"cal";"J") equals 33.0757
km: CONVERT (៧.៩; "cal"; "J") ស្មើនឹង ៣៣.០៧៥៧

source: The DEC2BIN() function returns the value formatted as a binary number.
km: អនុគមន៍ DEC2BIN() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលពីរ។

source: DEC2BIN(value)
km: DEC2BIN (តម្លៃ)

source: DEC2BIN(12) returns "1100"
km: DEC2BIN (12) ត្រឡប់ "1100"

source: DEC2BIN(55) returns "110111"
km: DEC2BIN (55) ត្រឡប់ "110111"

source: The DEC2HEX() function returns the value formatted as a hexadecimal number.
km: អនុគមន៍ DEC2HEX() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលដប់ប្រាំមួយ។

source: DEC2HEX(value)
km: DEC2HEX (តម្លៃ)

source: DEC2HEX(12) returns "c"
km: DEC2HEX (12) ត្រឡប់ "c"

source: DEC2HEX(55) returns "37"
km: DEC2HEX (55) ត្រឡប់ "37"

source: The DEC2OCT() function returns the value formatted as an octal number.
km: អនុគមន៍ DEC2OCT() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលប្រាំបី។

source: DEC2OCT(value)
km: DEC2OCT (តម្លៃ)

source: DEC2OCT(12) returns "14"
km: DEC2OCT (12) ត្រឡប់ "14"

source: DEC2OCT(55) returns "67"
km: DEC2OCT (55) ត្រឡប់ "67"

source: The DELTA() function returns 1 if x equals y, otherwise returns 0. y defaults to 0.
km: អនុគមន៍ DELTA() ត្រឡប់ 1 ប្រសិនបើ x ស្មើ y បើមិនដូច្នេះទេនឹងត្រឡប់ 0. y លំនាំដើមទៅ 0 ។

source: Floating point value
km: តម្លៃចំណុចអណ្តែត

source: DELTA(1.2; 3.4) returns 0
km: DELTA (1.2; 3.4) ត្រឡប់ 0
