Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: You can use wildcard characters, question mark (?) and asterisk (*). A question mark matches any single character, an asterisk matches any sequences of characters.
km: អ្នកអាចប្រើតួអក្សរជំនួសសញ្ញាសួរ (?) និងសញ្ញាផ្កាយ (*) ។ សញ្ញាសួរត្រូវនឹងតួអក្សរណាមួយផ្កាយមួយត្រូវនឹងលំដាប់នៃតួអក្សរ។

source: Parameter start_num specifies the character at which to start the search. The first character is character number 1. If start_num is omitted, it is assumed to be 1. SEARCH does not distinguish between uppercase and lowercase letters.
km: លេខចាប់ផ្តើមប៉ារ៉ាម៉ែត្របញ្ជាក់ពីតួអក្សរដែលត្រូវចាប់ផ្តើមស្វែងរក។ តួអក្សរទីមួយគឺលេខតួអក្សរ ១ ប្រសិនបើលេខចាប់ផ្តើមត្រូវបានលុបវាត្រូវបានសន្មតថាជា ១ ។ ការស្វែងរកមិនបែងចែករវាងអក្សរធំនិងអក្សរតូច។

source: SEARCH(find_text;within_text;start_num)
km: ស្វែងរក (ស្វែងរក; អត្ថបទ; អត្ថបទ; ចំនួនចាប់ផ្តើម)

source: Specified index to start the search
km: សន្ទស្សន៍ដែលបានបញ្ជាក់ដើម្បីចាប់ផ្តើមស្វែងរក

source: SEARCH("e";"Statements";6) returns 7
km: SEARCH ("e"; "Statements"; ៦) ត្រឡប់ ៧

source: SEARCH("margin";"Profit Margin") returns 8
km: SEARCH ("margin"; "Profit Margin") ត្រឡប់ ៨

source: The SEARCHB() function finds one text string (find_text) within another text string (within_text) and returns the number of the starting point of find_text, from the leftmost character of within_text using byte positions.
km: មុខងារ SEARCHB() រកឃើញខ្សែអត្ថបទមួយ (findtext) នៅក្នុងខ្សែអក្សរអត្ថបទមួយទៀត (អត្ថបទ) ហើយត្រឡប់ចំនួនចំនុចចាប់ផ្តើមនៃអត្ថបទស្វែងរកពីតួអក្សរខាងឆ្វេងបំផុតនៃអត្ថបទដោយប្រើទីតាំងបៃ។

source: Parameter BytePosition specifies the character at which to start the search. The first character is character number 2. If BytePosition is omitted, it is assumed to be 2. SEARCHB does not distinguish between uppercase and lowercase letters.
km: ប៉ារ៉ាម៉ែតប៉ារ៉ាម៉ែត្របញ្ជាក់ពីតួអក្សរដែលត្រូវចាប់ផ្តើមស្វែងរក។ តួអក្សរទីមួយគឺលេខតួអក្សរ ២ ។ ប្រសិនបើ BytePosition ត្រូវបានលុបចោលវាត្រូវបានគេសន្មត់ថា ២។ SEARCHB មិនបែងចែករវាងអក្សរធំនិងអក្សរតូច។

source: SEARCHB(find_text;within_text;BytePosition Start)
km: SEARCHB (findtext; intext; BytePosition Start)

source: Specified byte position to start the search
km: ទីតាំងបៃដែលបានបញ្ជាក់ដើម្បីចាប់ផ្តើមស្វែងរក

source: The SLEEK() function removes all spaces from the string.
km: មុខងារ SLEEK() យកចន្លោះទាំងអស់ចេញពីខ្សែអក្សរ។

source: SLEEK(text)
km: SLEEK (អត្ថបទ)

source: SLEEK("This is some text ") returns "Thisissometext"
km: SLEEK (" នេះជាអត្ថបទខ្លះ ") ត្រឡប់ "Thisissometext"

source: The SUBSTITUTE() substitutes new_text for old_text in a text string. If instance_num is specified, only that instance of old_text is replaced. Otherwise, every occurrence of old_text is changed to new_text. Use SUBSTITUTE when you want to replace specific text, use REPLACE when you want to replace any text that occurs in a specific location.
km: SUBSTITUTE() ជំនួសអត្ថបទថ្មីសម្រាប់អត្ថបទចាស់ក្នុងខ្សែអត្ថបទ។ បើឧទាហរណ៍លេខត្រូវបានបញ្ជាក់មានតែវត្ថុនៃអត្ថបទចាស់ត្រូវបានជំនួស។ បើមិនដូច្នោះទេរាល់ការកើតឡើងនៃអត្ថបទចាស់ត្រូវបានប្តូរទៅជាអត្ថបទថ្មី។ ប្រើ SUBSTITUTE នៅពេលអ្នកចង់ជំនួសអត្ថបទជាក់លាក់សូមប្រើ REPLACE នៅពេលដែលអ្នកចង់ជំនួសអត្ថបទណាមួយដែលកើតឡើងនៅក្នុងទីតាំងជាក់លាក់។

source: SUBSTITUTE(text; old_text; new_text; instance_num)
km: SUBSTITUTE (អត្ថបទ; អត្ថបទចាស់; អត្ថបទថ្មី; ឧទាហរណ៍ចំនួន)

source: Text for which you want to substitute
km: អត្ថបទដែលអ្នកចង់ជំនួស

source: Part of text you want to replace
km: ផ្នែកនៃអត្ថបទដែលអ្នកចង់ជំនួស

source: New text which will be replacement
km: អត្ថបទថ្មីដែលនឹងត្រូវជំនួស

source: Which occurrence to replace
km: ដែលកើតឡើងដើម្បីជំនួស

source: SUBSTITUTE("Cost Data";"Cost";"Sales") returns "Sales Data"
km: SUBSTITUTE ("Cost Data"; "Cost"; "Sales") ត្រឡប់ "Sales Data"

source: SUBSTITUTE("Qtr 1, 2001";"1";"3";1) returns "Qtr 3, 2001"
km: SUBSTITUTE ("Qtr 1, 2001"; "1"; "3"; 1) ត្រឡប់ "Qtr 3, 2001"

source: SUBSTITUTE("Qtr 1, 2001";"1";"3";4) returns "Qtr 3, 2003"
km: SUBSTITUTE ("Qtr 1, 2001"; "1"; "3"; 4) ត្រឡប់ "Qtr 3, 2003"

source: The T() function returns the text referred to by value. If value is, or refers to, text then T returns value. If value does not refer to text then T returns empty text.
km: មុខងារ T() ត្រឡប់អត្ថបទយោងដោយតម្លៃ។ ប្រសិនបើតម្លៃឬយោងទៅអត្ថបទបន្ទាប់មក T ត្រឡប់តម្លៃ។ ប្រសិនបើតម្លៃមិនយោងទៅលើអត្ថបទទេនោះ T នឹងត្រឡប់អត្ថបទទទេ។

source: T(value)
km: T (តម្លៃ)

source: T("Calligra") returns "Calligra"
km: T ("Calligra") ត្រឡប់ "Calligra"

source: T(1.2) returns "" (empty text)
km: T (១.២) ត្រឡប់ "" (អត្ថបទទទេ)

source: TEXT
km: អត្ថបទ

source: The TEXT() function converts a value to text.
km: មុខងារ TEXT() បម្លែងតម្លៃទៅជាអត្ថបទ។

source: TEXT(value)
km: TEXT (តម្លៃ)

source: TEXT(1234.56) returns "1234.56"
km: TEXT (1234,56) ត្រឡប់ "1234.56"

source: TEXT("KSpread") returns "KSpread"
km: TEXT ("KSpread") ត្រឡប់ "KSpread"

source: The TOGGLE() function changes lowercase characters to uppercase and uppercase characters to lowercase.
km: មុខងារ TOGGLE() ផ្លាស់ប្តូរតួអក្សរតូចទៅជាអក្សរធំនិងតួអក្សរធំទៅអក្សរតូច។

source: TOGGLE(text)
km: TOGGLE (អត្ថបទ)

source: TOGGLE("hello") returns "HELLO"
km: TOGGLE ("hello") ត្រឡប់ "HELLO"

source: TOGGLE("HELLO") returns "hello"
km: TOGGLE ("HELLO") ត្រឡប់ "hello"

source: TOGGLE("HeLlO") returns "hElLo"
km: TOGGLE ("HeLlO") ត្រឡប់ "hElLo"

source: The TRIM() function returns text with only single spaces between words.
km: មុខងារ TRIM() ត្រឡប់អត្ថបទដែលមានចន្លោះតែមួយរវាងពាក្យ។

source: TRIM(text)
km: TRIM (អត្ថបទ)

source: TRIM(" hello KSpread ") returns "hello KSpread"
km: TRIM (" សួស្តី KS រាលដាល ") ត្រឡប់ "hello KSpread"

source: The UNICHAR() function returns the character specified by a unicode code point.
km: មុខងារ UNICHAR() ត្រឡប់តួអក្សរដែលបានបញ្ជាក់ដោយចំណុចកូដយូនីកូដ។

source: UNICHAR(code)
km: UNICHAR (លេខកូដ)

source: UNICHAR(65) returns "A"
km: UNICHAR (៦៥) ត្រឡប់ "A"

source: The UNICODE() function returns a unicode code point for the first character in a text string.
km: មុខងារ UNICODE() ត្រឡប់ចំណុចកូដយូនីកូដសម្រាប់តួអក្សរដំបូងនៅក្នុងខ្សែអក្សរអត្ថបទ។

source: UNICODE(text)
km: UNICODE (អត្ថបទ)

source: UNICODE("KDE") returns 75
km: UNICODE ("KDE") ត្រឡប់ 75

source: The UPPER() function converts a string to upper case.
km: មុខងារ UPPER() បំលែងខ្សែអក្សរទៅជាអក្សរធំ។

source: UPPER(text)
km: UPPER (អត្ថបទ)

source: UPPER("hello") returns "HELLO"
km: UPPER ("hello") ត្រឡប់ "HELLO"

source: UPPER("HELLO") returns "HELLO"
km: UPPER ("HELLO") ត្រឡប់ "HELLO"

source: Converts text string that represents a value to the real value.
km: បម្លែងខ្សែអក្សរអត្ថបទដែលតំណាងឱ្យតម្លៃទៅតម្លៃពិត។

source: VALUE(text)
km: VALUE (អត្ថបទ)

source: VALUE("14.03") returns 14.03
km: VALUE ("14.03") ត្រឡប់ 14.03

source: Trigonometric
km: ត្រីកោណមាត្រ

source: The ACOS() function returns the arc cosine in radians and the value is mathematically defined to be 0 to PI (inclusive).
km: មុខងារ ACOS() ត្រឡប់អ័ក្សកូស៊ីនុសជារ៉ាដ្យង់ហើយតម្លៃត្រូវបានកំណត់ជាគណិតវិទ្យាពី ០ ដល់PI (រាប់បញ្ចូល) ។

source: ACOS(Float)
km: ACOS (អណ្តែត)

source: ACOS(0.8) equals 0.6435011
km: ACOS (០.៨) ស្មើនឹង ០.៦៤៣៥០១១

source: ACOS(0) equals 1.57079633
km: ACOS (០) ស្មើនឹង ១.៥៧០៧៩៦៣៣

source: The ACOSH() function calculates the inverse hyperbolic cosine of x. That is the value whose hyperbolic cosine is x. If x is less than 1.0, acosh() returns not-a-number (NaN) and errno is set.
km: អនុគមន៍ ACOSH() គណនាកូស៊ីនុសអ៊ីពែរបូលច្រាសនៃ x ។ នោះគឺជាតម្លៃដែលកូស៊ីនុសអ៊ីពែរបូលរបស់វាគឺ x ។ ប្រសិនបើ x តិចជាង ១,០ អាសេស() ត្រឡប់មិនមែនលេខ (NaN) ហើយកំហុសបានកំណត់។

source: ACOSH(Float)
km: ACOSH (អណ្តែត)

source: ACOSH(5) equals 2.29243167
km: ACOSH (៥) ស្មើ ២.២៩២៤៣១៦៧

source: ACOSH(0) equals NaN
km: ACOSH (០) ស្មើនឹង NaN

source: The ACOT() function returns the inverse cotangent of a number.
km: អនុគមន៍ ACOT() ត្រឡប់កូតង់សង់បញ្ច្រាសនៃចំនួនមួយ។

source: ACOT(Float)
km: ACOT (អណ្តែត)

source: ACOT(0) equals 1.57079633
km: ACOT (០) ស្មើ ១.៥៧០៧៩៦៣៣

source: ASIN
km: ដូច​ជា​នៅ​ក្នុង

source: The ASIN() function returns the arc sine in radians and the value is mathematically defined to be -PI/2 to PI/2 (inclusive).
km: អនុគមន៍ ASIN() ត្រឡប់អ័ក្សស៊ីនុសជារ៉ាដ្យង់ហើយតម្លៃត្រូវបានកំណត់ជាគណិតវិទ្យាទៅជា -PI / 2 ទៅ PI / 2 (រាប់បញ្ចូល) ។

source: ASIN(Float)
km: ASIN (អណ្តែត)

source: ASIN(0.8) equals 0.92729522
km: ASIN(០.៨) ស្មើ ០.៩២៧២៩៥២២

source: ASIN(0) equals 0
km: ASIN(០) ស្មើ ០

source: The ASINH() function calculates the inverse hyperbolic sine of x; that is the value whose hyperbolic sine is x.
km: អនុគមន៍ ASINH() គណនាស៊ីនុសអ៊ីពែរបូលច្រាសនៃ x; នោះគឺជាតំលៃដែលស៊ីនុសអ៊ីពែរបូលរបស់វាគឺ x ។

source: ASINH(Float)
km: ASINH(អណ្តែត)

source: ASINH(0.8) equals 0.73266826
km: ASINH(០.៨) ស្មើនឹង ០.៧៣២៦៦៨២៦

source: ASINH(0) equals 0
km: ASINH(០) ស្មើ ០

source: The ATAN() function returns the arc tangent in radians and the value is mathematically defined to be -PI/2 to PI/2 (inclusive).
km: អនុគមន៍ ATAN() ត្រឡប់អ័ក្សតង់សង់ជារ៉ាដ្យង់ហើយតម្លៃត្រូវបានកំណត់ជាគណិតវិទ្យាទៅជា -PI / 2 ទៅ PI / 2 (រាប់បញ្ចូល) ។

source: ATAN(Float)
km: ATAN (អណ្តែត)

source: ATAN(0.8) equals 0.67474094
km: ATAN (០.៨) ស្មើ ០.៦៧៤៧៤០៩៤

source: ATAN(0) equals 0
km: ATAN (០) ស្មើ ០

source: This function calculates the arc tangent of the two variables x and y. It is similar to calculating the arc tangent of y/x, except that the signs of both arguments are used to determine the quadrant of the result.
km: មុខងារនេះគណនាអ័ក្សតង់សង់នៃអថេរទាំងពីរ x និង y ។ វាប្រហាក់ប្រហែលនឹងការគណនាអ័ក្សតង់សង់នៃ y / x លើកលែងតែសញ្ញានៃអាគុយម៉ង់ទាំងពីរត្រូវបានប្រើដើម្បីកំណត់ផលគុណនៃលទ្ធផល។

source: ATAN2(value;value)
km: ATAN2 (តម្លៃ; តម្លៃ)

source: ATAN2(0.5;1.0) equals 1.107149
km: ATAN2 (០.៥; ១.០) ស្មើនឹង ១.១០៧១៤៩

source: ATAN2(-0.5;2.0) equals 1.815775
km: ATAN2 (-០.៥; ២.០) ស្មើនឹង ១.៨១៥៧៧៥

source: The ATANH() function calculates the inverse hyperbolic tangent of x; that is the value whose hyperbolic tangent is x. If the absolute value of x is greater than 1.0, ATANH() returns not-a-number (NaN).
km: អនុគមន៍ ATANH() គណនាតង់សង់អ៊ីពែរបូលច្រាសនៃ x; នោះជាតម្លៃដែលតង់សង់អ៊ីពែរបូលរបស់ខ្លួនគឺ x ។ ប្រសិនបើតម្លៃដាច់ខាតនៃ x ធំជាង ១.០ នោះ ATANH() ត្រឡប់មិនមែនជាលេខ (NaN) ។

source: ATANH(Float)
km: ATANH(អណ្តែត)

source: ATANH(0.8) equals 1.09861229
km: ATANH (០.៨) ស្មើនឹង ១.០៩៨៦១២២៩

source: ATANH(0) equals 0
km: ATANH(0) ស្មើ ០

source: The COS() function returns the cosine of x, where x is given in radians.
km: មុខងារ COS() ត្រឡប់កូស៊ីនុសនៃ x ដែល x ត្រូវបានផ្តល់ជារ៉ាដ្យង់។

source: COS(Float)
km: COS (អណ្តែត)

source: COS(0) equals 1.0
km: COS (០) ស្មើនឹង ១.០

source: COS(PI()/2) equals 0
km: COS (PI() / ២) ស្មើ ០

source: The COSH() function returns the hyperbolic cosine of x, which is defined mathematically as (exp(x) + exp(-x)) / 2.
km: មុខងារ COSH() ត្រឡប់កូស៊ីនុសអ៊ីពែរបូលនៃ x ដែលត្រូវបានកំណត់គណិតវិទ្យាដូចជា (exp (x) + exp (-x)) / 2 ។

source: COSH(Float)
km: COSH (អណ្តែត)

source: COSH(0.8) equals 1.33743495
km: COSH (០.៨) ស្មើនឹង ១.៣៣៧៤៣៤៩៥

source: COSH(0) equals 1
km: COSH (០) ស្មើ ១

source: The CSC() function returns the cosecant of x, where x is given in radians.
km: មុខងារ CSC() ត្រឡប់កូស៊ីនុសនៃ x ដែល x ត្រូវបានផ្តល់ជារ៉ាដ្យង់។

source: CSC(Float)
km: CSC (អណ្តែត)

source: CSC(PI()/2) equals 1
km: CSC (PI() / ២) ស្មើ ១

source: The CSCH() function returns the hyperbolic cosecant of x, where x is given in radians.
km: អនុគមន៍ CSCH() ត្រឡប់កូស៊ីនុសអ៊ីពែរបូលនៃ x ដែល x ត្រូវបានផ្តល់ជារ៉ាដ្យង់។

source: CSCH(Float)
km: CSCH (អណ្តែត)

source: CSCH(PI()/2) equals 0.434537208...
km: CSCH (PI() / ២) ស្មើ ០.៤៣៤៥៣៧២០៨ …

source: This function transforms a radian angle to a degree angle.
km: មុខងារនេះបំលែងមុំកាំរស្មីទៅមុំដឺក្រេ។

source: DEGREES(Float)
km: DEGREES (អណ្តែត)

source: DEGREES(0.78) equals 44.69
km: DEGREES (០.៧៨) ស្មើនឹង ៤៤.៦៩

source: DEGREES(1) equals 57.29
km: DEGREES (១) ស្មើនឹង ៥៧.២៩

source: The PI() function returns the value of PI.
km: មុខងារPI() ត្រឡប់តម្លៃរបស់PI។

source: PI() equals 3.141592654...
km: PI() ស្មើនឹង ៣.១៤១៥៩២៦៥៤ …

source: This function transforms a degree angle to a radian angle.
km: មុខងារនេះបំលែងមុំដឺក្រេទៅមុំរ៉ាដ្យង់។

source: RADIANS(Float)
km: RADIANS (អណ្តែត)

source: Angle (degrees)
km: មុំ (ដឺក្រេ)

source: RADIANS(75) equals 1.308
km: RADIANS (75) ស្មើនឹង 1.308

source: RADIANS(90) equals 1.5707
km: RADIANS (90) ស្មើនឹង 1.5707

source: The SEC() function returns the secant of x, where x is given in radians.
km: អនុគមន៍ SEC() ត្រឡប់សុវត្ថភាពនៃ x ដែល x ត្រូវបានផ្តល់ជារ៉ាដ្យង់។

source: SEC(Float)
km: SEC (អណ្តែត)

source: SEC(0) equals 1
km: SEC (០) ស្មើ ១

source: The SECH() function returns the hyperbolic secant of x, where x is given in radians.
km: អនុគមន៍ SECH() ត្រឡប់ស៊ីនុសអ៊ីពែរបូលនៃ x ដែល x ត្រូវបានផ្តល់ជារ៉ាដ្យង់។

source: SECH(Float)
km: SECH (អណ្តែត)

source: SECH(0) equals 1
km: SECH (០) ស្មើ ១

source: The SIN() function returns the sine of x, where x is given in radians.
km: មុខងារ SIN() ត្រឡប់ស៊ីនុសនៃ x ដែល x ត្រូវបានផ្តល់ជារ៉ាដ្យង់។

source: SIN(Float)
km: SIN (អណ្តែត)

source: SIN(0) equals 0
km: SIN (០) ស្មើ ០

source: SIN(PI()/2) equals 1
km: SIN (PI() / ២) ស្មើ ១

source: The SINH() function returns the hyperbolic sine of x, which is defined mathematically as (exp(x) - exp(-x)) / 2.
km: មុខងារ SINH() ត្រឡប់ស៊ីនុសអ៊ីពែរបូលនៃ x ដែលត្រូវបានកំណត់គណិតវិទ្យាដូចជា (exp (x) - exp (-x)) / 2 ។

source: SINH(Float)
km: SINH (អណ្តែត)

source: SINH(0.8) equals 0.88810598
km: SINH (០.៨) ស្មើនឹង ០.៨៨៨១០៥៩៨

source: SINH(0) equals 0
km: SINH (០) ស្មើ ០

source: The TAN() function returns the tangent of x, where x is given in radians.
km: អនុគមន៍ TAN() ត្រឡប់តង់សង់នៃ x ដែល x ត្រូវបានផ្តល់ជារ៉ាដ្យង់។

source: TAN(Float)
km: TAN (អណ្តែត)

source: TAN(0.7) equals 0.84228838
km: TAN (០.៧) ស្មើ ០.៨៤២២៨៨៣៨

source: TAN(0) equals 0
km: TAN (០) ស្មើ ០

source: The TANH() function returns the hyperbolic tangent of x, which is defined mathematically as sinh(x)/cosh(x).
km: មុខងារ TANH() ត្រឡប់តង់សង់អ៊ីពែរបូលនៃ x ដែលត្រូវបានកំណត់គណិតវិទ្យាជា sinh (x) / cosh (x) ។

source: TANH(Float)
km: TANH (អណ្តែត)

source: TANH(0.8) equals 0.66403677
km: TANH(០.៨) ស្មើនឹង ០.៦៦៤០៣៦៧៧

source: TANH(0) equals 0
km: TANH(0) ស្មើ ០
