Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: DELTA(3; 3) returns 1
km: DELTA (3; 3) ត្រឡប់ 1

source: DELTA(1; TRUE) returns 1
km: DELTA (1; TRUE) ត្រឡប់ 1

source: The ERF() function returns the error function. With a single argument, ERF() returns the error function between 0 and that argument.
km: មុខងារ ERF() ត្រឡប់មុខងារកំហុស។ ជាមួយនឹងអាគុយម៉ង់តែមួយ ERF() ត្រឡប់មុខងារកំហុសរវាងលេខ 0 និងអាគុយម៉ង់នោះ។

source: ERF(Lower limit; Upper limit)
km: ERF (ដែនកំណត់ទាប; ដែនកំណត់ខាងលើ)

source: Lower limit
km: ដែនកំណត់ទាប

source: Upper limit
km: ដែនកំណត់ខាងលើ

source: ERF(0.4) equals 0.42839236
km: ERF (០.៤) ស្មើ ០.៤២៨៣៩២៣៦

source: The ERFC() function returns the complementary error function.
km: មុខងារ ERFC() ត្រឡប់មុខងារកំហុសបន្ថែម។

source: ERFC(Lower limit; Upper limit)
km: ERFC (ដែនកំណត់ទាប; ដែនកំណត់ខាងលើ)

source: ERFC(0.4) equals 0.57160764
km: ERFC (០.៤) ស្មើនឹង ០៥៧១៦០៧៦៤

source: The GESTEP() function returns 1 if x greater or equals y, otherwise returns 0. y defaults to 0.
km: អនុគមន៍ GESTEP() ត្រឡប់ 1 ប្រសិនបើ x ធំជាងឬស្មើ y បើមិនដូច្នោះទេនឹងត្រឡប់ 0. y លំនាំដើមទៅ 0 ។

source: GESTEP(1.2; 3.4) returns 0
km: GESTEP (1.2; 3.4) ត្រឡប់ 0

source: GESTEP(3; 3) returns 1
km: GESTEP (3; 3) ត្រឡប់ 1

source: GESTEP(0.4; TRUE) returns 0
km: GESTEP (0.4; TRUE) ត្រឡប់ 0

source: GESTEP(4; 3) returns 1
km: GESTEP (4; 3) ត្រឡប់ 1

source: The HEX2BIN() function returns the value formatted as a binary number.
km: អនុគមន៍ HEX2BIN() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលពីរ។

source: HEX2BIN(value)
km: HEX2BIN (តម្លៃ)

source: HEX2BIN("a") returns "1010"
km: HEX2BIN ("a") ត្រឡប់ "1010"

source: HEX2BIN("37") returns "110111"
km: HEX2BIN ("37") ត្រឡប់ "110111"

source: The HEX2DEC() function returns the value formatted as a decimal number.
km: អនុគមន៍ HEX2DEC() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលដប់។

source: HEX2DEC(value)
km: HEX2DEC (តម្លៃ)

source: HEX2DEC("a") returns 10
km: HEX2DEC ("a") ត្រឡប់ ១០

source: HEX2DEC("37") returns 55
km: HEX2DEC ("37") ត្រឡប់ ៥៥

source: The HEX2OCT() function returns the value formatted as an octal number.
km: អនុគមន៍ HEX2OCT() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលប្រាំបី។

source: HEX2OCT(value)
km: HEX2OCT (តម្លៃ)

source: HEX2OCT("a") returns "12"
km: HEX2OCT ("a") ត្រឡប់ "12"

source: HEX2OCT("37") returns "67"
km: HEX2OCT ("37") ត្រឡប់ "67"

source: The IMABS(complex number) returns the norm of a complex number of form x+yi.
km: IMABS (ចំនួនកុំផ្លិច) ត្រឡប់បទដ្ឋាននៃចំនួនកុំផ្លិចនៃទម្រង់ x + yi ។

source: IMABS(complex number)
km: IMABS (ចំនួនកុំផ្លិច)

source: Complex number
km: ចំនួនកុំផ្លិច

source: IMABS("1.2+5i") returns 5.1419
km: IMABS ("1.2 + 5i") ត្រឡប់ 5.1419

source: IMABS("-i") returns 1
km: IMABS ("-i") ត្រឡប់ ១

source: IMABS("12") returns 12
km: IMABS ("12") ត្រឡប់ ១២

source: The IMAGINARY(string) returns the imaginary coefficient of a complex.
km: IMAGINARY (ខ្សែអក្សរ) ត្រឡប់មេគុណស្រមើលស្រមៃនៃកុំផ្លិច។

source: IMAGINARY(string)
km: IMAGINARY (ខ្សែអក្សរ)

source: IMAGINARY("1.2+3.4i") returns 3.4
km: IMAGINARY ("1.2 + 3.4i") ត្រឡប់ 3.4

source: IMAGINARY("1.2") returns 0
km: IMAGINARY ("1.2") ត្រឡប់ 0

source: The IMARGUMENT(complex number) returns the argument of a complex number of form x+yi.
km: IMARGUMENT (ចំនួនកុំផ្លិច) ត្រឡប់អាគុយម៉ង់នៃចំនួនកុំផ្លិចនៃទម្រង់ x + yi ។

source: IMARGUMENT(complex number)
km: IMARGUMENT (ចំនួនកុំផ្លិច)

source: IMARGUMENT("1.2+5i") returns 0.6072
km: IMARGUMENT ("1,2 + 5i") ត្រឡប់ 0.6072

source: IMARGUMENT("-i") returns -1.57079633
km: IMARGUMENT ("-i") ត្រឡប់ -1.57079633

source: IMARGUMENT("12") returns "#Div/0"
km: IMARGUMENT("12") ត្រឡប់ "#Div/0"

source: The IMCONJUGATE(complex number) returns the conjugate of a complex number of form x+yi.
km: លេខ IMCONJUGATE (ចំនួនកុំផ្លិច) ត្រឡប់បន្សំនៃចំនួនកុំផ្លិចនៃទម្រង់ x + yi ។

source: IMCONJUGATE(complex number)
km: IMCONJUGATE (ចំនួនកុំផ្លិច)

source: IMCONJUGATE("1.2+5i") returns "1.2-5i"
km: IMCONJUGATE ("1.2 + 5i") ត្រឡប់ "1.2-5i"

source: IMCONJUGATE("-i") returns "i"
km: IMCONJUGATE ("-i") ត្រឡប់ "i"

source: IMCONJUGATE("12") returns "12"
km: IMCONJUGATE ("12") ត្រឡប់ "12"

source: The IMCOS(string) returns the cosine of a complex number.
km: IMCOS (ខ្សែអក្សរ) ត្រឡប់កូស៊ីនុសនៃចំនួនកុំផ្លិច។

source: IMCOS(string)
km: IMCOS (ខ្សែអក្សរ)

source: IMCOS("1+i") returns "0.83373-0.988898i"
km: IMCOS ("1 + i") ត្រឡប់ "0.83373-0.988898i"

source: IMCOS("12i") returns 81 377.4
km: IMCOS ("12i") ត្រឡប់ 81 377.4

source: The IMCOSH(string) returns the hyperbolic cosine of a complex number.
km: IMCOSH (ខ្សែអក្សរ) ត្រឡប់កូស៊ីនុសអ៊ីពែរបូលនៃចំនួនកុំផ្លិច។

source: IMCOSH(string)
km: IMCOSH (ខ្សែអក្សរ)

source: IMCOSH("1+i") returns "0.83373+0.988898i"
km: IMCOSH ("1 + i") ត្រឡប់ "0.83373 + 0.988898i"

source: IMCOSH("12i") returns 0.84358
km: IMCOSH ("12i") ត្រឡប់ 0.84358

source: The IMCOT(string) returns the cotangent of a complex number.
km: IMCOT (ខ្សែអក្សរ) ត្រឡប់កូតង់សង់នៃចំនួនកុំផ្លិច។

source: IMCOT(string)
km: IMCOT (ខ្សែអក្សរ)

source: IMCOT("1+i") returns "0.21762-0.86801i"
km: IMCOT ("1 + i") ត្រឡប់ "0.21762-0.86801i"

source: The IMCSC(string) returns the cosecant of a complex number.
km: IMCSC (ខ្សែអក្សរ) ត្រឡប់កូស៊ីនុសនៃចំនួនកុំផ្លិច។

source: IMCSC(string)
km: IMCSC (ខ្សែអក្សរ)

source: IMCSC("1+i") returns "0.62151-0.30393i"
km: IMCSC ("1 + i") ត្រឡប់ "0.62151-0.30393i"

source: The IMCSCH(string) returns the hyperbolic cosecant of a complex number.
km: IMCSCH (ខ្សែអក្សរ) ត្រឡប់កូស៊ីនុសអ៊ីពែរបូលនៃចំនួនកុំផ្លិច។

source: IMCSCH(string)
km: IMCSCH (ខ្សែអក្សរ)

source: IMCSCH("1+i") returns "0.30393-i0.62151"
km: IMCSCH ("1 + i") ត្រឡប់ "0.30393-i0.62151"

source: The IMDIV() returns the division of several complex numbers of form x+yi.
km: IMDIV() ត្រឡប់ចែកនៃចំនួនកុំផ្លិចនៃទម្រង់ x + yi ។

source: IMDIV(value;value;...)
km: IMDIV (តម្លៃ; តម្លៃ; ... )

source: IMDIV(1.2;"3.4+5i") returns "0.111597-0.164114i"
km: IMDIV (1.2; "3.4 + 5i") ត្រឡប់ "0.111597-0.164114i"

source: IMDIV("12+i";"12-i") returns "0.986207+0.16551i"
km: IMDIV ("12 + i"; "12-i") ត្រឡប់ "0.986207 + 0.16551i"

source: The IMEXP(string) returns the exponential of a complex number.
km: IMEXP (ខ្សែអក្សរ) ត្រឡប់និទស្សន្តនៃចំនួនកុំផ្លិច។

source: IMEXP(string)
km: IMEXP (ខ្សែអក្សរ)

source: IMEXP("2-i") returns "3.99232-6.21768i"
km: IMEXP ("2-i") ត្រឡប់ "3.99232-6.21768i"

source: IMEXP("12i") returns "0.843854-0.536573i"
km: IMEXP ("12i") ត្រឡប់ "0.843854-0.536573i"

source: IMLN
km: អាយអិលអិន

source: The IMLN(string) returns the natural logarithm of a complex number.
km: IMLN (ខ្សែអក្សរ) ត្រឡប់លោការីតធម្មជាតិនៃចំនួនកុំផ្លិច។

source: IMLN(string)
km: IMLN (ខ្សែអក្សរ)

source: IMLN("3-i") returns "1.15129-0.321751i"
km: IMLN ("3-i") ត្រឡប់ "1.15129-0.321751i"

source: IMLN("12") returns 2.48491
km: IMLN ("12") ត្រឡប់ 2,48491

source: IMLOG10
km: អាយអិល .១០

source: The IMLOG10(string) returns the base-10 logarithm of a complex number.
km: IMLOG10 (ខ្សែអក្សរ) ត្រឡប់លោការីត ១០ នៃចំនួនកុំផ្លិច។

source: IMLOG10(string)
km: IMLOG10 (ខ្សែអក្សរ)

source: IMLOG10("3+4i") returns "0.69897+0.402719i"
km: IMLOG10 ("3 + 4i") ត្រឡប់ "0.69897 + 0.402719i"

source: The IMLOG2(string) returns the base-2 logarithm of a complex number.
km: IMLOG2 (ខ្សែអក្សរ) ត្រឡប់លោការីតគោល ២ នៃចំនួនកុំផ្លិច។

source: IMLOG2(string)
km: IMLOG2 (ខ្សែអក្សរ)

source: IMLOG2("3+4i") returns "2.321928+1.337804i"
km: IMLOG2 ("3 + 4i") ត្រឡប់ "2.321928 + 1.337804i"

source: The IMPOWER(string) returns a complex number raised to a power.
km: IMPOWER (ខ្សែអក្សរ) ត្រឡប់ចំនួនកុំផ្លិចដែលបានលើកឡើងទៅជាថាមពល។

source: IMPOWER(string)
km: IMPOWER (ខ្សែអក្សរ)

source: Power
km: ថាមពល

source: IMPOWER("4-i";2) returns "15-8i"
km: IMPOWER ("4-i"; ២) ត្រឡប់ "15-8i"

source: IMPOWER("1.2";2) returns 1.44
km: IMPOWER ("1.2"; 2) ត្រឡប់ 1,44

source: The IMPRODUCT() returns the product of several complex numbers of form x+yi.
km: IMPRODUCT() ត្រឡប់ផលគុណនៃចំនួនកុំផ្លិចនៃទម្រង់ x + yi ។

source: IMPRODUCT(value;value;...)
km: IMPRODUCT (តម្លៃ; តម្លៃ; ... )

source: IMPRODUCT(1.2;"3.4+5i") returns "4.08+6i"
km: IMPRODUCT (1.2; "3.4 + 5i") ត្រឡប់ "4.08 + 6i"

source: IMPRODUCT(1.2;"1i") returns "+1.2i"
km: IMPRODUCT (1.2; "1i") ត្រឡប់ " + 1.2i"

source: The IMREAL(string) returns the real coefficient of a complex.
km: ខ្សែអក្សរ IMREAL ត្រឡប់មេគុណពិតនៃកុំផ្លិច។

source: IMREAL(string)
km: IMREAL (ខ្សែអក្សរ)

source: IMREAL("1.2+3.4i") returns 1.2
km: IMREAL ("1.2 + 3.4i") ត្រឡប់ 1.2

source: IMREAL("1.2i") returns 0
km: IMREAL ("1.2i") ត្រឡប់ 0

source: The IMSEC(string) returns the secant of a complex number.
km: IMSEC (ខ្សែអក្សរ) ត្រឡប់លេខនៃចំនួនកុំផ្លិច។

source: IMSEC(string)
km: IMSEC (ខ្សែអក្សរ)

source: IMSEC("1+i") returns "0.49833+i0.59108"
km: IMSEC ("1 + i") ត្រឡប់ "0.49833 + i0.59108"

source: The IMSECH(string) returns the hyperbolic secant of a complex number.
km: វឺរអ៊ីសអេសអេចត្រឡប់លេខអ៊ីពែរបូលនៃចំនួនកុំផ្លិច។

source: IMSECH(string)
km: IMSECH (ខ្សែអក្សរ)

source: IMSECH("1+i") returns "0.49833-i0.59108"
km: IMSECH ("1 + i") ត្រឡប់ "0.49833-i0.59108"

source: The IMSIN(string) function returns the sine of a complex number.
km: មុខងារ IMSIN (ខ្សែអក្សរ) ត្រឡប់ស៊ីនុសនៃចំនួនកុំផ្លិច។

source: IMSIN(string)
km: IMSIN (ខ្សែអក្សរ)

source: IMSIN("1+i") returns "1.29846+0.634964i"
km: IMSIN ("1 + i") ត្រឡប់ "1.29846 + 0.634964i"

source: IMSIN("1.2") returns -0.536573
km: IMSIN ("1.2") ត្រឡប់ -0.536573

source: The IMSINH(string) function returns the hyperbolic sine of a complex number.
km: មុខងារ IMSINH (ខ្សែអក្សរ) ត្រឡប់ស៊ីនុសអ៊ីពែរបូលនៃចំនួនកុំផ្លិច។

source: IMSINH(string)
km: IMSINH (ខ្សែអក្សរ)

source: IMSINH("1+i") returns "0.63496+1.29846i"
km: IMSINH ("1 + i") ត្រឡប់ "0.63496 + 1.29846i"

source: IMSINH("1.2") returns 1.50946
km: IMSINH ("1.2") ត្រឡប់ 1.50946

source: The IMSQRT(string) returns the square root of a complex number.
km: IMSQRT (ខ្សែអក្សរ) ត្រឡប់ឫសការ៉េនៃចំនួនកុំផ្លិច។

source: IMSQRT(string)
km: IMSQRT (ខ្សែអក្សរ)

source: IMSQRT("1+i") returns "1.09868+0.45509i"
km: IMSQRT ("1 + i") ត្រឡប់ "1.09868 + 0.45509i"

source: IMSQRT("1.2i") returns "0.774597+0.774597i"
km: IMSQRT ("1.2i") ត្រឡប់ "0.774597 + 0.774597i"

source: The IMSUB() returns the difference of several complex numbers of form x+yi.
km: IMSUB() ត្រឡប់ភាពខុសគ្នានៃចំនួនកុំផ្លិចជាច្រើននៃទម្រង់ x + yi ។

source: IMSUB(value;value;...)
km: IMSUB (តម្លៃ; តម្លៃ; ... )

source: IMSUB(1.2;"3.4+5i") returns "-2.2-5i"
km: IMSUB (1.2; "3.4 + 5i") ត្រឡប់ "-2.2-5i"

source: IMSUB(1.2;"1i") returns "1.2-i"
km: IMSUB (1.2; "1i") ត្រឡប់ "1.2-i"

source: The IMSUM() returns the sum of several complex numbers of form x+yi.
km: IMSUM() ត្រឡប់ផលបូកនៃចំនួនកុំផ្លិចជាច្រើននៃទម្រង់ x + yi ។

source: IMSUM(value;value;...)
km: IMSUM (តម្លៃ; តម្លៃ; ... )

source: IMSUM(1.2;"3.4+5i") returns "4.6+5i"
km: IMSUM (1.2; "3.4 + 5i") ត្រឡប់ "4.6 + 5i"

source: IMSUM(1.2;"1i") returns "1.2+i"
km: IMSUM (1.2; "1i") ត្រឡប់ "1.2 + i"

source: The IMTAN(string) function returns the tangent of a complex number.
km: មុខងារ IMTAN (ខ្សែអក្សរ) ត្រឡប់តង់សង់នៃចំនួនកុំផ្លិច។

source: IMTAN(string)
km: IMTAN (ខ្សែអក្សរ)

source: IMTAN("1+i") returns "0.27175+1.08392i"
km: IMTAN ("1 + i") ត្រឡប់ "0.27175 + 1.08392i"

source: IMTAN("1.2") returns 2.57215
km: IMTAN ("1.2") ត្រឡប់ 2.57215

source: The IMTANH(string) function returns the hyperbolic tangent of a complex number.
km: មុខងារ IMTANH (ខ្សែអក្សរ) ត្រឡប់តង់សង់អ៊ីពែរបូលនៃចំនួនកុំផ្លិច។

source: IMTANH(string)
km: IMTANH (ខ្សែអក្សរ)

source: IMTANH("1+i") returns "1.08392+0.27175i"
km: IMTANH ("1 + i") ត្រឡប់ "1.08392 + 0.27175i"

source: IMTANH("1.2") returns 0.83365
km: IMTANH ("1.2") ត្រឡប់ 0.83365

source: The OCT2BIN() function returns the value formatted as a binary number.
km: អនុគមន៍ OCT2BIN() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលពីរ។

source: OCT2BIN(value)
km: OCT2BIN (តម្លៃ)

source: OCT2BIN("12") returns "1010"
km: OCT2BIN ("12") ត្រឡប់ "1010"

source: OCT2BIN("55") returns "101101"
km: OCT2BIN ("55") ត្រឡប់ "101101"

source: The OCT2DEC() function returns the value formatted as a decimal number.
km: អនុគមន៍ OCT2DEC() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលដប់។

source: OCT2DEC(value)
km: OCT2DEC (តម្លៃ)

source: OCT2DEC("12") returns 10
km: OCT2DEC ("12") ត្រឡប់ ១០

source: OCT2DEC("55") returns 45
km: OCT2DEC ("55") ត្រឡប់ 45

source: The OCT2HEX() function returns the value formatted as a hexadecimal number.
km: អនុគមន៍ OCT2HEX() ត្រឡប់តម្លៃដែលបានធ្វើទ្រង់ទ្រាយជាលេខគោលដប់ប្រាំមួយ។

source: OCT2HEX(value)
km: OCT2HEX (តម្លៃ)

source: OCT2HEX("12") returns "A"
km: OCT2HEX ("12") ត្រឡប់ "A"

source: OCT2HEX("55") returns "2D"
km: OCT2HEX ("55") ត្រឡប់ "2D"

source: Financial
km: ហិរញ្ញវត្ថុ

source: The ACCRINT function returns accrued interest for a security which pays periodic interest. Allowed frequencies are 1 - annual, 2 - semi-annual or 4 - quarterly. Basis is the type of day counting you want to use: 0: US 30/360 (default), 1: real days, 2: real days/360, 3: real days/365 or 4: European 30/365.
km: អនុគមន៍ ACCRINT ត្រឡប់ការប្រាក់កើនសម្រាប់មូលប័ត្រដែលបង់ការប្រាក់តាមកាលកំណត់។ ប្រេកង់ដែលបានអនុញ្ញាតគឺ 1 - ប្រចាំឆ្នាំ 2 - ពាក់កណ្តាលឆ្នាំឬ 4 - ត្រីមាស។ មូលដ្ឋានគឺជាប្រភេទនៃការរាប់ថ្ងៃដែលអ្នកចង់ប្រើ៖ ០: ៣០ អាមេរិក ៣០/៣៦០ (លំនាំដើម) ១: ថ្ងៃពិតប្រាកដ ២ ៈថ្ងៃពិត / ៣៦០, ៣: ថ្ងៃពិត / ៣៦៥ ឬ ៤ ៈអឺរ៉ុប ៣០/៣៦៥ ។

source: ACCRINT(issue; first interest; settlement; rate; par; frequency; basis)
km: ACCRINT (ចេញការប្រាក់ដំបូង; ការទូទាត់; អត្រា; ភាគរយ; ប្រេកង់; មូលដ្ឋាន)

source: Issue date
km: កាលបរិច្ឆេទចេញ

source: First interest
km: ចំណាប់អារម្មណ៍ដំបូង

source: Settlement
km: ការតាំងទីលំនៅ

source: Annual rate of security
km: អត្រាសន្តិសុខប្រចាំឆ្នាំ

source: Par value
km: តម្លៃចុះ

source: Number of payments per year
km: ចំនួននៃការបង់ប្រាក់ក្នុងមួយឆ្នាំ

source: Day counting basis
km: មូលដ្ឋានរាប់ថ្ងៃ

source: ACCRINT("2/28/2001"; "8/31/2001"; "5/1/2001"; 0.1; 1000; 2; 0) returns 16,944
km: ACCRINT ("2 / 28 / 2001"; "8 / 31 / 2001"; "5 / 1 / 2001"; 0,1; 1000; 2; 0) ត្រឡប់ 16.944

source: The ACCRINTM function returns accrued interest for a security which pays interests at maturity date. Basis is the type of day counting you want to use: 0: US 30/360 (default), 1: real days, 2: real days/360, 3: real days/365 or 4: European 30/365.
km: អនុគមន៍ ACCRINTM ត្រឡប់ការប្រាក់កើនសម្រាប់មូលប័ត្រដែលបង់ការប្រាក់នៅកាលបរិច្ឆេទដល់កំណត់បង់។ មូលដ្ឋានគឺជាប្រភេទនៃការរាប់ថ្ងៃដែលអ្នកចង់ប្រើ៖ ០: ៣០ អាមេរិក ៣០/៣៦០ (លំនាំដើម) ១: ថ្ងៃពិតប្រាកដ ២ ៈថ្ងៃពិត / ៣៦០, ៣: ថ្ងៃពិត / ៣៦៥ ឬ ៤ ៈអឺរ៉ុប ៣០/៣៦៥ ។

source: ACCRINTM(issue; settlement; rate; par; basis)
km: ACCRINTM (ចេញការទូទាត់; អត្រា; អត្រា; មូលដ្ឋាន; មូលដ្ឋាន)

source: ACCRINTM("2/28/2001"; "8/31/2001"; 0.1; 100) returns 5.0278
km: ACCRINTM ("2 / 28 / 2001"; "8 / 31 / 2001"; 0,1; 100) ត្រឡប់ 5.0278

source: The AMORDEGRC function calculates the amortization value for the French accounting system using degressive depreciation.
km: មុខងារ AMORDEGRC គណនាតម្លៃរំលោះសម្រាប់ប្រព័ន្ធគណនេយ្យបារាំងដោយប្រើរំលស់ថោកទាប។

source: AMORDEGRC( Cost; purchaseDate; firstPeriodEndDate; salvage; period; rate; basis)
km: AMORDEGRC (ថ្លៃដើមការទិញកាលបរិច្ឆេទដំបូងកំឡុងពេលបញ្ចប់កាលបរិច្ឆេទសង្គ្រោះ; រយៈពេល; អត្រា; មូលដ្ឋាន)

source: Cost
km: ថ្លៃដើម

source: AMORDEGRC( 1000; "2006-02-01"; "2006-12-31"; 10; 0; 0.1; 1 ) returns 228
km: AMORDEGRC (១០០០; "2006-02-01"; "2006-12-31"; 10; 0; 0.1; 1) ត្រឡប់ 228

source: The AMORLINC function calculates the amortization value for the French accounting system using linear depreciation.
km: មុខងារ AMORLINC គណនាតម្លៃរំលោះសម្រាប់ប្រព័ន្ធគណនេយ្យបារាំងដោយប្រើការរំលោះលីនេអ៊ែរ។

source: AMORLINC( Cost; purchaseDate; firstPeriodEndDate; salvage; period; rate; basis)
km: AMORLINC (ថ្លៃដើមការទិញកាលបរិច្ឆេទដំបូងកំឡុងពេលបញ្ចប់កាលបរិច្ឆេទសង្គ្រោះ; រយៈពេល; អត្រា; មូលដ្ឋាន)

source: AMORLINC( 1000; "2004-02-01"; "2004-12-31"; 10; 0; 0.1; 1 ) returns 91.256831
km: AMORLINC (១០០០; "2004-02-01"; "2004-12-31"; 10; 0; 0.1; 1) ត្រឡប់ 91.256831

source: The COMPOUND() function returns the value of an investment, given the principal, nominal interest rate, compounding frequency and time. For example: $5000 at 12% interest compounded quarterly for 5 years will become COMPOUND(5000;0.12;4;5) or $9030.56.
km: អនុគមន៍ COMPOUND() ត្រឡប់តម្លៃនៃការវិនិយោគដែលបានផ្តល់ឱ្យអត្រាការប្រាក់គោលការប្រាក់បន្ទាប់បន្សំនិងពេលវេលា។ ឧទាហរណ៍ៈ $5000 មានអត្រាការប្រាក់ ១២ % បូកបញ្ចូលគ្នាប្រចាំត្រីមាសក្នុងរយៈពេល ៥ ឆ្នាំនឹងក្លាយជាក្រុមហ៊ុន COMPOUND (៥០០០; ០,១២, ៤, ៥) ឬ $9030.56 ។

source: COMPOUND(initial;interest;periods;periods_per_year)
km: COMPOUND (ដំបូង; ការប្រាក់; រយៈពេល; អំឡុងពេល)

source: Principal
km: នាយកសាលា

source: Interest rate
km: អត្រា​ការ​ប្រាក់

source: Periods per year
km: រយៈពេលក្នុងមួយឆ្នាំ

source: Years
km: ឆ្នាំ

source: COMPOUND(5000;0.12;4;5) equals 9030.56
km: COMPOUND (៥០០០; ០,១២; ៤, ៥) ស្មើនឹង ៩០៣០.៥៦

source: The CONTINUOUS() function calculates the return on continuously compounded interest, given the principal, nominal rate and time in years. For example: $1000 earning 10% for 1 year becomes CONTINUOUS(1000;.1;1) or $1105.17.
km: មុខងារ CONTINUOUS() គណនាការត្រឡប់មកវិញនៃអត្រាការប្រាក់ដែលបានបូកបញ្ចូលគ្នាជាបន្តបន្ទាប់ដែលបានផ្តល់ឱ្យតាមអត្រាការប្រាក់បន្ទាប់បន្សំនិងពេលវេលាគិតជាឆ្នាំ។ ឧទាហរណ៍ៈ $1000 រកបាន ១០ % រយៈពេល ១ ឆ្នាំក្លាយជា CONTINUOUS (១០០០; ១; ១) ឬ $1105.17 ។

source: CONTINOUS(principal;interest;years)
km: CONTINOUS (ប្រាក់ដើម; ការប្រាក់; ឆ្នាំ)

source: CONTINUOUS(1000;0.1;1) equals 1105.17
km: CONTINUOUS (១០០០; ០,១; ១) ស្មើ ១១០៥.១៧

source: The COUPNUM function returns the number of coupons to be paid between the settlement and the maturity. Basis is the type of day counting you want to use: 0: US 30/360 (default), 1: real days, 2: real days/360, 3: real days/365 or 4: European 30/365.
km: មុខងារ COUPNUM ត្រឡប់ចំនួនគូប៉ុងដែលត្រូវបង់រវាងការទូទាត់និងថ្ងៃដល់កំណត់បង់។ មូលដ្ឋានគឺជាប្រភេទនៃការរាប់ថ្ងៃដែលអ្នកចង់ប្រើ៖ ០: ៣០ អាមេរិក ៣០/៣៦០ (លំនាំដើម) ១: ថ្ងៃពិតប្រាកដ ២ ៈថ្ងៃពិត / ៣៦០, ៣: ថ្ងៃពិត / ៣៦៥ ឬ ៤ ៈអឺរ៉ុប ៣០/៣៦៥ ។

source: COUPNUM(settlement; maturity; frequency; basis)
km: COUPNUM (ទូទាត់; ថ្ងៃដល់កំណត់បង់; ប្រេកង់; មូលដ្ឋាន)

source: Maturity
km: កាលកំណត់

source: Frequency
km: ភាពញឹកញាប់

source: COUPNUM("2/28/2001"; "8/31/2001"; 2; 0) returns 1
km: COUPNUM ("2 / 28 / 2001"; "8 / 31 / 2001"; 2; 0) ត្រឡប់ 1

source: Calculates the cumulative interest payment.
km: គណនាការទូទាត់ការប្រាក់សន្សំ។

source: CUMIPMT(rate, periods, value, start, end, type)
km: CUMIPMT (អត្រារយៈពេលតម្លៃចាប់ផ្តើមបញ្ចប់ប្រភេទ)

source: rate
km: អត្រា

source: periods
km: រយៈពេល

source: value
km: តម្លៃ

source: start
km: ចាប់ផ្តើម

source: <seg>end</seg>
km: <seg> បញ្ចប់ </seg>

source: type
km: ប្រភេទ

source: CUMIPMT( 0.06/12; 5*12; 100000; 5; 12; 0 ) equals -3562,187023
km: CUMIPMT (០.០៦ / ១២; ៥ * ១២; ១០០០០០; ៥; ១២; ០) ស្មើ -៣៥៦២,១៨៧០២៣

source: Calculates the cumulative principal payment.
km: គណនាការទូទាត់ប្រាក់ដើម។

source: CUMPRINC(rate, periods, value, start, end, type)
km: CUMPRINC (អត្រារយៈពេលតម្លៃចាប់ផ្តើមបញ្ចប់ប្រភេទ)

source: CUMPRINC( 0.06/12; 5*12; 100000; 5; 12; 0 ) equals -11904.054201
km: CUMPRINC (០.០៦ / ១២; ៥ * ១២; ១០០០០០; ៥; ១២; ០) ស្មើនឹង -១១៩០៤.០៥៤២០

source: The DB() function will calculate the depreciation of an asset for a given period using the fixed-declining balance method. Month is optional, if omitted it is assumed to be 12.
km: មុខងារ DB() នឹងគណនាការរំលោះទ្រព្យសម្បត្តិសម្រាប់រយៈពេលដែលបានផ្តល់ឱ្យដោយប្រើវិធីសាស្ត្រតុល្យភាពថយចុះថេរ។ ខែគឺស្រេចចិត្តប្រសិនបើបានលុបវាត្រូវបានគេសន្មត់ថា ១២ ។

source: DB(cost; salvage value; life; period [;month])
km: DB (ថ្លៃដើម; តម្លៃសង្គ្រោះ; អាយុកាល; រយៈពេល [; ខែ])

source: Salvage
km: សង្គ្រោះ

source: Life
km: ជីវិត

source: Period
km: រយៈពេល

source: DB(8000;400;6;3) equals 1158.40
km: DB (៨០០០; ៤០០; ៦; ៣) ស្មើនឹង ១១៥៨.៤០

source: DB(8000;400;6;3;2) equals 1783.41
km: DB (៨០០០; ៤០០; ៦; ៣; ២) ស្មើនឹង ១៧៨៣.៤១

source: The DDB() function calculates the depreciation of an asset for a given period using the arithmetic-declining method. The factor is optional, if omitted it is assumed to be 2. All the parameter must be greater than zero.
km: មុខងារ DDB() គណនារំលោះនៃទ្រព្យសម្រាប់រយៈពេលដែលបានផ្តល់ឱ្យដោយប្រើវិធីសាស្ត្រថយចុះនព្វន្ធ។ កត្តាគឺស្រេចចិត្តប្រសិនបើលុបចោលវាត្រូវបានគេសន្មតថាមាន ២ ។ ប៉ារ៉ាម៉ែត្រទាំងអស់ត្រូវតែធំជាងសូន្យ។

source: DDB(cost; salvage value; life; period [;factor])
km: DDB (ថ្លៃដើម; តម្លៃសង្គ្រោះ; អាយុកាល; រយៈពេល [; កត្តា])

source: Factor
km: កត្តា

source: DDB(75000;1;60;12;2) returns 1721.81
km: DDB (៧៥០០០; ១; ៦០; ១២; ២) ត្រឡប់ ១៧២១.៨១

source: The DISC function returns the discount rate for a security. Basis is the type of day counting you want to use: 0: US 30/360 (default), 1: real days, 2: real days/360, 3: real days/365 or 4: European 30/365.
km: មុខងារ DISC ត្រឡប់អត្រាបញ្ចុះតម្លៃសម្រាប់មូលប័ត្រមួយ។ មូលដ្ឋានគឺជាប្រភេទនៃការរាប់ថ្ងៃដែលអ្នកចង់ប្រើ៖ ០: ៣០ អាមេរិក ៣០/៣៦០ (លំនាំដើម) ១: ថ្ងៃពិតប្រាកដ ២ ៈថ្ងៃពិត / ៣៦០, ៣: ថ្ងៃពិត / ៣៦៥ ឬ ៤ ៈអឺរ៉ុប ៣០/៣៦៥ ។

source: DISC(settlement; maturity; par; redemption [; basis ] )
km: DISC (ទូទាត់; ថ្ងៃដល់កំណត់បង់; ស្មើ; រំលោះ [; មូលដ្ឋាន])

source: Price per $100 face value
km: តម្លៃក្នុងមួយមុខតម្លៃ $100

source: Redemption
km: ការប្រោសលោះ

source: DISC("2/28/2001"; "8/31/2001"; 12; 14) returns 0.2841
km: DISC ("2 / 28 / 2001"; "8 / 31 / 2001"; 12; 14) ត្រឡប់ 0.2841

source: The DOLLARDE() function returns a dollar price expressed as a decimal number. The fractional dollar is the number to be converted and the fraction is the denominator of the fraction
km: អនុគមន៍ DOLLARDE() ត្រឡប់តម្លៃដុល្លារដែលបង្ហាញជាចំនួនទសភាគ។ ប្រាក់ដុល្លារប្រភាគគឺជាចំនួនដែលត្រូវបម្លែងហើយប្រភាគជាភាគបែងនៃប្រភាគ

source: DOLLARDE(fractional dollar; fraction)
km: DOLLARDE (ប្រាក់ដុល្លារប្រភាគ; ប្រភាគ)

source: Fractional Dollar
km: ដុល្លារប្រភាគ

source: Fraction
km: ប្រភាគ

source: DOLLARDE(1.02; 16) - stands for 1 and 2/16 - returns 1.125
km: DOLLARDE (១.០២; ១៦) - តំណាង ឲ្យ លេខ ១ និង ២/១៦ - ត្រឡប់ ១.១២៥

source: The DOLLARFR() function returns a dollar price expressed as a fraction. The decimal dollar is the number to be converted and the fraction is the denominator of the fraction
km: មុខងារ DOLLARFR() ត្រឡប់តម្លៃដុល្លារដែលបង្ហាញជាប្រភាគ។ ដុល្លារខ្ទង់ដប់គឺជាចំនួនដែលត្រូវបម្លែងហើយប្រភាគគឺជាភាគបែងនៃប្រភាគ

source: DOLLARFR(fractional dollar; fraction)
km: DOLLARFR (ប្រាក់ដុល្លារប្រភាគ; ប្រភាគ)

source: Decimal Dollar
km: ដុល្លារខ្ទង់ទសភាគ

source: DOLLARFR(1.125; 16) returns 1.02. (1 + 2/16)
km: DOLLARFR (១.១២៥; ១៦) ត្រឡប់ ១.០២ ។ (១ + ២/១៦)

source: Returns the number of periods needed for an investment to retain a desired value.
km: ត្រឡប់ចំនួនរយៈពេលដែលត្រូវការសម្រាប់ការវិនិយោគដើម្បីរក្សាតម្លៃដែលចង់បាន។

source: DURATION(rate; pv; fv)
km: DURATION (អត្រា; ទំព័រ; fv)

source: Rate
km: អត្រា

source: Present value (PV)
km: តម្លៃបច្ចុប្បន្ន (PV)

source: Future value (FV)
km: តម្លៃអនាគត (FV)

source: DURATION(0.1; 1000; 2000) returns 7.27
km: DURATION (0.1; 1000; 2000) ត្រឡប់ 7.27

source: Returns the Macauley duration of a fixed interest security in years.
km: ត្រឡប់រយៈពេលម៉ាកាវនៃមូលប័ត្រការប្រាក់ថេរក្នុងឆ្នាំ។

source: DURATION_ADD(Settlement; Maturity; Coupon; Yield; Frequency; Basis)
km: DURATION_ADD (ទូទាត់; ថ្ងៃដល់កំណត់បង់; គូប៉ុង; ចំណូល; ប្រេកង់; មូលដ្ឋាន)

source: Coupon
km: គូប៉ុង

source: Yield
km: ទិន្នផល

source: Basis
km: មូលដ្ឋាន

source: DURATION_ADD( "1998-01-01"; "2006-01-01"; 0.08; 0.09; 2; 1 ) returns 5.9937749555
km: DURATIONADD ("1998-01-01"; "2006-01-01"; 0.08; 0,09; 2; 1) ត្រឡប់ 5.9937749555

source: The EFFECT() function calculates the effective yield for a nominal interest rate (annual rate or APR). For example: 8% interest compounded monthly provides an effective yield of EFFECT(.08;12) or 8.3%.
km: មុខងារ EFFECT() គណនាលទ្ធផលដែលមានប្រសិទ្ធិភាពសម្រាប់អត្រាការប្រាក់បន្ទាប់បន្សំ (អត្រាប្រចាំឆ្នាំឬអេអេអេអេ) ។ ឧទាហរណ៍ៈចំណាប់អារម្មណ៍ ៨ % រួមបញ្ចូលគ្នាជារៀងរាល់ខែផ្តល់នូវប្រសិទ្ធិភាពនៃ EFFECT (.០៨; ១២) ឬ ៨.៣ % ។

source: EFFECT(nominal;periods)
km: EFFECT (បន្ទាប់បន្សំ; រយៈពេល)

source: Nominal interest rate
km: អត្រាការប្រាក់នាមករណ៍

source: Periods
km: រយៈពេល
