Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: XNPV(5%;B1:B4;C1:C4) suppose B1:B4 contains -20000, 4000, 12000, 8000 while C1:C4 contains "=DATE(2000;1;1)", "=DATE(2000;6;1)", "=DATE(2000;12;30)", "=DATE(2001;3;1)" returns 2907.83187
km: XNPV (5 %; B1: B4; C1: C4) ស្មាន B1: B4 មាន -២០០០០, ៤០០០, ១២០០០, ៨០០០ ខណៈពេលដែល C1: C4 មាន " = DATE (២០០០; ១; ១) ", " = DATE (២០០០; ៦) ; ១) ", " = DATE (២០០០; ១២; ៣០) ", " = DATE (២០០១; ៣; ១) " ត្រឡប់ ២៩០៧.៨៣១៨៧

source: YIELDDISC calculates the yield of a discounted security per 100 currency units of face value.
km: YIELDDISC គណនាលទ្ធផលនៃមូលប័ត្រដែលបានបញ្ចុះតម្លៃក្នុង ១០០ ឯកតារូបិយប័ណ្ណនៃតម្លៃមុខ។

source: YIELDDISC(settlement; maturity; price, redemp, basis)
km: YIELDDISC (ទូទាត់; ថ្ងៃដល់កំណត់បង់; តម្លៃ, រំលោះ, មូលដ្ឋាន)

source: YIELDDISC(DATE(1990;6;1);DATE(1990;12;31);941.66667;1000) returns 0.106194684
km: YIELDDISC (DATE (១៩៩០; ៦; ១); កាលបរិច្ឆេទ (១៩៩០, ១២; ៣១), ៩៤១.៦៦៦៦៧; ១០០០) ត្រឡប់ ០.១០៦១៩៤៦៨៤

source: The YIELDMAT function calculates the yield of the security that pays interest on the maturity date.
km: មុខងារ YIELDMAT គណនាលទ្ធផលនៃមូលប័ត្រដែលបង់ការប្រាក់តាមកាលកំណត់។

source: YIELDMAT( Settlement; Maturity; Issue; Rate; Price; Basis )
km: YIELDMAT (ទូទាត់; ថ្ងៃដល់កំណត់បង់; បញ្ហា; អត្រា; ថ្លៃ; មូលដ្ឋាន)

source: YIELDMAT(DATE(1990;6;1);DATE(1995;12;31);DATE(1990; 1; 1); 6%;103.819218241) returns 0.050000000
km: YIELDMAT (DATE (១៩៩០; ៦; ១); កាលបរិច្ឆេទ (១៩៩៥, ១២; ៣១), កាលបរិច្ឆេទ (១៩៩០; ១; ១), ៦ %; ១០៣.៨១៩២១៨២៤១) ត្រឡប់ ០.០៥០០០០០០០

source: The ZERO_COUPON() function calculates the value of a zero-coupon (pure discount) bond. For example: if the interest rate is 10%, a $1000 bond that matures in 20 years is worth ZERO_COUPON(1000;.1;20) or $148.64.
km: មុខងារ ZEROCOUPON() គណនាតម្លៃនៃចំណងសូន្យ - គូប៉ុង (ការបញ្ចុះតម្លៃសុទ្ធ) ។ ឧទាហរណ៍ៈប្រសិនបើអត្រាការប្រាក់គឺ ១០ %, ចំណង $1000 ដែលមានភាពចាស់ទុំក្នុងរយៈពេល ២០ ឆ្នាំគឺមានតម្លៃ ZEROCOUPON (១០០០; .១; ២០) ឬ $148.64 ។

source: ZERO_COUPON(face value;rate;years)
km: ZEROCOUPON (តម្លៃមុខ; អត្រា; ឆ្នាំ)

source: ZERO_COUPON(1000;.1;20) equals 148.64
km: ZEROCOUPON (១០០០; .១; ២០) ស្មើ ១៤៨.៦៤

source: Information
km: ព័ត៌មាន

source: The ERRORTYPE() function converts a error to a number. If the value is not an error, an error is returned. Otherwise, a numerical code is returned. Error codes are modelled on Excel.
km: មុខងារ ERRORTYPE() បំលែងកំហុសមួយទៅលេខមួយ។ ប្រសិនបើតម្លៃមិនមែនជាកំហុសទេកំហុសនឹងត្រូវប្រគល់ជូនវិញ។ បើមិនដូច្នោះទេលេខកូដនឹងត្រូវបានត្រឡប់មកវិញ។ លេខកូដកំហុសត្រូវបានយកគំរូតាម Excel ។

source: ERRORTYPE(value)
km: ERRORTYPE(តម្លៃ)

source: Error
km: កំហុស

source: Any kind of value
km: ប្រភេទនៃតម្លៃណាមួយ

source: ERRORTYPE(NA()) returns 7
km: ERRORTYPE (NA()) ត្រឡប់ ៧

source: ERRORTYPE(0) returns an error
km: ERRORTYPE(០) ត្រឡប់កំហុសមួយ

source: Returns the current filename. If the current document is not saved, an empty string is returned.
km: ត្រឡប់ឈ្មោះឯកសារបច្ចុប្បន្ន។ ប្រសិនបើឯកសារបច្ចុប្បន្នមិនត្រូវបានរក្សាទុកខ្សែអក្សរទទេនឹងត្រូវបានត្រឡប់។

source: The FORMULA() function returns the formula of a cell as string.
km: អនុគមន៍ FORMULA() ត្រឡប់រូបមន្តនៃក្រឡាជាខ្សែអក្សរ។

source: Reference
km: ឯកសារយោង

source: FORMULA(A1) returns "=SUM(1+2)" if the cell A1 contains such a formula.
km: FORMULA (A1) ត្រឡប់ " = SUM (1 + 2) " ប្រសិនបើក្រឡា A1 មានរូបមន្តបែបនេះ។

source: The INFO() function returns information about the current operating environment. Parameter type specifies what type of information you want to return. It is one of the following: "directory" returns the path of the current directory, "numfile" returns the number of active documents, "release" returns the version of &sheets; as text, "recalc" returns the current recalculation mode: "Automatic" or "Manual", "system" returns the name of the operating environment, "osversion" returns the current operating system.
km: មុខងារ INFO() ត្រឡប់ព័ត៌មានអំពីបរិស្ថានប្រតិបត្តិការបច្ចុប្បន្ន។ ប្រភេទប៉ារ៉ាម៉ែត្របញ្ជាក់ពីប្រភេទព័ត៌មានដែលអ្នកចង់ត្រឡប់។ វាជាឯកសារមួយក្នុងចំណោមឯកសារខាងក្រោម: "directory" ត្រឡប់ផ្លូវនៃថតបច្ចុប្បន្ន "numfile" ត្រឡប់ចំនួនឯកសារសកម្ម, "release" ត្រឡប់កំណែសន្លឹក; ដូចអត្ថបទ, "recalc" ត្រឡប់របៀបគណនាឡើងវិញបច្ចុប្បន្ន៖ "Automatic" ឬ "Manual", "system" ត្រឡប់ឈ្មោះបរិស្ថានប្រតិបត្តិការ, zxdbquotx ។

source: INFO(type)
km: INFO (ប្រភេទ)

source: Type of information
km: ប្រភេទព័ត៌មាន

source: The ISBLANK() function returns True if the parameter is empty. Otherwise it returns False.
km: មុខងារ ISBLANK() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រទទេ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។

source: Any value
km: តម្លៃណាមួយ

source: ISBLANK(A1) returns True if A1 is empty
km: ISBLANK (A1) ត្រឡប់ពិតប្រសិនបើ A1 ទទេ

source: ISBLANK(A1) returns False if A1 holds a value
km: ISBLANK (A1) ត្រឡប់មិនពិតប្រសិនបើ A1 រក្សាតម្លៃ

source: The ISDATE() function returns True if the parameter is a date value. Otherwise it returns False
km: អនុគមន៍ ISDATE() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រជាតម្លៃកាលបរិច្ឆេទ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត

source: ISDATE("2000-2-2") returns True
km: ISDATE ("2000-2-2") ត្រឡប់ពិត

source: ISDATE("hello") returns False
km: ISDATE ("hello") ត្រឡប់មិនពិត

source: The ISERR() function returns True if its parameter is an error other than N/A. Otherwise, it returns False. Use ISERROR() if you want to include the N/A error as well.
km: អនុគមន៍ ISERR() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្ររបស់វាជាកំហុសក្រៅពី N/A ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។ ប្រើ ISERROR() ប្រសិនបើអ្នកចង់បញ្ចូលកំហុស N/A ផងដែរ។

source: The ISERROR() function returns True if its parameter is an error of any type. Otherwise, it returns False.
km: មុខងារ ISERROR() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្ររបស់វាគឺជាកំហុសនៃប្រភេទណាមួយ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។

source: The ISEVEN() function returns True if the number is even. Otherwise returns False.
km: មុខងារ ISEVEN() ត្រឡប់ពិតប្រសិនបើចំនួនគូ។ បើមិនដូច្នេះទេត្រឡប់មិនពិត។

source: ISEVEN(12) returns True
km: ISEVEN (១២) ត្រឡប់ពិត

source: ISEVEN(-7) returns False
km: ISEVEN (-7) ត្រឡប់មិនពិត

source: The ISFORMULA() function returns True if the referenced cell contains a formula. Otherwise it returns False
km: អនុគមន៍ ISFORMULA() ត្រឡប់ពិតបើក្រឡាយោងមានរូបមន្ត។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត

source: The ISLOGICAL() function returns True if the parameter is a boolean value. Otherwise it returns False.
km: អនុគមន៍ ISLOGICAL() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រជាតម្លៃប៊ូលីន។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។

source: ISLOGICAL(A1>A2) returns True
km: ISLOGICAL (A1>; A2) ត្រឡប់ពិត

source: ISLOGICAL(12) returns False
km: ISLOGICAL (12) ត្រឡប់មិនពិត

source: The ISNA() function returns True if its parameter is a N/A error. In all other cases, it returns False.
km: មុខងារ ISNA() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្ររបស់វាជាកំហុស N / A ។ ក្នុងករណីទាំងអស់វាត្រលប់មកវិញមិនពិត។

source: The ISNONTEXT() function returns True if the parameter is not a string. Otherwise it returns False. It's the same as ISNOTTEXT.
km: មុខងារ ISNONTEXT() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រមិនមែនជាខ្សែអក្សរ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។ វាដូចគ្នានឹង ISNOTTEXT ។

source: ISNONTEXT(12) returns True
km: ISNONTEXT (12) ត្រឡប់ពិត

source: ISNONTEXT("hello") returns False
km: ISNONTEXT ("hello") ត្រឡប់មិនពិត

source: The ISNOTTEXT() function returns True if the parameter is not a string. Otherwise it returns False. It's the same as ISNONTEXT.
km: មុខងារ ISNOTTEXT() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រមិនមែនជាខ្សែអក្សរ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។ វាដូចគ្នានឹង ISNONTEXT ។

source: ISNOTTEXT(12) returns True
km: ISNOTTEXT (12) ត្រឡប់ពិត

source: ISNOTTEXT("hello") returns False
km: ISNOTTEXT ("hello") ត្រឡប់មិនពិត

source: The ISNUM() function returns True if the parameter is a numerical value. Otherwise it returns False. It's the same as ISNUMBER.
km: អនុគមន៍ ISNUM() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រជាតម្លៃលេខ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។ វាដូចគ្នានឹង ISNUMBER ដែរ។

source: ISNUM(12) returns True
km: ISNUM (12) ត្រឡប់ពិត

source: ISNUM(hello) returns False
km: ISNUM (សួស្តី) ត្រឡប់មិនពិត

source: The ISNUMBER() function returns True if the parameter is a numerical value. Otherwise it returns False. It's the same as ISNUM.
km: អនុគមន៍ ISNUMBER() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រជាតម្លៃលេខ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។ វាដូចគ្នានឹង ISNUM ដែរ។

source: ISNUMBER(12) returns True
km: ISNUMBER (12) ត្រឡប់ពិត

source: ISNUMBER(hello) returns False
km: ISNUMBER (សួស្តី) ត្រឡប់មិនពិត

source: The ISODD() function returns True if the number is odd. Otherwise returns False.
km: មុខងារ ISODD() ត្រឡប់ពិតប្រសិនបើចំនួនសេស។ បើមិនដូច្នេះទេត្រឡប់មិនពិត។

source: ISODD(12) returns False
km: ISODD (12) ត្រឡប់មិនពិត

source: ISODD(-7) returns True
km: ISODD (-7) ត្រឡប់ពិត

source: The ISREF() function returns True if the parameter refers to a reference. Otherwise it returns False
km: មុខងារ ISREF() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រយោងទៅលើឯកសារយោង។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត

source: ISREF(A12) returns true
km: ISREF (A12) ត្រលប់មកវិញជាការពិត

source: ISREF("hello") returns false
km: ISREF ("hello") ត្រឡប់មិនពិត

source: The ISTEXT() function returns True if the parameter is a string. Otherwise it returns False
km: មុខងារ ISTEXT() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រជាខ្សែអក្សរ។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត

source: ISTEXT(12) returns False
km: ISTEXT (12) ត្រឡប់មិនពិត

source: ISTEXT("hello") returns True
km: ISTEXT ("hello") ត្រឡប់ពិត

source: The ISTIME() function returns True if the parameter is a time value. Otherwise it returns False.
km: មុខងារ ISTIME() ត្រឡប់ពិតប្រសិនបើប៉ារ៉ាម៉ែត្រជាតម្លៃពេលវេលា។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។

source: ISTIME("12:05") returns True
km: ISTIME ("12: 05") ត្រឡប់ពិត

source: ISTIME("hello") returns False
km: ISTIME ("hello") ត្រឡប់មិនពិត

source: The N() function converts a value to a number. If value is or refers to a number, this function returns the number. If value is True, this function returns 1. If a value is a date, this function returns the serial number of that date. Anything else will cause the function to return 0.
km: មុខងារ N() បំលែងតម្លៃទៅជាលេខ។ ប្រសិនបើតម្លៃគឺឬសំដៅទៅលើលេខមុខងារនេះនឹងត្រឡប់លេខ។ ប្រសិនបើតម្លៃពិតមុខងារនេះត្រឡប់មកវិញ។ ប្រសិនបើតម្លៃជាកាលបរិច្ឆេទមុខងារនេះនឹងត្រឡប់លេខស៊េរីនៃកាលបរិច្ឆេទនោះ។ អ្វីផ្សេងទៀតនឹងធ្វើឱ្យមុខងារត្រឡប់ 0 ។

source: N(value)
km: N (តម្លៃ)

source: N(3.14) returns 3.14
km: N (3.14) ត្រឡប់ 3.14

source: N("7") returns 0 (because "7" is text)
km: N ("7") ត្រឡប់ 0 (ពីព្រោះ "7" ជាអត្ថបទ)

source: The NA() function returns the constant error value, N/A.
km: មុខងារ NA() ត្រឡប់តម្លៃកំហុសថេរ N / A ។

source: The TYPE() function returns 1 if the value is a number, 2 if it is text, 4 if the value is a logical value, 16 if it is an error value or 64 if the value is an array. If the cell the value represents contains a formula you get its return type.
km: អនុគមន៍ TYPE() ត្រឡប់ 1 ប្រសិនបើតម្លៃជាលេខ 2 ប្រសិនបើវាជាអត្ថបទ 4 ប្រសិនបើតម្លៃជាតម្លៃតក្ក 16 ប្រសិនបើវាជាតម្លៃកំហុសឬ 64 ប្រសិនបើតម្លៃជាអារេ។ ប្រសិនបើក្រឡាតម្លៃតំណាងឱ្យមានរូបមន្តអ្នកនឹងទទួលបានប្រភេទត្រឡប់មកវិញ។

source: TYPE(A1) returns 2, if A1 contains "Text"
km: TYPE (A1) ត្រឡប់ ២ ប្រសិនបើ A1 មាន "Text"

source: TYPE(-7) returns 1
km: TYPE (-៧) ត្រឡប់ ១

source: TYPE(A2) returns 1, if A2 contains "=CURRENTDATE()"
km: TYPE (A2) ត្រឡប់ 1 ប្រសិនបើ A2 មាន " = CURRENTDATE() "

source: Logical
km: ឡូជីខល

source: The AND() function returns True if all the values are true. Otherwise it returns False (unless any of the values in an error - then it returns an error).
km: អនុគមន៍ AND() ត្រឡប់ពិតប្រសិនបើតម្លៃទាំងអស់ពិត។ បើមិនដូច្នោះទេវាត្រឡប់មកវិញមិនពិត (លើកលែងតែតម្លៃណាមួយនៅក្នុងកំហុសមួយ - បន្ទាប់មកវានឹងត្រឡប់កំហុស) ។

source: AND(value;value;...)
km: AND (តម្លៃ; តម្លៃ; ... )

source: Boolean values
km: តម្លៃប៊ូលីន

source: A range of truth values (TRUE or FALSE)
km: ជួរនៃតម្លៃសេចក្តីពិត (TRUE ឬ FALSE)

source: AND(true;true;true) returns True
km: ហើយ (ពិត; ពិត; ពិត) ត្រឡប់ពិត

source: AND(true;false) returns False
km: និង (ពិតមិនពិត) ត្រឡប់មិនពិត

source: The FALSE() function returns the boolean value FALSE.
km: អនុគមន៍ FALSE() ត្រឡប់តម្លៃប៊ូលីន FALSE ។

source: FALSE() returns FALSE
km: FALSE() ត្រឡប់ FALSE

source: The IF() function is a conditional function. This function returns the second parameter if the condition is True. Otherwise it returns the third parameter (which defaults to being false).
km: មុខងារ IF() គឺជាមុខងារដែលមានលក្ខខណ្ឌ។ មុខងារនេះត្រឡប់ប៉ារ៉ាម៉ែត្រទីពីរប្រសិនបើលក្ខខណ្ឌពិត។ បើមិនដូច្នោះទេវាត្រលប់មកវិញនូវប៉ារ៉ាម៉ែត្រទីបី (ដែលកំណត់ថាមិនពិត) ។

source: IF(condition;if_true;if_false)
km: IF (លក្ខខណ្ឌ; iftrue; iffalse)

source: Condition
km: លក្ខខណ្ឌ

source: If true
km: បើពិត

source: If false
km: បើមិនពិត

source: A1=4;A2=6;IF(A1>A2;5;3) returns 3
km: A1 = 4; A2 = 6; IF (A1>; A2; 5; 3) ត្រឡប់ 3

source: Return X unless it is an Error, in which case return an alternative value.
km: ត្រឡប់ X លុះត្រាតែវាជាកំហុសក្នុងករណីនេះត្រឡប់តម្លៃជំនួសវិញ។

source: IFERROR(AnyX;AnyAlternative)
km: IFERROR (អ៊ិច។ អេ។ អិល។ អិល)

source: Any X
km: ណាមួយ X

source: Any Alternative
km: ជំរើសផ្សេងទៀត

source: IFERROR(A1;A2) returns the content of A1 if that content is not an error-value else the content of A2 is returned.
km: IFERROR (A1; A2) ត្រឡប់មាតិការបស់ A1 ប្រសិនបើមាតិកានោះមិនមែនជាកំហុសតម្លៃផ្សេងមាតិកា A2 ត្រូវបានត្រឡប់មកវិញ។

source: Return X unless it is an NA, in which case return an alternative value.
km: ត្រឡប់ X លុះត្រាតែវាជារដ្ឋសភាដែលក្នុងករណីនេះត្រឡប់តម្លៃជំនួសវិញ។

source: IFNA(A1;A2) returns the content of A1 if that content is not an #N/A error-value else the content of A2 is returned.
km: IFNA (A1; A2) ត្រឡប់មាតិកានៃ A1 ប្រសិនបើមាតិកានោះមិនមែនជា #N/A កំហុសតម្លៃផ្សេងមាតិកានៃ A2 ត្រូវបានត្រឡប់។

source: The NAND() function returns True if at least one value is not true. Otherwise it returns False.
km: មុខងារ NAND() ត្រឡប់ពិតប្រសិនបើយ៉ាងហោចណាស់តម្លៃមួយមិនពិត។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។

source: NAND(value;value;...)
km: NAND (តម្លៃ; តម្លៃ; ... )

source: NAND(true;false;false) returns True
km: NAND (ពិត; មិនពិត; មិនពិត) ត្រឡប់ពិត

source: NAND(true;true) returns False
km: NAND (ពិត; ពិត) ត្រឡប់មិនពិត

source: The NOR() function returns True if all the values given as parameters are of boolean type and have the value false. Otherwise it returns False.
km: អនុគមន៍ន័រ() ត្រឡប់ពិតប្រសិនបើតម្លៃទាំងអស់ដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រគឺជាប្រភេទប៊ូលីននិងមានតម្លៃមិនពិត។ បើមិនដូច្នោះទេវាត្រលប់មកវិញមិនពិត។

source: NOR(value;value;...)
km: NOR (តម្លៃ; តម្លៃ; ... )

source: NOR(true;false;false) returns False
km: NOR (ពិត, មិនពិត; មិនពិត) ត្រឡប់មិនពិត

source: NOR(false;false) returns True
km: NOR (មិនពិត; មិនពិត) ត្រឡប់ពិត

source: The NOT() function returns True if the value is False and returns False if the value is True. It returns an error if the input in an error.
km: មុខងារ NOT() ត្រឡប់ពិតប្រសិនបើតម្លៃមិនពិតហើយត្រឡប់មិនពិតបើតម្លៃពិត។ វាត្រឡប់កំហុសប្រសិនបើការបញ្ចូលមានកំហុស។

source: Boolean value
km: តម្លៃប៊ូលីន

source: NOT(false) returns True
km: NOT(មិនពិត) ត្រឡប់ពិត

source: NOT(true) returns False
km: NOT(ពិត) ត្រឡប់មិនពិត

source: <title>OR</title>
km: <title> ឬ </title>

source: The OR() function returns True if at least one of the values is true. Otherwise it returns False (unless any of the values is an error, then it returns an error).
km: មុខងារ OR() ត្រឡប់ពិតប្រសិនបើយ៉ាងហោចណាស់តម្លៃមួយគឺពិត។ បើមិនដូច្នោះទេវាត្រឡប់មិនពិត (លុះត្រាតែតម្លៃណាមួយគឺជាកំហុសបន្ទាប់មកវានឹងត្រឡប់កំហុស) ។

source: OR(value;value;...)
km: OR(តម្លៃ; តម្លៃ; ... )

source: OR(false;false;false) returns False
km: OR(មិនពិត; មិនពិត; មិនពិត) ត្រឡប់មិនពិត

source: OR(true;false) returns True
km: OR(ពិត, មិនពិត) ត្រឡប់ពិត

source: The TRUE() function returns the boolean value TRUE.
km: អនុគមន៍ TRUE() ត្រឡប់តម្លៃប៊ូលីន TRUE ។

source: TRUE() returns TRUE
km: TRUE() ត្រឡប់ពិត

source: The XOR() function returns False if the number of True values is even. Otherwise it returns True. It returns an error if any argument is an error.
km: មុខងារ XOR() ត្រឡប់មិនពិតប្រសិនបើចំនួនពិតពិត។ បើមិនដូច្នោះទេវាត្រលប់មកវិញជាការពិត។ វាត្រឡប់កំហុសប្រសិនបើអាគុយម៉ង់ណាមួយជាកំហុស។

source: XOR(value;value;...)
km: XOR (តម្លៃ; តម្លៃ; ... )

source: XOR(false;false;false) returns True
km: XOR (មិនពិត; មិនពិត; មិនពិត) ត្រឡប់ពិត

source: XOR(true;false) returns True
km: XOR (ពិត, មិនពិត) ត្រឡប់ពិត

source: Lookup &amp; Reference
km: រកមើល &amp; ឯកសារយោង

source: The ADDRESS creates a cell address. Parameter Row is the row number and Column is the column number.
km: ADDRESS បង្កើតអាសយដ្ឋានកោសិកា។ ជួរដេកប៉ារ៉ាម៉ែត្រគឺជាលេខជួរហើយជួរឈរគឺជាលេខជួរឈរ។

source: Absolute number specifies the type of reference: 1 or omitted = Absolute, 2 = Absolute row, relative column, 3 = Relative row; absolute column and 4 = Relative.
km: ចំនួនដាច់ខាតបញ្ជាក់ពីប្រភេទឯកសារយោង៖ ១ ឬលុបចោល = ដាច់ខាត ២ = ជួរដាច់ខាតជួរឈរដែលទាក់ទង ៣ = ជួរដេកដែលទាក់ទង; ជួរឈរដាច់ខាតនិង ៤ = ទាក់ទង។

source: A1 Style specifies the style of the address to return. If A1 is set to TRUE (default) the address is returned in A1 style if it is set to FALSE in R1C1 style.
km: រចនាប័ទ្ម A1 បញ្ជាក់ពីរបៀបនៃអាស័យដ្ឋានដែលត្រូវត្រលប់មកវិញ។ ប្រសិនបើ A1 ត្រូវបានកំណត់ទៅ TRUE (តាមលំនាំដើម) អាសយដ្ឋានត្រូវបានត្រលប់មកវិញនៅក្នុងរចនាប័ទ្ម A1 ប្រសិនបើវាត្រូវបានកំណត់ទៅ FALSE នៅក្នុងរចនាប័ទ្ម R1C1 ។

source: Sheet name is the text specifying the name of the sheet.
km: ឈ្មោះសន្លឹកគឺជាអត្ថបទដែលបញ្ជាក់ពីឈ្មោះសន្លឹក។

source: ADDRESS(row; col; absolute; style; sheet name)
km: ADDRESS (ជួរ; កូ; ដាច់ខាត; រចនាប័ទ្ម; ឈ្មោះសន្លឹក)

source: Row number
km: លេខជួរដេក

source: Column number
km: លេខជួរ

source: Absolute number (optional)
km: ចំនួនដាច់ខាត (ជាជម្រើស)

source: A1 style (optional)
km: រចនាប័ទ្ម A1 (ជាជម្រើស)

source: Sheet name
km: ឈ្មោះសន្លឹក

source: ADDRESS(6; 4) returns $D$6
km: ADDRESS (6; 4) ត្រឡប់ $D $6

source: ADDRESS(6; 4; 2) returns D$6
km: ADDRESS (6; 4; 2) ត្រឡប់ D $6

source: ADDRESS(6; 4; 2; FALSE; "Sheet1") returns Sheet1!R6C[4]
km: ADDRESS (6; 4; 2; FALSE; "Sheet1") ត្រឡប់សន្លឹក 1! R6C [4]

source: ADDRESS(6; 4; 1; FALSE; "Sheet1") returns Sheet1!R6C4
km: ADDRESS (6; 4; 1; FALSE; "Sheet1") ត្រឡប់សន្លឹក 1! R6C4

source: ADDRESS(6; 4; 4; TRUE; "Sheet1") returns Sheet1!D6
km: ADDRESS (6; 4; 4; TRUE; "Sheet1") ត្រឡប់សន្លឹក 1! D6

source: Returns the number of areas in the reference string. An area can be asingle cell or a set of cells.
km: ត្រឡប់ចំនួនផ្ទៃក្នុងខ្សែអក្សរយោង។ តំបន់មួយអាចជាកោសិកាអាសេទិកឬសំណុំកោសិកា។

source: AREAS(reference)
km: AREAS (យោង)

source: AREAS(A1) returns 1
km: AREAS (A1) ត្រឡប់ ១

source: AREAS((A1; A2:A4)) returns 2
km: AREAS ((A1; A2: A4)) ត្រឡប់ ២

source: Returns information about position, formatting or contents in a reference.
km: ត្រឡប់ព័ត៌មានអំពីទីតាំងទ្រង់ទ្រាយឬមាតិកាក្នុងឯកសារយោង។

source: CELL(type; reference)
km: CELL (ប្រភេទ; ឯកសារយោង)

source: CELL("COL", C7) returns 3
km: CELL ("COL", C7) ត្រឡប់ ៣

source: CELL("ROW", C7) returns 7
km: CELL ("ROW", C7) ត្រឡប់ ៧

source: CELL("ADDRESS", C7) returns $C$7
km: CELL ("ADDRESS", C7) ត្រឡប់ $C $7

source: Returns the parameter specified by the index.
km: ត្រឡប់ប៉ារ៉ាម៉ែត្រដែលបានបញ្ជាក់ដោយលិបិក្រម។

source: CHOOSE(index; parameter1; parameter2;...)
km: CHOOSE (សន្ទស្សន៍; ប៉ារ៉ាម៉ែត្រ ១; ប៉ារ៉ាម៉ែត្រ ២; ... )

source: Index
km: សន្ទស្សន៍

source: Arguments
km: ការឈ្លោះប្រកែកគ្នា

source: CHOOSE(1; "1st"; "2nd") returns "1st"
km: CHOOSE (1; "1st"; "2nd") ត្រឡប់ "1st"

source: CHOOSE(2; 3; 2; 4) returns 2
km: ជ្រើសរើស (២; ៣, ២, ៤) ត្រឡប់ ២

source: The COLUMN function returns the column of given cell reference. If no parameter is specified the column of the current cell gets returned.
km: អនុគមន៍ COLUMN ត្រឡប់ជួរឈរនៃសេចក្តីយោងក្រឡាដែលបានផ្តល់។ ប្រសិនបើគ្មានប៉ារ៉ាម៉ែត្រត្រូវបានបញ្ជាក់ជួរឈរនៃក្រឡាបច្ចុប្បន្នត្រូវបានត្រឡប់មកវិញ។

source: COLUMN(reference)
km: COLUMN (ឯកសារយោង)

source: COLUMN(A1) returns 1
km: COLUMN (A1) ត្រឡប់ ១

source: COLUMN(D2) returns 4
km: COLUMN (D2) ត្រឡប់ ៤

source: <link linkend="ROW">ROW</link>&nbsp;
km: <link linkend="ROW"> ជួរដេក </link>&nbsp;

source: The COLUMNS function returns the number of columns in a reference.
km: មុខងារ COLUMNS ត្រឡប់ចំនួនជួរឈរក្នុងសេចក្តីយោង។

source: COLUMNS(reference)
km: COLUMNS (ឯកសារយោង)

source: COLUMNS(A1:C3) returns 3
km: COLUMNS (A1: C3) ត្រឡប់ 3

source: COLUMNS(D2) returns 1
km: COLUMNS (D2) ត្រឡប់ ១

source: Look for a matching value in the first row of the given table, and return the value of the indicated row.
km: រកមើលតម្លៃដែលត្រូវគ្នានៅជួរទីមួយនៃតារាងដែលបានផ្តល់ហើយត្រឡប់តម្លៃនៃជួរដេកដែលបានចង្អុលបង្ហាញ។

source: Looks up the 'lookup value' in the first row of the 'data source'. If a value matches, the value in the 'row' and the column, the value was found in, is returned. If 'sorted' is true (default), the first row is assumed to be sorted. The search will end, if the 'lookup value' is lower than the value, currently compared to.
km: រកមើល 'តម្លៃរកមើល' នៅជួរទីមួយនៃ 'ប្រភពទិន្នន័យ' ។ ប្រសិនបើតម្លៃត្រូវគ្នាតម្លៃនៅក្នុងជួរដេកនិងជួរឈរតម្លៃត្រូវបានរកឃើញនឹងត្រូវបានត្រឡប់មកវិញ។ ប្រសិនបើ 'តម្រៀប' ជាការពិត (លំនាំដើម) ជួរទីមួយត្រូវបានសន្មតថាត្រូវបានតម្រៀប។ ការស្វែងរកនឹងបញ្ចប់ប្រសិនបើ 'តម្លៃរកមើល' ទាបជាងតម្លៃបច្ចុប្បន្នបើប្រៀបធៀបទៅនឹង។

source: String/Numeric
km: ខ្សែអក្សរ / លេខ

source: HLOOKUP(Lookup value; data source; Row; Sorted)
km: HLOOKUP (តម្លៃរកមើល; ប្រភពទិន្នន័យ; ជួរដេក; តម្រៀប)

source: Lookup value
km: រកមើលតម្លៃ

source: Data source
km: ប្រភពទិន្នន័យ

source: Array
km: អារេ

source: <seg>Row</seg>
km: <seg> ជួរដេក </seg>

source: Sorted (optional)
km: តម្រៀប (ជាជម្រើស)

source: If a range is given, returns value stored in a given row/column. If one cell is given, which contains an array, then one element of the array is returned.
km: ប្រសិនបើជួរត្រូវបានផ្តល់តម្លៃត្រឡប់ដែលបានរក្សាទុកនៅក្នុងជួរដេក / ជួរឈរដែលបានផ្តល់ឱ្យ។ ប្រសិនបើក្រឡាមួយត្រូវបានផ្តល់ឱ្យដែលមានអារេបន្ទាប់មកធាតុមួយនៃអារេត្រូវបានត្រឡប់មកវិញ។

source: INDEX(cell, row, column)
km: INDEX (ក្រឡាជួរដេក)

source: Column
km: ជួរឈរ

source: INDEX(A1:C3;2;2), returns contents of B2
km: INDEX (A1: C3; 2; 2) ត្រឡប់មាតិកានៃ B2

source: INDEX(A1;2;2), if A1 is a result of array calculation, returns its (2,2) element.
km: INDEX (A1; 2; 2) ប្រសិនបើ A1 ជាលទ្ធផលនៃការគណនាអារេត្រឡប់ធាតុរបស់វា (2,2) ។

source: INDIRECT
km: ដោយឯករាជ្យ

source: Returns the content of the cell specified by the reference text. The second parameter is optional.
km: ត្រឡប់មាតិកានៃក្រឡាដែលបានបញ្ជាក់ដោយអត្ថបទយោង។ ប៉ារ៉ាម៉ែត្រទីពីរគឺស្រេចចិត្ត។

source: INDIRECT(referenceText, a1 style)
km: ភាពឯករាជ្យ (អត្ថបទយោង, រចនាប័ទ្ម ១)

source: INDIRECT(A1), A1 contains "B1", and B1 1 => returns 1
km: INDIRECT (A1), A1 មាន "B1", និង B1 1 =>; ត្រឡប់ ១

source: INDIRECT("A1"), returns content of A1
km: INDIRECT ("A1"), ត្រឡប់មាតិកានៃ A1

source: LOOKUP
km: រក​មើល

source: The LOOKUP function looks up the first parameter in the lookup vector. It returns a value in the result Vector with the same index as the matching value in the lookup vector. If value is not in the lookup vector it takes the next lower one. If no value in the lookup vector matches an error is returned. The lookup vector must be in ascending order and lookup and result vector must have the same size. Numeric values, string and boolean values are recognized. Comparison between strings is case-insensitive.
km: មុខងារ LOOKUP រកមើលប៉ារ៉ាម៉ែត្រដំបូងនៅក្នុងវ៉ិចទ័ររកមើល។ វាត្រឡប់តម្លៃនៅក្នុងវ៉ិចទ័រលទ្ធផលដែលមានសន្ទស្សន៍ដូចគ្នានឹងតម្លៃដែលត្រូវគ្នានៅក្នុងវ៉ិចទ័ររកមើល។ ប្រសិនបើតម្លៃមិននៅក្នុងវ៉ិចទ័ររកមើលវាត្រូវចំណាយទាបជាងបន្ទាប់។ ប្រសិនបើគ្មានតម្លៃនៅក្នុងវ៉ិចទ័ររកមើលត្រូវគ្នានឹងកំហុសត្រូវបានត្រឡប់។ វ៉ិចទ័ររកមើលត្រូវតែស្ថិតក្នុងលំដាប់ឡើងហើយរកមើលហើយវ៉ិចទ័រលទ្ធផលត្រូវតែមានទំហំដូចគ្នា។ តម្លៃលេខខ្សែអក្សរនិងតម្លៃប៊ូលីនត្រូវបានទទួលស្គាល់។ ការប្រៀបធៀបរវាងខ្សែអក្សរគឺជាករណីមិនសមហេតុផល។

source: LOOKUP(value; lookup vector; result vector)
km: LOOKUP (តម្លៃ; វ៉ិចទ័ររកមើលវ៉ិចទ័រលទ្ធផល)

source: Lookup vector
km: រកមើលវ៉ិចទ័រ

source: Result vector
km: វ៉ិចទ័រលទ្ធផល

source: LOOKUP(1.232; A1:A6; B1:B6) for A1 = 1, A2 = 2 returns the value of B1.
km: LOOKUP (1,232; A1: A6; B1: B6) សម្រាប់ A1 = 1, A2 = 2 ត្រឡប់តម្លៃនៃ B1 ។
