Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: The FISHER() function returns the Fisher transformation for x and creates a function close to a normal distribution.
km: អនុគមន៍ FISHER() ត្រឡប់ការផ្លាស់ប្តូរហ្វីសសម្រាប់ x ហើយបង្កើតមុខងារជិតនឹងការចែកចាយធម្មតា។

source: FISHER(number)
km: FISHER (ចំនួន)

source: FISHER(0.2859) equals 0.294096
km: FISHER (0.2859) ស្មើនឹង 0.294096

source: FISHER(0.8105) equals 1.128485
km: FISHER (០.៨១០៥) ស្មើនឹង ១.១២៨៤៨៥

source: The FISHERINV() function returns the inverse of the Fisher transformation for x and creates a function close to a normal distribution.
km: អនុគមន៍ FISHERINV() ត្រឡប់ការបំលែងច្រាសរបស់ហ្វីលីពសម្រាប់ x ហើយបង្កើតមុខងារជិតនឹងការបែងចែកធម្មតា។

source: FISHERINV(number)
km: FISHERINV (ចំនួន)

source: FISHERINV(0.2859) equals 0.278357
km: FISHERINV (0.2859) ស្មើនឹង 0.278357

source: FISHERINV(0.8105) equals 0.669866
km: FISHERINV (០.៨១០៥) ស្មើ ០.៦៦៩៨៦៦

source: Counts the number of values for each interval given by the border values in the second parameter.
km: រាប់ចំនួននៃតម្លៃសម្រាប់ចន្លោះពេលនីមួយៗដែលបានផ្តល់ដោយតម្លៃស៊ុមនៅក្នុងប៉ារ៉ាម៉ែត្រទីពីរ។

source: The values in the second parameter determine the upper boundaries of the intervals. The intervals include the upper boundaries. The returned array is a column vector and has one more element than the second parameter; the last element represents the number of all elements greater than the last value in second parameter. If the second parameter is empty, all values in the first parameter are counted.
km: តម្លៃនៅក្នុងប៉ារ៉ាម៉ែត្រទីពីរកំណត់ព្រំដែនខាងលើនៃចន្លោះពេល។ ចន្លោះពេលរួមមានព្រំដែនខាងលើ។ អារេដែលបានត្រឡប់មកវិញគឺជាវ៉ិចទ័រជួរឈរនិងមានធាតុមួយច្រើនជាងប៉ារ៉ាម៉ែត្រទីពីរ; ធាតុចុងក្រោយតំណាងឱ្យចំនួននៃធាតុទាំងអស់ធំជាងតម្លៃចុងក្រោយនៅក្នុងប៉ារ៉ាម៉ែត្រទីពីរ។ ប្រសិនបើប៉ារ៉ាម៉ែត្រទីពីរទទេតម្លៃទាំងអស់នៅក្នុងប៉ារ៉ាម៉ែត្រដំបូងត្រូវបានរាប់។

source: FREQUENCY(Range data; Range bins)
km: FREQUENCY (ជួរជួរ; ធុងជួរ)

source: Floating point values, that should be counted.
km: តម្លៃចំណុចអណ្តែតដែលគួរតែត្រូវបានរាប់។

source: Floating point values, representing the upper boundaries of the intervals.
km: តម្លៃចំណុចអណ្តែតដែលតំណាងឱ្យព្រំដែនខាងលើនៃចន្លោះពេល។

source: The GAMMADIST() function returns the gamma distribution.
km: អនុគមន៍ GAMMADIST() ត្រឡប់ការចែកចាយហ្គាម៉ា។

source: If the last parameter (cumulated) is 0, it calculates the density function; if it's 1, the distribution is returned.
km: ប្រសិនបើប៉ារ៉ាម៉ែត្រចុងក្រោយ (បូកបញ្ចូលគ្នា) គឺ 0 វាគណនាមុខងារដង់ស៊ីតេ; ប្រសិនបើវា ១ នោះការចែកចាយនឹងត្រូវប្រគល់មកវិញ។

source: The first three parameters must be positive.
km: ប៉ារ៉ាម៉ែត្របីដំបូងត្រូវតែវិជ្ជមាន។

source: GAMMADIST(number;alpha;beta;cumulated)
km: GAMMADIST (ចំនួន; អាល់ហ្វា; បែតា; បូកសរុប)

source: Cumulated flag
km: បង្រួមទង់

source: GAMMADIST(0.758;0.1;0.35;1) equals 0.995450
km: GAMMADIST (០.៧៥៨; ០.១; ០៣៥; ១) ស្មើ ០.៩៩៥៤៥០

source: GAMMADIST(0.758;0.1;0.35;0) equals 0.017179
km: GAMMADIST (០.៧៥៨; ០,១; ០៣៥; ០) ស្មើ ០.០១៧១៧៩

source: The GAMMAINV() function returns the unique number x >= 0 such that GAMMAINV(x;alpha;beta;TRUE()) = p.
km: អនុគមន៍ GAMMAINV() ត្រឡប់លេខតែមួយគត់ x >= 0 ដែល GAMMAINV (x; អាល់ហ្វា; បែតា; TRUE()) = ទំ។

source: GAMMAINV(number;alpha;beta)
km: GAMMAINV (ចំនួន; អាល់ហ្វា; បែតា)

source: GAMMADIST(GAMMAINV(0.1;3;4);3;4) equals 0.1
km: GAMMADIST (GAMMAINV (០.១; ៣; ៤), ៣, ៤) ស្មើ ០.១

source: GAMMADIST(GAMMAINV(0.3;3;4);3;4) equals 0.3
km: GAMMADIST (GAMMAINV (០.៣; ៣; ៤), ៣, ៤) ស្មើ ០.៣

source: The GAMMALN() function returns the natural logarithm of the gamma function: G(x). The number parameter must be positive.
km: អនុគមន៍ GAMMALN() ត្រឡប់លោការីតធម្មជាតិនៃអនុគមន៍ហ្គាម៉ា៖ G (x) ។ ប៉ារ៉ាម៉ែត្រលេខត្រូវតែវិជ្ជមាន។

source: GAMMALN(Number)
km: GAMMALN (លេខ)

source: GAMMALN(2) returns 0
km: GAMMALN (២) ត្រឡប់ ០

source: The GAUSS() function returns the integral values for the standard normal cumulative distribution.
km: អនុគមន៍ GAUSS() ត្រឡប់តម្លៃអាំងតេក្រាលសម្រាប់ការចែកចាយធម្មតាតៗគ្នា។

source: GAUSS(value)
km: GAUSS (តម្លៃ)

source: The number for which the integral value of standard normal distribution is to be calculated
km: ចំនួនដែលតម្លៃអាំងតេក្រាលនៃការចែកចាយធម្មតាត្រូវបានគណនា

source: GAUSS(0.25) equals 0.098706
km: GAUSS (០.២៥) ស្មើ ០.០៩៨៧០៦

source: The GEOMEAN() function returns the geometric mean of the given arguments. This is equal to the Nth root of the product of the terms.
km: អនុគមន៍ GEOMEAN() ត្រឡប់មធ្យមធរណីមាត្រនៃអាគុយម៉ង់ដែលបានផ្តល់។ នេះស្មើនឹងឫសទី N នៃផលិតផលនៃពាក្យ។

source: GEOMEAN(value; value;...)
km: GEOMEAN (តម្លៃ; តម្លៃ; ... )

source: GEOMEAN(21; 33; 54; 23) returns 30.45886
km: GEOMEAN (២១; ៣៣; ៥៤; ២៣) ត្រឡប់ ៣០.៤៥៨៨៦

source: The HARMEAN() function returns the harmonic mean of the N data points (N divided by the sum of the inverses of the data points).
km: មុខងារ HARMEAN() ត្រឡប់មធ្យមអាម៉ូនិកនៃចំណុចទិន្នន័យ N (N ចែកដោយផលបូកនៃការដាក់បញ្ច្រាសនៃចំនុចទិន្នន័យ) ។

source: HARMEAN(value; value;...)
km: HARMEAN (តម្លៃ; តម្លៃ; ... )

source: HARMEAN(21; 33; 54; 23) returns 28.588
km: HARMEAN (២១; ៣៣; ៥៤; ២៣) ត្រឡប់ ២៨.៥៨៨

source: The HYPGEOMDIST() function returns the hypergeometric distribution.
km: មុខងារ HYPGEOMDIST() ត្រឡប់ការចែកចាយអ៊ីដ្រាក្រាម។

source: Number of success in the sample
km: ចំនួនជោគជ័យក្នុងគំរូ

source: Number of success overall
km: ចំនួនជោគជ័យជាទូទៅ

source: Population size
km: ទំហំប្រជាជន

source: HYPGEOMDIST(2; 5; 6; 20) returns 0.3522
km: HYPGEOMDIST (២; ៥; ៦; ២០) ត្រឡប់ ០,៣៥២២

source: The INTERCEPT() function calculates the interception of the linear regression line with the y axis.
km: មុខងារ INTERCEPT() គណនាការស្ទាក់ចាប់នៃបន្ទាត់តំរែតំរង់លីនេអ៊ែរជាមួយអ័ក្ស y ។

source: y values (array)
km: តម្លៃ y (អារេ)

source: x values (array)
km: តម្លៃ x (អារេ)

source: The INVBINO() function returns the negative binomial distribution. The first parameter is the number of trials, the second parameter is the number of failures, and the third is the probability of failure. The number of trials should be larger than the number of failures and the probability should be smaller or equal to 1.
km: អនុគមន៍ INVBINO() ត្រឡប់ការបែងចែកអូណូម៉ាអវិជ្ជមាន។ ប៉ារ៉ាម៉ែត្រទីមួយគឺចំនួននៃការសាកល្បងប៉ារ៉ាម៉ែត្រទីពីរគឺចំនួននៃការបរាជ័យហើយទីបីគឺប្រូបាប៊ីលីតេនៃការបរាជ័យ។ ចំនួននៃការសាកល្បងគួរតែធំជាងចំនួននៃការបរាជ័យហើយប្រូបាប៊ីលីតេគួរតែតូចជាងឬស្មើ ១ ។

source: INVBINO(trials;failure;prob_of_failure)
km: INVBINO (ការសាកល្បង; ការបរាជ័យ; ការសាកល្បងការងារ)

source: Number of failures
km: ចំនួននៃការបរាជ័យ

source: Probability of failure
km: ប្រូបាប៊ីលីតេនៃការបរាជ័យ

source: INVBINO(12;3;0.2) returns 0.236223201
km: INVBINO (១២; ៣; ០,២) ត្រឡប់ ០,២៣៦២២៣២០

source: The KURT() function calculates an unbiased estimate of the kurtosis of a data set. You have to provide at least 4 values, otherwise an error is returned.
km: មុខងារ KURT() គណនាការប៉ាន់ស្មានមិនលំអៀងនៃ kurtosis នៃសំណុំទិន្នន័យ។ អ្នកត្រូវផ្តល់តម្លៃយ៉ាងតិច ៤ យ៉ាងបើមិនដូច្នេះទេមានកំហុសកើតឡើង។

source: KURT(value; value;...)
km: KURT (តម្លៃ; តម្លៃ; ... )

source: KURT(21; 33; 54; 23) returns 1.344239
km: KURT (២១; ៣៣; ៥៤; ២៣) ត្រឡប់ ១.៣៤៤២៣៩

source: The KURTP() function calculates an population kurtosis of a data set. You have to provide at least 4 values, otherwise an error is returned.
km: មុខងារ KURTP() គណនាចំនួនប្រជាជននៃសំណុំទិន្នន័យ។ អ្នកត្រូវផ្តល់តម្លៃយ៉ាងតិច ៤ យ៉ាងបើមិនដូច្នេះទេមានកំហុសកើតឡើង។

source: KURTP(value; value;...)
km: KURTP (តម្លៃ; តម្លៃ; ... )

source: KURTP(21; 33; 54; 23) returns -1.021
km: KURTP (២១; ៣៣; ៥៤; ២៣) ត្រឡប់ -១.០២១

source: The LARGE() function returns the k-th largest value from the data set.
km: អនុគមន៍ LARGE() ត្រឡប់តម្លៃធំបំផុត k-th ពីសំណុំទិន្នន័យ។

source: LARGE(range; k)
km: LARGE (ជួរ; k)

source: Position (from the largest)
km: ទីតាំង (ពីធំបំផុត)

source: A1: 3, A2: 1, A3: 5 => LARGE(A1:A3; 2) returns 3
km: A1: 3, A2: 1, A3: 5 =>; LARGE (A1: A3; 2) ត្រឡប់ 3

source: The LEGACYFDIST() function returns the f-distribution.
km: អនុគមន៍ LEGACYFDIST() ត្រឡប់ការចែកចាយ F ។

source: LEGACYFDIST(number;degrees_freedom_1;degrees_freedom_2)
km: LEGACYFDIST (ចំនួន; ដឺក្រេសេរីភាព ១; ដឺក្រេសេរី ២)

source: LEGACYFDIST(0.8;8;12) yields 0.61
km: LEGACYFDIST (០.៨; ៨; ១២) ផ្តល់ទិន្នផល ០.៦១

source: The LOGINV() function returns the inverse of the lognormal cumulative distribution.
km: អនុគមន៍ LOGINV() ត្រឡប់ការចែកបញ្ច្រាសនៃផលគុណតក្កវិជ្ជា។

source: LOGINV(p; mean; stdev)
km: LOGINV (ទំ; មធ្យម; stdev)

source: Probability
km: ប្រូបាប

source: Mean value of the standard logarithmic distribution
km: តម្លៃមធ្យមនៃការបែងចែកលោការីតគំរូ

source: Standard deviation of the standard logarithmic distribution
km: គម្លាតគំរូនៃការបែងចែកលោការីតស្តង់ដារ

source: LOGINV(0.1;0;1) equals 0.2776
km: LOGINV (០,១; ០; ១) ស្មើ ០,២៧៧៦

source: The LOGNORMDIST() function returns the cumulative lognormal distribution.
km: អនុគមន៍ LOGNORMDIST() ត្រឡប់ការចែកចាយឡូជីខលបន្ថែម។

source: LOGNORMDIST(Number;MV;STD)
km: LOGNORMDIST (ចំនួន; MV; STD)

source: Probability value for which the standard logarithmic distribution is to be calculated
km: តម្លៃប្រូបាបដែលការបែងចែកលោការីតស្តង់ដារត្រូវបានគណនា

source: LOGNORMDIST(0.1;0;1) equals 0.01
km: LOGNORMDIST (0.1; 0; 1) ស្មើនឹង 0,01

source: The MEDIAN() function calculates the median of all the values given as parameters. You can calculate the median of a range like MEDIAN(A1:B5) or a list of values like MEDIAN(12; 5; 12.5). Blank cells will be considered as a zero, and cells with text will be ignored.
km: MEDIAN() គណនាមេដ្យាននៃតម្លៃទាំងអស់ដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រ។ អ្នកអាចគណនាកម្រិតមធ្យមនៃជួរដូចជាមីឌៀ (អេ ១: ប៊ី ៥) ឬបញ្ជីតម្លៃដូចជាមីឌៀ (១២; ៥; ១២.៥) ។ ក្រឡាទទេនឹងត្រូវបានចាត់ទុកថាជាលេខសូន្យហើយក្រឡាដែលមានអត្ថបទនឹងមិនត្រូវបានអើពើទេ។

source: MEDIAN(value;value;...)
km: MEDIAN (តម្លៃ; តម្លៃ; ... )

source: Floating point value or range of values
km: តម្លៃចំណុចអណ្តែតឬជួរតម្លៃ

source: Floating point values or range of values
km: តម្លៃចំណុចអណ្តែតឬជួរតម្លៃ

source: MEDIAN(12; 5; 5.5) equals 5.5
km: MEDIAN (១២, ៥, ៥.៥) ស្មើ ៥.៥

source: MEDIAN(12; 7; 8;2) equals 7.5
km: MEDIAN (១២; ៧; ៨; ២) ស្មើ ៧.៥

source: The MODE() function returns the most frequently occurring value in the data set.
km: អនុគមន៍ MODE() ត្រឡប់តម្លៃដែលកើតឡើងញឹកញាប់បំផុតនៅក្នុងសំណុំទិន្នន័យ។

source: MODE(number; number2; ...)
km: MODE (លេខ; លេខ ២; ... )

source: Float
km: អណ្តែត

source: MODE(12; 14; 12; 15) returns 12
km: MODE(១២; ១៤; ១២; ១៥) ត្រឡប់ ១២

source: The NEGBINOMDIST() function returns the negative binomial distribution.
km: មុខងារ NEGBINOMDIST() ត្រឡប់ការបែងចែកអូណូម៉ាអវិជ្ជមាន។

source: NEGBINOMDIST(failures; success; prob_of_success)
km: NEGBINOMDIST (ការបរាជ័យ; ជោគជ័យ; probofsuccess)

source: NEGBINOMDIST(2;5;0.55) returns 0.152872629
km: NEGBINOMDIST (២; ៥; ០៥៥) ត្រឡប់ ០,១៥២៨៧២៦២៩

source: The NORMDIST() function returns the normal cumulative distribution.
km: មុខងារ NORMDIST() ត្រឡប់ការចែកចាយតៗគ្នា។

source: Number is the value of the distribution based on which the normal distribution is to be calculated.
km: ចំនួនជាតម្លៃនៃការចែកចាយដោយផ្អែកលើការចែកចាយធម្មតាដែលត្រូវគណនា។

source: MV is the linear middle of the distribution.
km: MV គឺជាខ្សែកណ្ដាលនៃការចែកចាយ។

source: STD is the standard deviation of the distribution.
km: STD គឺជាគម្លាតគំរូនៃការចែកចាយ។

source: K = 0 calculates the density function; K = 1 calculates the distribution.
km: K = 0 គណនាមុខងារដង់ស៊ីតេ; K = 1 គណនាការចែកចាយ។

source: NORMDIST(Number;MV;STD;K)
km: NORMDIST (ចំនួន; MV; STD; K)

source: Linear middle of the distribution
km: លីនេអ៊ែរកណ្តាលនៃការចែកចាយ

source: Standard deviation of the distribution
km: គម្លាតគំរូនៃការចែកចាយ

source: NORMDIST(0.859;0.6;0.258;0) equals 0.934236
km: NORMDIST (០.៨៥៩; ០,៦; ០,២៥៨; ០) ស្មើ ០.៩៣៤២៣៦

source: NORMDIST(0.859;0.6;0.258;1) equals 0.842281
km: NORMDIST (០.៨៥៩; ០,៦; ០,២៥៨; ១) ស្មើ ០.៨៤២២៨១

source: The NORMINV() function returns the inverse of the normal cumulative distribution. The number must be between 0 and 1 (non-inclusive) and STD must be positive.
km: មុខងារ NORMINV() ត្រឡប់ច្រាសបញ្ច្រាសនៃច្បាប់ចែកចាយតគ្នា។ លេខត្រូវតែនៅចន្លោះ ០ និង ១ (មិនរាប់បញ្ចូល) និងជំងឺកាមរោគត្រូវតែវិជ្ជមាន។

source: NORMINV(number;MV;STD)
km: NORMINV (ចំនួន; MV; STD)

source: Middle value in the normal distribution
km: តម្លៃកណ្តាលក្នុងការចែកចាយធម្មតា

source: Standard deviation of the normal distribution
km: គម្លាតគំរូនៃការចែកចាយធម្មតា

source: NORMINV(0.9;63;5) equals 69.41
km: NORMINV (០.៩; ៦៣; ៥) ស្មើ ៦៩,៤១

source: The NORMSDIST() function returns the standard normal distribution.
km: មុខងារ NORMSDIST() ត្រឡប់ការចែកចាយធម្មតាធម្មតា។

source: NORMSDIST(Number)
km: NORMSDIST (ចំនួន)

source: Value to which the standard normal distribution is calculated
km: តម្លៃដែលការបែងចែកធម្មតាស្តង់ដារត្រូវបានគណនា

source: NORMSDIST(1) equals 0.84
km: NORMSDIST (១) ស្មើនឹង ០.៨៤

source: The NORMSINV() function returns the inverse of the standard normal cumulative distribution. The number must be between 0 and 1 (non-inclusive).
km: មុខងារ NORMSINV() ត្រឡប់ការចែកបញ្ច្រាសនៃច្បាប់ចែកចាយតគ្នាធម្មតា។ លេខត្រូវតែស្ថិតនៅចន្លោះ ០ និង ១ (មិនរាប់បញ្ចូល) ។

source: NORMSINV(Number)
km: NORMSINV (ចំនួន)

source: NORMSINV(0.908789) returns 1.3333
km: NORMSINV (០.៩០៨៧៨៩) ត្រឡប់ ១.៣៣៣៣

source: The PEARSON() function calculates the correlation coefficient of two cell ranges. It is the same as the CORREL function.
km: មុខងារ PEARSON() គណនាមេគុណជាប់ទាក់ទងនៃជួរក្រឡាពីរ។ វាដូចគ្នានឹងមុខងារ CORREL ដែរ។

source: PEARSON(range1; range2)
km: PEARSON (ជួរ ១; ជួរ ២)

source: The PERCENTILE() function returns the x-th sample percentile of data values in Data. A percentile returns the scale value for a data series which goes from the smallest (alpha=0) to the largest value (alpha=1) of a data series. For alpha = 25%, the percentile means the first quartile; alpha = 50% is the MEDIAN. Blank cells will be considered as a zero, and cells with text will be ignored.
km: អនុគមន៍ PERCENTILE() ត្រឡប់គិតជាភាគរយ -០ ភាគរយនៃតម្លៃទិន្នន័យនៅក្នុងទិន្នន័យ។ មួយភាគរយត្រឡប់តម្លៃមាត្រដ្ឋានសម្រាប់ស៊េរីទិន្នន័យដែលពីតូចបំផុត (អាល់ហ្វា = ០) ដល់តម្លៃធំបំផុត (អាល់ហ្វា = ១) នៃស៊េរីទិន្នន័យ។ ចំពោះអាល់ហ្វា = 25 %, ភាគរយមានន័យថាភាគបួនដំបូង; អាល់ហ្វា = 50 % គឺជា MEDIAN ។ ក្រឡាទទេនឹងត្រូវបានចាត់ទុកថាជាលេខសូន្យហើយក្រឡាដែលមានអត្ថបទនឹងមិនត្រូវបានអើពើទេ។

source: PERCENTILE(data;alpha)
km: PERCENTILE (ទិន្នន័យ; អាល់ហ្វា)

source: Range of values
km: ជួរនៃតម្លៃ

source: The percentile value between 0 and 1, inclusive.
km: តម្លៃជាភាគរយរវាង ០ និង ១ បញ្ចូលគ្នា។

source: The PERMUT() function returns the number of permutations. The first parameter is the number of elements, and the second parameter is the number of elements used in the permutation.
km: មុខងារ PERMUT() ត្រឡប់ចំនួនអនុញ្ញាតិ។ ប៉ារ៉ាម៉ែត្រទី ១ គឺចំនួនធាតុហើយប៉ារ៉ាម៉ែត្រទី ២ គឺជាចំនួនធាតុដែលត្រូវប្រើក្នុងការអនុញ្ញាត។

source: PERMUT(total;permutated)
km: PERMUT (សរុប; អនុញ្ញាត)

source: Number of elements to permutate
km: ចំនួនធាតុដែលត្រូវអនុញ្ញាត

source: PERMUT(8;5) equals 6720
km: PERMUT (៨; ៥) ស្មើនឹង ៦៧២០

source: PERMUT(1;1) equals 1
km: PERMUT (១; ១) ស្មើ ១

source: The PERMUTATIONA() function returns the number of ordered permutations when allowing repetition. The first parameter is the number of elements, and the second parameter is the number of elements to choose. Both parameters must be positive.
km: អនុគមន៍ PERMUTATIONA() ត្រឡប់ចំនួនអនុញ្ញាតិដែលបានបញ្ជាទិញនៅពេលអនុញ្ញាតឱ្យមានពាក្យដដែលៗ។ ប៉ារ៉ាម៉ែត្រទីមួយគឺជាចំនួនធាតុហើយប៉ារ៉ាម៉ែត្រទីពីរគឺជាចំនួនធាតុដែលត្រូវជ្រើសរើស។ ប៉ារ៉ាម៉ែត្រទាំងពីរត្រូវតែវិជ្ជមាន។

source: PERMUTATIONA(total;chosen)
km: PERMUTATIONA (សរុប; បានជ្រើសរើស)

source: PERMUTATIONA(2,3) returns 8
km: PERMUTATIONA (2,3) ត្រឡប់ 8

source: PERMUTATIONA(0,0) returns 1
km: PERMUTATIONA (០,០) ត្រឡប់ ១

source: The PHI() function returns value of the distribution function for a standard normal distribution.
km: អនុគមន៍ PHI() ត្រឡប់តម្លៃនៃអនុគមន៍ចែកចាយសម្រាប់ការចែកចាយធម្មតាធម្មតា។

source: PHI(value)
km: PHI (តម្លៃ)

source: The number for which the standard normal distribution is to be calculated
km: ចំនួនដែលការបែងចែកធម្មតាស្តង់ដារត្រូវបានគណនា

source: PHI(0.25) equals 0.386668
km: PHI (០.២៥) ស្មើនឹង ០៣៨៦៦៦៨

source: The POISSON() function returns the Poisson distribution.
km: មុខងារ POISSON() ត្រឡប់ការចែកចាយប៉ោយសុន។

source: The lambda and number parameters must be positive.
km: ប៉ារ៉ាម៉ែត្រឡាំដានិងលេខត្រូវតែវិជ្ជមាន។

source: POISSON(number;lambda;cumulative)
km: POISSON (ចំនួន; lambda; កើន)

source: Lambda parameter (the middle value)
km: ប៉ារ៉ាម៉ែត្រឡាំដា (តម្លៃកណ្ដាល)

source: POISSON(60;50;0) equals 0.020105
km: POISSON (៦០; ៥០; ០) ស្មើ ០.០២០២០៥

source: POISSON(60;50;1) equals 0.927840
km: POISSON (៦០; ៥០; ១) ស្មើ ០.៩២៧៨៤០

source: The RANK() function returns the rank of a number in a list of numbers.
km: មុខងារ RANK() ត្រឡប់លំដាប់លេខនៅក្នុងបញ្ជីលេខ។

source: Order specifies how to rank the numbers:
km: ការបញ្ជាទិញបញ្ជាក់ពីរបៀបដាក់លេខ៖

source: If 0 or omitted, Data is ranked in descending order.
km: ប្រសិនបើលេខ ០ ឬលុបចោលទិន្នន័យត្រូវបានចាត់ថ្នាក់តាមលំដាប់ចុះ។

source: If not 0, Data is ranked in ascending order.
km: ប្រសិនបើមិនមែនលេខ ០ ទិន្នន័យត្រូវបានចាត់ថ្នាក់តាមលំដាប់ឡើង។

source: RSQ(Value; Data; Order)
km: RSQ (តម្លៃទិន្នន័យទិន្នន័យលំដាប់)

source: Data (array)
km: ទិន្នន័យ (អារេ)

source: Order
km: បញ្ជាទិញ

source: RANK (2;{1;2;3}) equals 2
km: RANK (២; {១; ២; ៣}) ស្មើ ២

source: The RSQ() function returns the square of the Pearson product moment correlation coefficient through data points in known_y's and known_x's.
km: មុខងារ RSQ() ត្រឡប់ការេនៃមេគុណផុនសុននៅពេលនេះផលិតផលជាប់ទាក់ទងគ្នាតាមរយៈចំណុចទិន្នន័យក្នុងតំបន់ស៊ីដនីនិងស៊ីល។

source: If "arrayY" and "arrayX" are empty or have a different number of data points, then #N/A is returned.
km: ប្រសិនបើ "arrayY" និង "arrayX" ទទេឬមានចំនួនទិន្នន័យខុសគ្នានោះលេខ #N/A ត្រូវបានត្រឡប់។

source: RSQ(known Y; known X)
km: RSQ (ស្គាល់ Y និងស្គាល់ X)

source: known Y (array)
km: បានស្គាល់ Y (អារេ)

source: known X (array)
km: បានស្គាល់ថា X (អារេ)

source: The SKEW() function returns an estimate for skewness of a distribution
km: មុខងារ SKEW() ត្រឡប់ការប៉ាន់ស្មានសម្រាប់ភាពឆបគ្នានៃការចែកចាយ

source: SKEW(number; number2; ...)
km: SKEW (លេខ; លេខ ២; ... )

source: SKEW(11.4; 17.3; 21.3; 25.9; 40.1) returns 0.9768
km: SKEW (១១.៤; ១៧.៣; ២១.៣; ២៥.៩; ៤០.១) ត្រឡប់ ០.៩៧៦៨

source: The SKEWP() function returns the population skewness of a distribution
km: មុខងារ SKEWP() ត្រឡប់ភាពងឿងឆ្ងល់របស់ប្រជាជននៃការចែកចាយ

source: SKEWP(number; number2; ...)
km: SKEWP (លេខ; លេខ ២; ... )

source: SKEWP(11.4; 17.3; 21.3; 25.9; 40.1) returns 0.6552
km: SKEWP (១១.៤; ១៧.៣; ២១.៣; ២៥.៩; ៤០.១) ត្រឡប់ ០.៦៥៥២

source: The SLOPE() function calculates the slope of the linear regression line.
km: មុខងារ SLOPE() គណនាជម្រាលនៃបន្ទាត់តំរែតំរង់លីនេអ៊ែរ។

source: The SMALL() function returns the k-th smallest value from the data set.
km: អនុគមន៍ SMALL() ត្រឡប់តម្លៃតូចបំផុតរបស់ k-th ពីសំណុំទិន្នន័យ។

source: SMALL(range; k)
km: SMALL (ជួរ; k)

source: Position (from the smallest)
km: ទីតាំង (ពីតូចបំផុត)

source: A1: 3, A2: 1, A3: 5 => SMALL(A1:A3; 1) returns 1
km: A1: 3, A2: 1, A3: 5 =>; តូច (A1: A3; 1) ត្រឡប់ 1

source: The STANDARDIZE() function calculates a normalized value.
km: មុខងារ STANDARDIZE() គណនាតម្លៃធម្មតា។

source: STANDARDIZE(x; mean, stdev)
km: STANDARDIZE (x; មធ្យម, stdev)

source: Number to be normalized
km: លេខដែលត្រូវធ្វើឱ្យមានលក្ខណៈធម្មតា

source: Mean of the distribution
km: អត្ថន័យនៃការចែកចាយ

source: Standard deviation
km: គម្លាតគំរូ

source: STANDARDIZE(4; 3; 7) returns 0.1429
km: STANDARDIZE (4; 3; 7) ត្រឡប់ 0.1429

source: The STDEV() function returns the estimate standard deviation based on a sample. The standard deviation is a measure of how widely values are dispersed from the average value.
km: អនុគមន៍ STDEV() ត្រឡប់គម្លាតគំរូប៉ាន់ស្មានផ្អែកលើគំរូ។ គម្លាតគំរូគឺជារង្វាស់នៃរបៀបដែលតម្លៃត្រូវបានបែកខ្ចាត់ខ្ចាយពីតម្លៃមធ្យម។

source: STDEV(value;value;...)
km: STDEV (តម្លៃ; តម្លៃ; ... )

source: STDEV(6;7;8) equals 1
km: STDEV (៦; ៧; ៨) ស្មើ ១

source: The STDEVA() function returns the estimate standard deviation based on a sample. The standard deviation is a measure of how widely values are dispersed from the average value. If a referenced cell contains text or contains the boolean value FALSE, it is counted as 0. If the boolean value is TRUE it is counted as 1.
km: មុខងារ STDEVA() ត្រឡប់គម្លាតគំរូប៉ាន់ស្មានផ្អែកលើគំរូមួយ។ គម្លាតគំរូគឺជារង្វាស់នៃរបៀបដែលតម្លៃត្រូវបានបែកខ្ចាត់ខ្ចាយពីតម្លៃមធ្យម។ ប្រសិនបើក្រឡាដែលបានយោងមានអត្ថបទឬមានតម្លៃប៊ូលីន FALSE វាត្រូវបានរាប់ជា ០ ប្រសិនបើតម្លៃប៊ូលីនគឺពិតវាត្រូវបានរាប់ជា ១ ។

source: STDEVA(value;value;...)
km: STDEVA (តម្លៃ; តម្លៃ; ... )

source: STDEVA(6; 7; A1; 8) equals 1, if A1 is empty
km: STDEVA (6; 7; A1; 8) ស្មើ 1 ប្រសិនបើ A1 ទទេ

source: STDEVA(6; 7; A1; 8) equals 3.109, if A1 is TRUE
km: STDEVA (៦; ៧; ក ១; ៨) ស្មើ ៣.១០៩ បើអេ ១ ពិត

source: The STDEVP() function returns the standard deviation based on an entire population
km: មុខងារ STDEVP() ត្រឡប់គម្លាតគំរូផ្អែកលើប្រជាជនទាំងមូល

source: STDEVP(value;value;...)
km: STDEVP (តម្លៃ; តម្លៃ; ... )

source: STDEVP(6;7;8) equals 0.816497...
km: STDEVP (៦; ៧; ៨) ស្មើ ០.៨១៦៤៩៧ …

source: The STDEVPA() function returns standard deviation based on an entire population. If a referenced cell contains text or contains the boolean value FALSE, it is counted as 0. If the boolean value is TRUE it is counted as 1.
km: មុខងារ STDEVPA() ត្រឡប់គម្លាតស្តង់ដារផ្អែកលើចំនួនប្រជាជនទាំងមូល។ ប្រសិនបើក្រឡាដែលបានយោងមានអត្ថបទឬមានតម្លៃប៊ូលីន FALSE វាត្រូវបានរាប់ជា ០ ប្រសិនបើតម្លៃប៊ូលីនគឺពិតវាត្រូវបានរាប់ជា ១ ។

source: STDEVPA(value;value;...)
km: STDEVPA (តម្លៃ; តម្លៃ; ... )

source: STDEVPA(6; 7; A1; 8) equals 0.816497..., if A1 is empty
km: STDEVPA (៦; ៧; ក ១; ៨) ស្មើ ០.៨១៦៤៩៧ ... បើអា ១ ទទេ

source: STDEVPA(6; 7; A1; 8) equals 2.69..., if A1 is TRUE
km: STDEVPA (៦; ៧; ក ១; ៨) ស្មើ ២,៦៩ ... បើអេ ១ ពិត

source: STDEVPA(6; 7; A1; 8) equals 3.11..., if A1 is FALSE
km: STDEVPA (៦; ៧; ក ១; ៨) ស្មើ ៣,១១ ... បើអេ ១ គឺមិនពិត

source: The STEYX() function calculates the standard error of the predicted y value for each x in the regression.
km: មុខងារ STEYX() គណនាកំហុសស្តង់ដារនៃតម្លៃ y ដែលបានព្យាករសម្រាប់ x នីមួយៗក្នុងតំរែតំរង់។

source: The SUMPRODUCT() function (SUM(X*Y)) returns the sum of the product of these values. The number of values in the two arrays should be equal. Otherwise this function returns Err.
km: អនុគមន៍ SUMPRODUCT() (SUM (X * Y)) ត្រឡប់ផលបូកនៃផលគុណនៃតម្លៃទាំងនេះ។ ចំនួននៃតំលៃនៅក្នុងអារេទាំងពីរគួរតែស្មើគ្នា។ បើមិនដូច្នោះទេមុខងារនេះត្រឡប់អេរី។

source: SUMPRODUCT(array1;array2)
km: SUMPRODUCT (អារេ ១; អារេ ២)

source: Value (array)
km: តម្លៃ (អារេ)

source: SUMPRODUCT(A1:A2;B1:B2) with A1=2, A2=5, B1=3 and B2=5, returns 31
km: SUMPRODUCT (A1: A2; B1: B2) ជាមួយ A1 = 2, A2 = 5, B1 = 3 និង B2 = 5, ត្រឡប់ 31

source: The SUMX2MY2() function (SUM(X^2-Y^2)) returns the difference of the squares of these values. The number of values in the two arrays should be equal. Otherwise this function returns Err.
km: មុខងារ SUMX2MY2() (SUM (X ^ 2-Y ^ 2)) ត្រឡប់ភាពខុសគ្នានៃការ៉េនៃតម្លៃទាំងនេះ។ ចំនួននៃតំលៃនៅក្នុងអារេទាំងពីរគួរតែស្មើគ្នា។ បើមិនដូច្នោះទេមុខងារនេះត្រឡប់អេរី។

source: SUMX2MY2(array1;array2)
km: SUMX2MY2 (អារេ ១; អារេ ២)

source: SUMX2MY2(A1:A2;B1:B2) with A1=2, A2=5, B1=3 and B2=5, returns -5
km: SUMX2MY2 (A1: A2; B1: B2) ជាមួយ A1 = 2, A2 = 5, B1 = 3 និង B2 = 5, ត្រឡប់ -5

source: The SUMX2PY2() function (SUM(X^2+Y^2)) returns the sum of the squares of these values. The number of values in the two arrays should be equal. Otherwise this function returns Err.
km: អនុគមន៍ SUMX2PY2() (SUM (X ^ 2 + Y ^ 2)) ត្រឡប់ផលបូកនៃការ៉េនៃតម្លៃទាំងនេះ។ ចំនួននៃតំលៃនៅក្នុងអារេទាំងពីរគួរតែស្មើគ្នា។ បើមិនដូច្នោះទេមុខងារនេះត្រឡប់អេរី។

source: SUMX2PY2(array1;array2)
km: SUMX2PY2 (អារេ ១; អារេ ២)

source: SUMX2PY2(A1:A2;B1:B2) with A1=2, A2=5, B1=3 and B2=5, returns 63
km: SUMX2PY2 (A1: A2; B1: B2) ជាមួយ A1 = 2, A2 = 5, B1 = 3 និង B2 = 5, ត្រឡប់ 63
