Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: The ODD() function returns the number rounded up (or down, for negative values) to the nearest odd integer. By definition, ODD(0) is 1.
km: អនុគមន៍ ODD() ត្រឡប់លេខបានបង្គត់ឡើង (ឬចុះក្រោមសម្រាប់តម្លៃអវិជ្ជមាន) ទៅចំនួនគត់សេសជិតបំផុត។ តាមនិយមន័យអូឌីឌី (០) គឺ ១ ។

source: ODD(value)
km: ODD (តម្លៃ)

source: ODD(1.2) returns 3
km: ODD (១.២) ត្រឡប់ ៣

source: ODD(2) returns 3
km: ODD (២) ត្រឡប់ ៣

source: ODD(-2) returns -3
km: ODD (-២) ត្រឡប់ -៣

source: The POW(x;y) function returns the value of x raised to the power of y. It's the same as POWER.
km: អនុគមន៍ POW (x; y) ត្រឡប់តម្លៃនៃ x ដែលបានលើកឡើងទៅស្វ័យគុណ y ។ វាដូចគ្នានឹង POWER ដែរ។

source: POW(value;value)
km: POW (តម្លៃ; តម្លៃ)

source: POW(1.2;3.4) equals 1.8572
km: POW (១.២; ៣.៤) ស្មើនឹង ១.៨៥៧២

source: POW(2;3) equals 8
km: POW (២; ៣) ស្មើ ៨

source: The POWER(x;y) function returns the value of x raised to the power of y.
km: អនុគមន៍ POWER (x; y) ត្រឡប់តម្លៃនៃ x ដែលបានលើកឡើងទៅស្វ័យគុណ y ។

source: POWER(value;value)
km: POWER (តម្លៃ; តម្លៃ)

source: POWER(1.2;3.4) equals 1.8572
km: POWER (១.២; ៣.៤) ស្មើនឹង ១.៨៥៧២

source: POWER(2;3) equals 8
km: POWER (២; ៣) ស្មើ ៨

source: The PRODUCT() function calculates the product of all the values given as parameters. You can calculate the product of a range: PRODUCT(A1:B5) or a list of values like product(12;5;12.5). If no numeric values are found 0 is returned.
km: មុខងារ PRODUCT() គណនាផលិតផលនៃតម្លៃទាំងអស់ដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រ។ អ្នកអាចគណនាផលិតផលនៃជួរមួយ: PRODUCT (A1: B5) ឬបញ្ជីតម្លៃដូចជាផលិតផល (12, 5, 12.5) ។ ប្រសិនបើរកមិនឃើញតម្លៃលេខទេ ០ ត្រូវបានត្រឡប់។

source: PRODUCT(value;value;...)
km: PRODUCT(តម្លៃ; តម្លៃ; ... )

source: PRODUCT(3;5;7) equals 105
km: PRODUCT(៣; ៥; ៧) ស្មើនឹង ១០៥

source: PRODUCT(12.5;2) equals 25
km: PRODUCT(១២.៥; ២) ស្មើនឹង ២៥

source: Function QUOTIENT returns the integer portion of numerator/denumerator.
km: អនុគមន៍ QUOTIENT ត្រឡប់ផ្នែកចំនួនគត់នៃភាគយក / ភាគបែង។

source: QUOTIENT(numerator;denumerator)
km: QUOTIENT (ភាគយក; អ្នកបំបែក)

source: Numerator
km: លេខ

source: Denumerator
km: អ្នកនិទានកថា

source: QUOTIENT(21;4) returns 5
km: QUOTIENT (២១; ៤) ត្រឡប់ ៥

source: The RAND() function returns a pseudo-random number between 0 and 1.
km: អនុគមន៍ RAND() ត្រឡប់លេខចៃដន្យរវាង ០ និង ១ ។

source: RAND() equals for example 0.78309922...
km: RAND() ស្មើឧទាហរណ៍ ០.៧៨៣០៩៩២២ …

source: The RANDBERNOULLI() function returns a Bernoulli-distributed pseudo-random number.
km: អនុគមន៍ RANDBERNOULLI() ត្រឡប់លេខក្លែងបន្លំដែលចែកចាយដោយប៊ែរនូលី។

source: A floating point value (between 0 and 1)
km: តម្លៃចំណុចអណ្តែត (រវាង ០ និង ១)

source: RANDBERNOULLI(0.45)
km: RANDBERNOULLI (០.៤៥)

source: The RANDBETWEEN() function returns a pseudo-random number between bottom and top value. If bottom > top this function returns Err.
km: អនុគមន៍ RANDBETWEEN() ត្រឡប់ចំនួនចៃដន្យរវាងតម្លៃបាតនិងកំពូល។ ប្រសិនបើបាត > ខាងលើមុខងារនេះត្រឡប់ Err ។

source: RANDBETWEEN(bottom;top)
km: RANDBETWEEN (ខាងក្រោម; ខាងលើ)

source: Bottom value
km: តម្លៃបាត

source: Top value
km: តម្លៃកំពូល

source: RANDBETWEEN(12;78) equals for example 61.0811...
km: RANDBETWEEN (12; 78) ស្មើនឹងឧទាហរណ៍ 61.0811 ...

source: The RANDBINOM() function returns a binomially-distributed pseudo-random number.
km: អនុគមន៍ RANDBINOM() ត្រឡប់ចំនួនចៃដន្យដែលត្រូវបានចែកចាយជាលក្ខណៈទ្រង់ទ្រាយធំដោយចៃដន្យ។

source: Trials (greater 0)
km: ការសាកល្បង (ធំជាង ០)

source: RANDBINOM(4)
km: RANDBINOM(៤)

source: The RANDEXP() function returns an exponentially-distributed pseudo-random number.
km: អនុគមន៍ RANDEXP() ត្រឡប់លេខចៃដន្យដែលត្រូវបានចែកចាយស្វ័យគុណ។

source: A floating point value (greater 0)
km: តម្លៃចំណុចអណ្តែត (ធំជាង ០)

source: RANDEXP(0.88)
km: RANDEXP (០.៨៨)

source: The RANDNEGBINOM() function returns a negative binomially-distributed pseudo-random number.
km: អនុគមន៍ RANDNEGBINOM() ត្រឡប់លេខចៃដន្យដែលត្រូវបានចែកចាយដោយការបះបោរដោយចៃដន្យ។

source: Failures (greater 0)
km: ការបរាជ័យ (ធំជាង ០)

source: RANDNEGBINOM(4)
km: RANDNEGBINOM (៤)

source: The RANDNORM() function returns a Normal(Gaussian)-distributed pseudo-random number.
km: អនុគមន៍ RANDNORM() ត្រឡប់លេខកូដចៃដន្យដែលត្រូវបានចែកចាយ (Gaussian) ធម្មតា។

source: RANDNORM(mu; sigma)
km: RANDNORM(មូ; ស៊ីជីម៉ា)

source: Mean value of the normal distribution
km: តម្លៃមធ្យមនៃការចែកចាយធម្មតា

source: Dispersion of the normal distribution
km: ការបែកខ្ញែកនៃការបែងចែកធម្មតា

source: RANDNORM(0; 1)
km: RANDNORM(០; ១)

source: The RANDPOISSON() function returns a poisson-distributed pseudo-random number.
km: អនុគមន៍ RANDPOISSON() ត្រឡប់លេខសម្ងាត់ចៃដន្យដែលចែកចាយដោយ poisson ។

source: RANDPOISSON(4)
km: RANDPOISSON (៤)

source: The ROOTN() function returns the non-negative nth root of x.
km: អនុគមន៍ ROOTN() ត្រឡប់ឫសមិនអវិជ្ជមាននៃ x ។

source: ROOTN(9;2) equals 3
km: រ៉ូតធីន (៩; ២) ស្មើ ៣

source: ROUND
km: ជុំ

source: The ROUND(value;[digits]) function returns value rounded. Digits is the number of digits to which you want to round that number. If digits is zero or omitted, value is rounded up to the nearest integer. If digits is smaller than zero, the corresponding integer part of the number is rounded.
km: អនុគមន៍ ROUND (តម្លៃ; [ខ្ទង់]) ត្រឡប់តម្លៃមូល។ ខ្ទង់គឺជាចំនួនខ្ទង់ដែលអ្នកចង់ប្រមូលលេខនោះ។ ប្រសិនបើតួលេខគឺសូន្យឬលុបចោលតម្លៃត្រូវបានបង្គត់ទៅចំនួនគត់ជិតបំផុត។ ប្រសិនបើតួលេខតូចជាងសូន្យផ្នែកចំនួនគត់ដែលត្រូវគ្នានៃលេខត្រូវបានបង្គត់។

source: ROUND(value;[digits])
km: ROUND (តម្លៃ; [ខ្ទង់])

source: Digits
km: តួលេខ

source: ROUND(1.252;2) equals 1.25
km: ROUND (១.២៥២; ២) ស្មើនឹង ១.២៥

source: ROUND(-1.252;2) equals -1.25
km: ROUND (-1.252; 2) ស្មើនឹង -1.25

source: ROUND(1.258;2) equals 1.26
km: ROUND (១.២៥៨; ២) ស្មើនឹង ១.២៦

source: ROUND(-12.25;-1) equals -10
km: ROUND (-១២.២៥; -១) ស្មើ -១០

source: ROUND(-1.252;0) equals -1
km: ROUND (-1.252; 0) ស្មើ -1

source: The ROUNDDOWN(value;[digits]) function returns value rounded so that its absolute value is lesser. Digits is the number of digits to which you want to round that number. If digits is zero or omitted, value is rounded down to the nearest integer.
km: អនុគមន៍ ROUNDDOWN (តម្លៃ; [ខ្ទង់]) ត្រឡប់តម្លៃមូលដូច្នេះតម្លៃដាច់ខាតរបស់វាតិចជាង។ ខ្ទង់គឺជាចំនួនខ្ទង់ដែលអ្នកចង់ប្រមូលលេខនោះ។ ប្រសិនបើតួលេខគឺសូន្យឬលុបចោលតម្លៃត្រូវបានបង្គត់ចុះទៅចំនួនគត់ជិតបំផុត។

source: ROUNDDOWN(value;[digits])
km: ROUNDDOWN (តម្លៃ; [ខ្ទង់])

source: ROUNDDOWN(1.252) equals 1
km: ROUNDDOWN (១.២៥២) ស្មើ ១

source: ROUNDDOWN(1.252;2) equals 1.25
km: ROUNDDOWN (១.២៥២; ២) ស្មើនឹង ១.២៥

source: ROUNDDOWN(-1.252;2) equals -1.25
km: ROUNDDOWN (-1.252; 2) ស្មើនឹង -1.25

source: ROUNDDOWN(-1.252) equals -1
km: ROUNDDOWN (-1.252) ស្មើនឹង -1

source: The ROUNDUP(value;[digits]) function returns value rounded so that its absolute value is greater. Digits is the number of digits to which you want to round that number. If digits is zero or omitted, value is rounded up to the nearest integer.
km: អនុគមន៍ ROUNDUP (តម្លៃ; [ខ្ទង់]) ត្រឡប់តម្លៃមូលដូច្នេះតម្លៃដាច់ខាតរបស់វាធំជាង។ ខ្ទង់គឺជាចំនួនខ្ទង់ដែលអ្នកចង់ប្រមូលលេខនោះ។ ប្រសិនបើតួលេខគឺសូន្យឬលុបចោលតម្លៃត្រូវបានបង្គត់ទៅចំនួនគត់ជិតបំផុត។

source: ROUNDUP(value;[digits])
km: ROUNDUP (តម្លៃ; [ខ្ទង់])

source: ROUNDUP(1.252) equals 2
km: ROUNDUP (១.២៥២) ស្មើ ២

source: ROUNDUP(1.252;2) equals 1.26
km: ROUNDUP (១.២៥២; ២) ស្មើនឹង ១.២៦

source: ROUNDUP(-1.252;2) equals -1.26
km: ROUNDUP (-1.252; 2) ស្មើនឹង -1.26

source: ROUNDUP(-1.252) equals -2
km: ROUNDUP (-1.252) ស្មើ -2

source: The SERIESSUM() function returns the sum of a power series.
km: អនុគមន៍ SERIESSUM() ត្រឡប់ផលបូកនៃស៊េរីថាមពល។

source: SERIESSUM( X; N; M; Coefficients)
km: SERIESSUM (X; N; M; មេគុណ)

source: X the independent variable of the power series
km: X អថេរឯករាជ្យនៃស៊េរីថាមពល

source: N the initial power to which X is to be raised
km: N ថាមពលដំបូងដែល X ត្រូវបានលើកឡើង

source: M the increment by which to increase N for each term in the series
km: M ការកើនឡើងដែលបង្កើន N សម្រាប់ពាក្យនីមួយៗក្នុងស៊េរី

source: Coefficients a set of coefficients by which each successive power of the variable X is multiplied
km: មេគុណសំណុំនៃមេគុណដែលអំណាចបន្តបន្ទាប់គ្នានៃអថេរ X ត្រូវបានគុណ

source: SERIESSUM(2;0;2;{1;2}) return 9
km: SERIESSUM (២; ០; ២; {១; ២}) ត្រឡប់ ៩

source: This function returns -1 if the number is negative, 0 if the number is null and 1 if the number is positive.
km: មុខងារនេះត្រឡប់ -1 ប្រសិនបើលេខអវិជ្ជមាន 0 ប្រសិនបើលេខគឺទទេហើយ 1 ប្រសិនបើលេខវិជ្ជមាន។

source: SIGN(value)
km: SIGN (តម្លៃ)

source: SIGN(5) equals 1
km: SIGN (៥) ស្មើ ១

source: SIGN(0) equals 0
km: SIGN(០) ស្មើ ០

source: SIGN(-5) equals -1
km: SIGN(-៥) ស្មើ -១

source: The SQRT() function returns the non-negative square root of the argument. It is an error if the argument is negative.
km: មុខងារ SQRT() ត្រឡប់ឫសការ៉េដែលមិនមែនអវិជ្ជមាននៃអាគុយម៉ង់។ វាជាកំហុសប្រសិនបើអាគុយម៉ង់អវិជ្ជមាន។

source: SQRT(9) equals 3
km: SQRT(៩) ស្មើ ៣

source: SQRT(-9) is an error
km: SQRT (-៩) គឺជាកំហុសមួយ

source: The SQRTPI() function returns the non-negative square root of x * PI. It is an error if the argument is negative.
km: មុខងារ SQRTPI() ត្រឡប់ឫសការ៉េមិនអវិជ្ជមាននៃ x * PI ។ វាជាកំហុសប្រសិនបើអាគុយម៉ង់អវិជ្ជមាន។

source: SQRTPI(2) equals 2.506628
km: SQRTPI (២) ស្មើនឹង ២.៥០៦៦២៨

source: The SUBTOTAL() function returns a subtotal of a given list of arguments ignoring other subtotal results in there. Function can be one of the following numbers: 1 - Average, 2 - Count, 3 - CountA, 4 - Max, 5 - Min, 6 - Product, 7 - StDev, 8 - StDevP, 9 - Sum, 10 - Var, 11 - VarP.
km: មុខងារ SUBTOTAL() ត្រឡប់សរុបនៃបញ្ជីអាគុយម៉ង់ដែលបានផ្តល់ឱ្យដោយមិនអើពើលទ្ធផលសរុបរងផ្សេងទៀតនៅក្នុងនោះ។ មុខងារអាចជាលេខមួយក្នុងចំណោមលេខខាងក្រោម៖ ១ - មធ្យម, ២ - រាប់, ៣ - CountA, ៤ - អតិបរមា, ៥ - Min, ៦ - ផលិតផល, ៧ - StDev, ៨ - StDevP, ៩ - Sum, ១០ - Var, ១១ - VarP។

source: SUBTOTAL(function; value)
km: SUBTOTAL (មុខងារ; តម្លៃ)

source: Function
km: មុខងារ

source: If A1:A5 contains 7, 24, 23, 56 and 9:
km: ប្រសិនបើ A1: A5 មាន 7, 24, 23, 56 និង 9:

source: SUBTOTAL(1; A1:A5) returns 23.8
km: SUBTOTAL (1; A1: A5) ត្រឡប់ 23.8

source: SUBTOTAL(4; A1:A5) returns 56
km: SUBTOTAL (4; A1: A5) ត្រឡប់ 56

source: SUBTOTAL(9; A1:A5) returns 119
km: SUBTOTAL (9; A1: A5) ត្រឡប់ 119

source: SUBTOTAL(11; A1:A5) returns 307.76
km: SUBTOTAL (11; A1: A5) ត្រឡប់ 307.76

source: <title>SUM</title>
km: <title> ផលបូក </title>

source: The SUM() function calculates the sum of all the values given as parameters. You can calculate the sum of a range SUM(A1:B5) or a list of values like SUM(12;5;12.5).
km: មុខងារ SUM() គណនាផលបូកនៃតម្លៃទាំងអស់ដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រ។ អ្នកអាចគណនាផលបូកនៃជួរ SUM (A1: B5) ឬបញ្ជីតម្លៃដូចជា SUM (12, 5, 12.5) ។

source: SUM(value;value;...)
km: SUM (តម្លៃ; តម្លៃ; ... )

source: SUM(12;5;7) equals 24
km: SUM (១២; ៥; ៧) ស្មើនឹង ២៤

source: SUM(12.5;2) equals 14.5
km: SUM (១២.៥; ២) ស្មើនឹង ១៤.៥

source: <link linkend="SUMSQ">SUMSQ</link>&nbsp;
km: <link linkend="SUMSQ"> សាមសិប </link>&nbsp;

source: The SUMA() function calculates the sum of all the values given as parameters. You can calculate the sum of a range SUMA(A1:B5) or a list of values like SUMA(12;5;12.5). If a parameter contains text or the boolean value FALSE it is counted as 0, if a parameter evaluates to TRUE it is counted as 1.
km: មុខងារ SUMA() គណនាផលបូកនៃតម្លៃទាំងអស់ដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រ។ អ្នកអាចគណនាផលបូកនៃជួរ SUMA (A1: B5) ឬបញ្ជីតម្លៃដូចជា SUMA (12, 5, 12.5) ។ ប្រសិនបើប៉ារ៉ាម៉ែត្រមានអត្ថបទឬតម្លៃប៊ូលីនមិនពិតវាត្រូវបានរាប់ជា ០ ប្រសិនបើប៉ារ៉ាម៉ែត្រវាយតម្លៃទៅពិតវាត្រូវបានរាប់ជា ១ ។

source: SUMA(12;5; 7) equals 24
km: SUMA (១២; ៥; ៧) ស្មើនឹង ២៤

source: SUMA(12.5; 2; TRUE) equals 15.5
km: SUMA (១២.៥; ២; ពិត) ស្មើនឹង ១៥.៥

source: The SUMIF() function calculates the sum of all values given as parameters which match the criteria. The sum range is optional. If not supplied, the values in the check range are summed. The length of the check range should be equal or less than the length of the sum range.
km: មុខងារ SUMIF() គណនាផលបូកនៃតម្លៃទាំងអស់ដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រដែលត្រូវនឹងលក្ខណៈវិនិច្ឆ័យ។ ជួរបូកគឺស្រេចចិត្ត។ ប្រសិនបើមិនបានផ្គត់ផ្គង់ទេតម្លៃនៅក្នុងជួរពិនិត្យត្រូវបានសង្ខេប។ ប្រវែងនៃជួរត្រួតពិនិត្យគួរតែស្មើឬតិចជាងប្រវែងនៃជួរបូក។

source: SUMIF(checkrange;criteria;sumrange)
km: SUMIF (ឆែកឆេរ; លក្ខណៈវិនិច្ឆ័យ; ជួរដេក)

source: Check range
km: ពិនិត្យជួរ

source: Sum range
km: ជួរបូក

source: SUMIF(A1:A4;">1") sums all values in range A1:A4 which match >1
km: SUMIF (A1: A4; ">; 1") បូកបញ្ចូលតម្លៃទាំងអស់នៅក្នុងជួរ A1: A4 ដែលត្រូវគ្នាទៅនឹង 1

source: SUMIF(A1:A4;"=0";B1:B4) sums all values in range B1:B4 if the corresponding value in A1:A4 matches =0
km: SUMIF (A1: A4; " = 0"; B1: B4) បូកតម្លៃទាំងអស់ក្នុងជួរ B1: B4 ប្រសិនបើតម្លៃត្រូវគ្នានៅក្នុង A1: A4 ត្រូវគ្នានឹង = 0

source: The SUMSQ() function calculates the sum of all the squares of values given as parameters. You can calculate the sum of a range SUMSQ(A1:B5) or a list of values like SUMSQ(12;5;12.5).
km: មុខងារ SUMSQ() គណនាផលបូកនៃការ៉េទាំងអស់នៃតម្លៃដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រ។ អ្នកអាចគណនាផលបូកនៃជួរ SUMSQ (A1: B5) ឬបញ្ជីតម្លៃដូចជា SUMSQ (12; 5; 12.5) ។

source: SUMSQ(value;value;...)
km: SUMSQ (តម្លៃ; តម្លៃ; ... )

source: SUMSQ(12;5;7) equals 218
km: SUMSQ (១២; ៥; ៧) ស្មើនឹង ២១៨

source: SUMSQ(12.5;2) equals 173
km: SUMSQ (១២.៥; ២) ស្មើនឹង ១៧៣

source: Returns the transpose of a matrix, i.e. rows and columns of the matrix are exchanged.
km: ត្រឡប់ការបញ្ជូននៃម៉ាទ្រីសមួយពោលគឺជួរដេកនិងជួរឈររបស់ម៉ាទ្រីសត្រូវបានផ្លាស់ប្តូរ។

source: TRANSPOSE(matrix)
km: TRANSPOSE (ម៉ាទ្រីស)

source: TRANSPOSE(A1:C3)
km: ការផ្លាស់ប្តូរ (A1: C3)

source: The TRUNC() function truncates a numeric value to a certain precision. If the precision is omitted 0 is assumed.
km: មុខងារ TRUNC() កាត់តម្លៃជាលេខទៅនឹងភាពជាក់លាក់ជាក់លាក់។ ប្រសិនបើភាពជាក់លាក់ត្រូវបានលុបចោល ០ ត្រូវបានសន្មត។

source: TRUNC(value; precision)
km: TRUNC (តម្លៃ; ភាពជាក់លាក់)

source: Precision
km: ភាពជាក់លាក់

source: TRUNC(1.2) returns 1
km: TRUNC (១,២) ត្រឡប់ ១

source: TRUNC(213.232; 2) returns 213.23
km: TRUNC (213.232; 2) ត្រឡប់ 213.23

source: Statistical
km: ស្ថិតិ

source: The AVEDEV() function calculates the average of the absolute deviations of a data set from their mean.
km: មុខងារ AVEDEV() គណនាជាមធ្យមនៃគម្លាតដាច់ខាតនៃសំណុំទិន្នន័យពីមធ្យមរបស់ពួកគេ។

source: AVEDEV(value;value;...)
km: AVEDEV (តម្លៃ; តម្លៃ; ... )

source: Floating point values
km: តម្លៃចំណុចអណ្តែត

source: AVEDEV(11.4;17.3;21.3;25.9;40.1) returns 7.84
km: AVEDEV (១១.៤; ១៧.៣; ២១.៣; ២៥.៩; ៤០.១) ត្រឡប់ ៧.៨៤

source: The AVERAGE() function calculates the average of all the values given as parameters. You can calculate the average of a range AVERAGE(A1:B5) or a list of values like AVERAGE(12;5;12.5).
km: មុខងារ AVERAGE() គណនាជាមធ្យមនៃតម្លៃទាំងអស់ដែលបានផ្តល់ជាប៉ារ៉ាម៉ែត្រ។ អ្នកអាចគណនាមធ្យមនៃជួរ AVERAGE (A1: B5) ឬបញ្ជីតម្លៃដូចជា AVERAGE (12; 5; 12.5) ។

source: AVERAGE(value;value;...)
km: AVERAGE (តម្លៃ; តម្លៃ; ... )

source: AVERAGE(12;5;7) equals 8
km: AVERAGE (១២; ៥; ៧) ស្មើ ៨

source: AVERAGE(12.5;2) equals 7.25
km: AVERAGE (១២.៥; ២) ស្មើនឹង ៧.២៥

source: The AVERAGEA() calculates the average of the given arguments. Numbers, text and logical values are included in the calculation too. If the cell contains text or the argument evaluates to FALSE, it is counted as value zero (0). If the argument evaluates to TRUE, it is counted as one (1). Note that empty cells are not counted.
km: AVERAGEA() គណនាជាមធ្យមនៃអាគុយម៉ង់ដែលបានផ្តល់ឱ្យ។ លេខអត្ថបទនិងតម្លៃតក្កត្រូវបានរាប់បញ្ចូលក្នុងការគណនាផងដែរ។ ប្រសិនបើក្រឡាមានអត្ថបទឬអាគុយម៉ង់វាយតម្លៃទៅ FALSE វាត្រូវបានរាប់ជាតម្លៃសូន្យ (០) ។ ប្រសិនបើអាគុយម៉ង់វាយតម្លៃទៅពិតវាត្រូវបានរាប់ជាមួយ (1) ។ ចំណាំថាក្រឡាទទេមិនត្រូវបានរាប់។

source: AVERAGEA(value;value;...)
km: AVERAGEA (តម្លៃ; តម្លៃ; ... )

source: String values
km: តម្លៃខ្សែអក្សរ

source: AVERAGEA(11.4;17.3;"sometext";25.9;40.1) equals 18.94
km: AVERAGEA (១១.៤; ១៧.៣; "sometext"; ២៥.៩; ៤០.១) ស្មើនឹង ១៨.៩៤

source: The BETADIST() function returns the cumulative beta probability density function.
km: អនុគមន៍ BETADIST() ត្រឡប់អនុគមន៍ដង់ស៊ីតេប្រូបាបប្រូតេប៊ីលីកកើនឡើង។

source: The third and fourth parameters are optional. They set the lower and upper bounds, otherwise defaulting to 0.0 and 1.0 respectively.
km: ប៉ារ៉ាម៉ែត្រទីបីនិងទីបួនគឺស្រេចចិត្ត។ ពួកគេកំណត់ព្រំប្រទល់ខាងក្រោមនិងខាងលើបើមិនដូច្នេះទេកំណត់ទៅ ០.០ និង ១.០ រៀងៗខ្លួន។

source: BETADIST(number;alpha;beta;start;end;[cumulative=TRUE])
km: BETADIST (ចំនួន; អាល់ហ្វា; បែតា; ចាប់ផ្ដើម; បញ្ចប់; [កើន = = ពិត])

source: Alpha parameter
km: ប៉ារ៉ាម៉ែត្រអាល់ហ្វា

source: Beta parameter
km: ប៉ារ៉ាម៉ែត្របេតា

source: Start
km: ចាប់ផ្តើម

source: <seg>End</seg>
km: <seg> បញ្ចប់ </seg>

source: Cumulative
km: កើនឡើង

source: BETADIST(0.2859;0.2606;0.8105) equals 0.675444
km: BETADIST (0.2859; 0.2606; 0.8105) ស្មើ 0.675444

source: BETADIST(0.2859;0.2606;0.8105;0.2;0.9) equals 0.537856
km: BETADIST (0.2859; 0.2606; 0.8105; 0,2; 0.9) ស្មើនឹង 0.537856

source: The BETAINV() function returns the inverse of BETADIST(x;alpha;beta;a;b;TRUE()).
km: មុខងារ BETAINV() ត្រឡប់បញ្ច្រាស BETADIST (x; អាល់ហ្វា; បែតា; a; b; TRUE()) ។

source: The start and end parameters are optional. They set the lower and upper bounds, otherwise defaulting to 0.0 and 1.0 respectively.
km: ប៉ារ៉ាម៉ែត្រចាប់ផ្តើមនិងបញ្ចប់គឺស្រេចចិត្ត។ ពួកគេកំណត់ព្រំប្រទល់ខាងក្រោមនិងខាងលើបើមិនដូច្នេះទេកំណត់ទៅ ០.០ និង ១.០ រៀងៗខ្លួន។

source: BETAINV(number;alpha;beta [; start=0 [; end=1]])
km: BETAINV (ចំនួន; អាល់ហ្វា; បែតា [; ចាប់ផ្តើម = ០ [; បញ្ចប់ = ១]])

source: BETADIST(BETAINV(0.1;3;4);3;4) equals 0.1
km: BETADIST (BETAINV (0.1; 3; 4); 3; 4) ស្មើនឹង 0.1

source: BETADIST(BETAINV(0.3;3;4);3;4) equals 0.3
km: BETADIST (BETAINV (0.3; 3; 4); 3; 4) ស្មើ 0,3

source: The BINO() function returns the binomial distribution.
km: អនុគមន៍ BINO() ត្រឡប់ការចែកចាយប៊ីណាមី។

source: The first parameter is the number of trials, the second parameter is the number of successes, and the third is the probability of success. The number of trials should be greater than the number of successes and the probability should be smaller or equal to 1.
km: ប៉ារ៉ាម៉ែត្រទីមួយគឺចំនួននៃការសាកល្បងប៉ារ៉ាម៉ែត្រទីពីរគឺចំនួននៃភាពជោគជ័យហើយទីបីគឺប្រូបាប៊ីលីតេនៃភាពជោគជ័យ។ ចំនួននៃការសាកល្បងគួរតែធំជាងចំនួនជោគជ័យហើយប្រូបាប៊ីលីតេគួរតែតូចជាងឬស្មើ ១ ។

source: BINO(trials;success;prob_of_success)
km: BINO (ការសាកល្បងជោគជ័យជោគជ័យ probofsuccess)

source: Number of trials
km: ចំនួននៃការសាកល្បង

source: Number of successful trials
km: ចំនួននៃការសាកល្បងជោគជ័យ

source: Probability of success
km: ប្រូបាប៊ីលីតេនៃភាពជោគជ័យ

source: BINO(12;9;0.8) returns 0.236223201
km: BINO (១២; ៩; ០,៨) ត្រឡប់ ០,២៣៦២២៣២០

source: The CHIDIST() function returns the probability value from the indicated Chi square that a hypothesis is confirmed.
km: មុខងារ CHIDIST() ត្រឡប់តម្លៃប្រូបាប៊ីលីតេពីការ៉េជីដែលបានចង្អុលបង្ហាញដែលសម្មតិកម្មត្រូវបានបញ្ជាក់។

source: CHIDIST compares the Chi square value to be given for a random sample that is calculated from the sum of (observed value-expected value)^2/expected value for all values with the theoretical Chi square distribution and determines from this the probability of error for the hypothesis to be tested.
km: CHIDIST ប្រៀបធៀបតម្លៃការ៉េជីដែលត្រូវបានផ្តល់សម្រាប់គំរូចៃដន្យដែលត្រូវបានគណនាពីផលបូកនៃ (តម្លៃដែលបានរំពឹងទុក) - 2 / តម្លៃរំពឹងសម្រាប់តម្លៃទាំងអស់ជាមួយនឹងការបែងចែកទ្រឹស្តីជីការ៉េនិងកំណត់ពីប្រូបាប៊ីលីតេនៃកំហុសសម្រាប់ សម្មតិកម្មដែលត្រូវសាកល្បង។

source: CHIDIST(number;degrees_freedom)
km: CHIDIST (ចំនួន; ដឺក្រេសេរី)

source: Degrees of freedom
km: ដឺក្រេសេរី

source: CHIDIST(13.27;5) returns 0.021
km: CHIDIST (១៣.២៧; ៥) ត្រឡប់ ០.០២១

source: The COMBIN() function calculates the count of possible combinations. The first parameter is the total count of elements. The second parameter is the count of elements to choose. Both parameters should be positive and the first parameter should not be less than the second. Otherwise the function returns an error.
km: អនុគមន៍ COMBIN() គណនាចំនួនបន្សំដែលអាចមាន។ ប៉ារ៉ាម៉ែត្រដំបូងគឺជាចំនួនសរុបនៃធាតុ។ ប៉ារ៉ាម៉ែត្រទីពីរគឺជាចំនួនធាតុដែលត្រូវជ្រើសរើស។ ប៉ារ៉ាម៉ែត្រទាំងពីរគួរតែវិជ្ជមានហើយប៉ារ៉ាម៉ែត្រទីមួយមិនគួរតិចជាងទីពីរទេ។ បើមិនដូច្នោះទេមុខងារត្រឡប់កំហុស។

source: COMBIN(total;chosen)
km: COMBIN (សរុបដែលបានជ្រើសរើស)

source: Total number of elements
km: ចំនួនធាតុសរុប

source: Number of elements to choose
km: ចំនួនធាតុដែលត្រូវជ្រើសរើស

source: COMBIN(12;5) returns 792
km: COMBIN (12; 5) ត្រឡប់ 792

source: COMBIN(5;5) returns 1
km: COMBIN (5; 5) ត្រឡប់ 1

source: The COMBINA() function calculates the count of possible combinations. The first parameter is the total count of elements. The second parameter is the count of elements to choose. Both parameters should be positive and the first parameter should not be less than the second. Otherwise the function returns an error.
km: អនុគមន៍ COMBINA() គណនាចំនួនបន្សំដែលអាចមាន។ ប៉ារ៉ាម៉ែត្រដំបូងគឺជាចំនួនសរុបនៃធាតុ។ ប៉ារ៉ាម៉ែត្រទីពីរគឺជាចំនួនធាតុដែលត្រូវជ្រើសរើស។ ប៉ារ៉ាម៉ែត្រទាំងពីរគួរតែវិជ្ជមានហើយប៉ារ៉ាម៉ែត្រទីមួយមិនគួរតិចជាងទីពីរទេ។ បើមិនដូច្នោះទេមុខងារត្រឡប់កំហុស។

source: The CONFIDENCE() function returns the confidence interval for a population mean.
km: មុខងារ CONFIDENCE() ត្រឡប់ចន្លោះជឿទុកចិត្តសម្រាប់មធ្យមប្រជាជន។

source: The alpha parameter must be between 0 and 1 (non-inclusive), stddev must be positive and size must be greater or equal to 1.
km: ប៉ារ៉ាម៉ែត្រអាល់ហ្វាត្រូវតែស្ថិតនៅចន្លោះ 0 និង 1 (មិនរាប់បញ្ចូល) stddev ត្រូវតែវិជ្ជមានហើយទំហំត្រូវតែធំជាងឬស្មើ 1 ។

source: CONFIDENCE(alpha;stddev;size)
km: CONFIDENCE (អាល់ហ្វា; stddev; ទំហំ)

source: Level of the confidence interval
km: កម្រិតនៃចន្លោះជឿជាក់

source: Standard deviation for the total population
km: គម្លាតគំរូសម្រាប់ប្រជាជនសរុប

source: Size of the total population
km: ទំហំនៃចំនួនប្រជាជនសរុប

source: CONFIDENCE(0.05;1.5;100) equals 0.294059
km: CONFIDENCE (០.០៥; ១.៥; ១០០) ស្មើ ០,២៩៤០៥៩

source: The CORREL() function calculates the correlation coefficient of two cell ranges.
km: មុខងារ CORREL() គណនាមេគុណជាប់ទាក់ទងនៃជួរក្រឡាពីរ។

source: CORREL(range1; range2)
km: CORREL (ជួរ ១; ជួរ ២)

source: Cell range of values
km: ជួរក្រឡានៃតម្លៃ

source: Second cell range of values
km: ជួរក្រឡាទីពីរនៃតម្លៃ

source: The COVAR() function calculates the covariance of two cell ranges.
km: អនុគមន៍ COVAR() គណនាវ៉ារ្យង់នៃជួរក្រឡាពីរ។

source: COVAR(range1; range2)
km: COVAR(ជួរ ១ ជួរទី ២)

source: The DEVSQ() function calculates the sum of squares of deviations.
km: មុខងារ DEVSQ() គណនាផលបូកការ៉េនៃគម្លាត។

source: DEVSQ(value; value;...)
km: DEVSQ (តម្លៃ; តម្លៃ; ... )

source: DEVSQ(21; 33; 54; 23) returns 684.75
km: DEVSQ (21; 33; 54; 23) ត្រឡប់ 684.75

source: The EXPONDIST() function returns the exponential distribution.
km: អនុគមន៍ EXPONDIST() ត្រឡប់ការចែកស្វ័យគុណ។

source: The lambda parameter must be positive.
km: ប៉ារ៉ាម៉ែត្រឡាដាដាត្រូវតែវិជ្ជមាន។

source: Cumulative = 0 calculates the density function; cumulative = 1 calculates the distribution.
km: សន្សំ = ០ គណនាមុខងារដង់ស៊ីតេ; សន្សំ = ១ គណនាការចែកចាយ។

source: EXPONDIST(number;lambda;cumulative)
km: EXPONDIST (ចំនួន; ឡាំដា; កើន)

source: Lambda parameter
km: ប៉ារ៉ាម៉ែត្រឡាំដា

source: 0 = density, 1 = distribution
km: 0 = ដង់ស៊ីតេ, ១ = ការចែកចាយ

source: EXPONDIST(3;0.5;0) equals 0.111565
km: EXPONDIST (3; 0,5; 0) ស្មើនឹង 0.111565

source: EXPONDIST(3;0.5;1) equals 0.776870
km: EXPONDIST (៣; ០៥; ១) ស្មើ ០.៧៧៦៨៧០

source: The FDIST() function returns the f-distribution.
km: មុខងារ FDIST() ត្រឡប់ការចែកចាយ F ។

source: FDIST(number;degrees_freedom_1;degrees_freedom_2)
km: FDIST (ចំនួន; ដឺក្រេសេរី ១; ដឺក្រេសេរី ២)

source: Degrees of freedom 1
km: ដឺក្រេសេរី ១

source: Degrees of freedom 2
km: ដឺក្រេសេរី ២

source: FDIST(0.8;8;12) yields 0.61
km: FDIST (០,៨; ៨; ១២) ទិន្នផល ០,៦១

source: The FINV() function returns the unique non-negative number x such that FDIST(x;r1;r2) = p.
km: មុខងារ FINV() ត្រឡប់លេខមិនមែនអវិជ្ជមានលេខ X ដូចជា FDIST (x; r1; r2) = ទំ។

source: FINV(number; r1; r2)
km: FINV (ចំនួន; r1; r2)

source: Number r1
km: លេខ r1

source: Number r2
km: លេខ r2

source: FDIST(FINV(0.1;3;4);3;4) equals 0.1
km: FDIST (FINV (0.1; 3; 4); 3; 4) ស្មើនឹង 0.1
