Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: Functions
km: មុខងារ

source: &sheets; has a huge range of built in mathematical and other functions that can be used in a formula cell.
km: សន្លឹក; មានជួរយ៉ាងច្រើននៃគណិតវិទ្យានិងមុខងារផ្សេងទៀតដែលអាចត្រូវបានប្រើនៅក្នុងកោសិការូបមន្ត។

source: Supported Functions
km: មុខងារដែលបានគាំទ្រ

source: This chapter holds a brief overview of all supported functions in the following groups:
km: ជំពូកនេះមានទិដ្ឋភាពសង្ខេបនៃមុខងារដែលបានគាំទ្រទាំងអស់នៅក្នុងក្រុមខាងក្រោម៖

source: <link linkend="Bit-Operations">Bit Operations</link>&nbsp;
km: <link linkend="Bit-Operations"> ប្រតិបត្តិការប៊ីត </link>&nbsp;

source: <link linkend="Conversion">Conversion</link>&nbsp;
km: <link linkend="Conversion"> ការប្រែចិត្តជឿ </link>&nbsp;

source: <link linkend="Database">Database</link>&nbsp;
km: <link linkend="Database"> មូលដ្ឋានទិន្នន័យ </link>&nbsp;

source: <link linkend="Date---Time">Date &amp; Time</link>&nbsp;
km: <link linkend="Date---Time"> កាលបរិច្ឆេទ &amp; ពេលវេលា </link>&nbsp;

source: <link linkend="Engineering">Engineering</link>&nbsp;
km: <link linkend="Engineering"> វិស្វកម្ម </link>&nbsp;

source: <link linkend="Financial">Financial</link>&nbsp;
km: <link linkend="Financial"> ហិរញ្ញវត្ថុ </link>&nbsp;

source: <link linkend="Information">Information</link>&nbsp;
km: <link linkend="Information"> ព័ត៌មាន </link>&nbsp;

source: <link linkend="Logical">Logical</link>&nbsp;
km: <link linkend="Logical"> ឡូជីខល </link>&nbsp;

source: <link linkend="Lookup---Reference">Lookup &amp; Reference</link>&nbsp;
km: <link linkend="Lookup---Reference"> រកមើល &amp; ឯកសារយោង </link>&nbsp;

source: <link linkend="Math">Math</link>&nbsp;
km: <link linkend="Math"> គណិតវិទ្យា </link>&nbsp;

source: <link linkend="Statistical">Statistical</link>&nbsp;
km: <link linkend="Statistical"> ស្ថិតិ </link>&nbsp;

source: <link linkend="Text">Text</link>&nbsp;
km: <link linkend="Text"> អត្ថបទ </link>&nbsp;

source: <link linkend="Trigonometric">Trigonometric</link>&nbsp;
km: <link linkend="Trigonometric"> ត្រីកោណមាត្រ </link>&nbsp;

source: Bit Operations
km: ប្រតិបត្តិការប៊ីត

source: The BITAND() function performs a bit-wise AND operation for the two integer parameters.
km: មុខងារ BITAND() អនុវត្តបន្តិចហើយប្រតិបត្តិសម្រាប់ប៉ារ៉ាម៉ែត្រចំនួនគត់ទាំងពីរ។

source: Return type
km: ប្រភេទត្រឡប់

source: Whole number (like 1, 132, 2344)
km: លេខទាំងមូល (ដូចលេខ ១, ១៣២, ២៣៤៤)

source: Syntax
km: វាក្យសម្ពន្ធ

source: BITAND(value; value)
km: BITAND (តម្លៃ; តម្លៃ)

source: Parameters
km: ប៉ារ៉ាម៉ែត្រ

source: Comment
km: វិចារ

source: <segtitle>Type</segtitle>
km: <segtitle> ប្រភេទ </segtitle>

source: First number
km: លេខដំបូង

source: Second number
km: លេខទីពីរ

source: Examples
km: ឧទាហរណ៍

source: BITAND(12;10) returns 8 (because decimal 12 is binary 1100, and decimal 10 is binary 1010; and 1100 "anded" with 1010 is 1000, which is integer 8).
km: BITAND (១២; ១០) ត្រឡប់ ៨ (ព្រោះលេខ ១២ ជាលេខគោល ១១០០ និង ១០ គោលដប់ជាលេខគោល ១០១០ និង ១១០០ "anded" ជាមួយ ១០១០ គឺ ១០០០ ដែលជាចំនួនគត់ ៨) ។

source: Related Functions
km: មុខងារដែលទាក់ទង

source: The BITLSHIFT() function performs a bit-wise left shift operation of the first parameter. The number of bits to shift by is specified by the second parameter. Note that a negative number of bits to left shift by becomes a right shift.
km: មុខងារ BITLSHIFT() អនុវត្តការផ្លាស់ប្តូរខាងឆ្វេងខាងឆ្វេងបន្តិចនៃប៉ារ៉ាម៉ែត្រដំបូង។ ចំនួនប៊ីតដើម្បីផ្លាស់ប្តូរដោយត្រូវបានបញ្ជាក់ដោយប៉ារ៉ាម៉ែត្រទីពីរ។ ចំណាំថាចំនួនអវិជ្ជមាននៃប៊ីតទៅការផ្លាស់ប្តូរខាងឆ្វេងដោយក្លាយជាការផ្លាស់ប្តូរខាងស្តាំ។

source: BITLSHIFT(value; shift size)
km: BITLSHIFT (តម្លៃ; ទំហំផ្លាស់ប្តូរ)

source: Amount to left shift by
km: ចំនួនទឹកប្រាក់នៃការផ្លាស់ប្តូរខាងឆ្វេងដោយ

source: The BITOR() function performs a bit-wise OR operation for the two integer parameters.
km: មុខងារ BITOR() អនុវត្តប្រតិបតិ្តការមួយដែលមានប្រាជ្ញាបន្តិចសម្រាប់ប៉ារ៉ាម៉ែត្រចំនួនគត់។

source: BITOR(value; value)
km: BITOR (តម្លៃ; តម្លៃ)

source: BITOR(12;10) returns 14 (because decimal 12 is binary 1100, and decimal 10 is binary 1010; and 1100 "ored" with 1010 is 1110, which is integer 14).
km: BITOR (១២; ១០) ត្រឡប់ ១៤ (ព្រោះលេខ ១២ ជាលេខគោល ១១០០ និង ១០ គោលដប់ជាលេខគោល ១០១០ និង ១១០០ "ored" ជាមួយ ១០១០ គឺ ១១១០ ដែលជាចំនួនគត់ ១៤) ។

source: The BITRSHIFT() function performs a bit-wise right shift operation of the first parameter. The number of bits to shift by is specified by the second parameter. Note that a negative number of bits to right shift by becomes a left shift.
km: មុខងារ BITRSHIFT() អនុវត្តការផ្លាស់ប្តូរខាងស្តាំបន្តិចនៃប៉ារ៉ាម៉ែត្រដំបូង។ ចំនួនប៊ីតដើម្បីផ្លាស់ប្តូរដោយត្រូវបានបញ្ជាក់ដោយប៉ារ៉ាម៉ែត្រទីពីរ។ ចំណាំថាចំនួនអវិជ្ជមាននៃប៊ីតទៅការផ្លាស់ប្តូរខាងស្តាំដោយក្លាយជាវេនខាងឆ្វេង។

source: BITRSHIFT(value; shift size)
km: BITRSHIFT (តម្លៃ; ទំហំផ្លាស់ប្តូរ)

source: Amount to right shift by
km: ចំនួនទឹកប្រាក់នៃការផ្លាស់ប្តូរខាងស្តាំដោយ

source: The BITXOR() function performs a bit-wise exclusive-OR operation for the two integer parameters.
km: មុខងារ BITXOR() អនុវត្តប្រតិបត្ដិការផ្តាច់មុខ - អាយដលមានប្រាជ្ញាបន្តិចសម្រាប់ប៉ារ៉ាម៉ែត្រចំនួនគត់ទាំងពីរ។

source: BITXOR(value; value)
km: BITXOR (តម្លៃ; តម្លៃ)

source: BITXOR(12;10) returns 6 (because decimal 12 is binary 1100, and decimal 10 is binary 1010; and 1100 "xored" with 1010 is 0110, which is integer 6).
km: BITXOR (12; 10) ត្រឡប់ 6 (ព្រោះលេខ ១២ ជាលេខគោល ១១០០ និងលេខ ១០ ជាលេខគោល ១០១០ និង ១១០០ "xored" ជាមួយ ១០១០ គឺ ០១១ ដែលជាចំនួន ៦) ។

source: Conversion
km: ការប្រែចិត្តជឿ

source: The ARABIC() function converts a roman numeral into a number.
km: មុខងារ ARABIC() បំលែងលេខរ៉ូម៉ាំងទៅជាលេខ។

source: ARABIC(Numeral)
km: ARABIC (នព្វន្ត)

source: Numeral
km: នព្វន្ត

source: <seg>Text</seg>
km: <seg> អត្ថបទ </seg>

source: ARABIC("IV") returns 4
km: ARABIC ("IV") ត្រឡប់ ៤

source: ARABIC("XCIX") returns 99
km: ARABIC ("XCIX") ត្រឡប់ ៩៩

source: The ASCIITOCHAR() function returns the character for each given ASCII code
km: មុខងារ ASCIITOCHAR() ត្រឡប់តួអក្សរសម្រាប់កូដ ASCII នីមួយៗដែលបានផ្តល់

source: ASCIITOCHAR(value)
km: ASCIITOCHAR (តម្លៃ)

source: The ASCII values to convert
km: តម្លៃ ASCII ដើម្បីបំលែង

source: ASCIITOCHAR(118) returns "v"
km: ASCIITOCHAR (១១៨) ត្រឡប់ "v"

source: ASCIITOCHAR(75; 68; 69) returns "KDE"
km: ASCIITOCHAR (៧៥; ៦៨; ៦៩) ត្រឡប់ "KDE"

source: The BOOL2INT() function returns an integer value for a given boolean value. This method is intended for using a boolean value in methods which require an integer.
km: អនុគមន៍ BOOL2INT() ត្រឡប់តម្លៃចំនួនគត់សម្រាប់តម្លៃប៊ូលីនដែលបានផ្តល់។ វិធីសាស្រ្តនេះត្រូវបានបម្រុងទុកសម្រាប់ការប្រើប្រាស់តម្លៃប៊ូលីននៅក្នុងវិធីសាស្រ្តដែលទាមទារចំនួនគត់។

source: BOOL2INT(value)
km: BOOL2INT (តម្លៃ)

source: Bool value to convert
km: តម្លៃ Bool ដើម្បីបម្លែង

source: A truth value (TRUE or FALSE)
km: តម្លៃសេចក្តីពិត (TRUE ឬ FALSE)

source: BOOL2INT(True) returns 1
km: BOOL2INT (ពិត) ត្រឡប់ ១

source: BOOL2INT(False) returns 0
km: BOOL2INT (ក្លែងក្លាយ) ត្រឡប់ 0

source: The BOOL2STRING() function returns a string value for a given boolean value. This method is intended for using a boolean in methods which require a string
km: អនុគមន៍ BOOL2STRING() ត្រឡប់តម្លៃខ្សែអក្សរសម្រាប់តម្លៃប៊ូលីនដែលបានផ្តល់។ វិធីសាស្រ្តនេះត្រូវបានបម្រុងទុកសម្រាប់ការប្រើប្រាស់ប៊ូលីននៅក្នុងវិធីសាស្រ្តដែលត្រូវការខ្សែអក្សរ

source: BOOL2STRING(value)
km: BOOL2STRING (តម្លៃ)

source: BOOL2STRING(true) returns "True"
km: BOOL2STRING (ពិត) ត្រឡប់ "True"

source: BOOL2STRING(false) returns "False"
km: BOOL2STRING (មិនពិត) ត្រឡប់ "False"

source: upper(BOOL2STRING(find("nan";"banana"))) returns TRUE
km: ខ្ពស់ជាង (BOOL2STRING (រក ("nan"; "banana"))) ត្រឡប់ TRUE

source: The CARX() function returns the X position corresponding to the position of a point in a polar landmark.
km: អនុគមន៍ CARX() ត្រឡប់ទីតាំង X ដែលត្រូវនឹងទីតាំងនៃចំណុចមួយនៅក្នុងតំបន់ប៉ូល។

source: Double
km: ទ្វេ

source: CARX(Radius;Angle)
km: CARX (កាំ; មុំ)

source: Radius
km: កាំ

source: Angle (radians)
km: មុំ (រ៉ាដ្យង់)

source: CARX(12;1.5707) returns 0.00115592
km: CARX (12; 1.5707) ត្រឡប់ 0.00115592

source: CARX(12;0) returns 12
km: CARX (១២; ០) ត្រឡប់ ១២

source: The CARY() function returns the Y position corresponding to the position of a point in a polar landmark.
km: មុខងារ CARY() ត្រឡប់ទីតាំងអ៊ីដែលត្រូវនឹងទីតាំងនៃចំណុចមួយក្នុងតំបន់ប៉ូល។

source: CARY(Radius;Angle)
km: CARY (កាំ; មុំ)

source: CARY(12;1.5707) returns 12
km: CARY (១២; ១.៥៧០៧) ត្រឡប់ ១២

source: CARY(12;0) returns 0
km: CARY (១២; ០) ត្រឡប់ ០

source: The CHARTOASCII() function returns the ASCII code for the given character.
km: មុខងារ CHARTOASCII() ត្រឡប់កូដ ASCII សម្រាប់តួអក្សរដែលបានផ្តល់។

source: CHARTOASCII(value)
km: CHARTOASCII (តម្លៃ)

source: A one character string to convert
km: ខ្សែអក្សរតួអក្សរមួយដើម្បីបំលែង

source: CHARTOASCII("v") returns 118
km: CHARTOASCII ("v") ត្រឡប់ ១១៨

source: CHARTOASCII(r) is an error. The character must be in quotes.
km: CHARTOASCII (r) គឺជាកំហុស។ តួអក្សរត្រូវតែមាននៅក្នុងសម្រង់។

source: The DECSEX() function converts a double value to a time value.
km: មុខងារ DECSEX() បំលែងតម្លៃទ្វេទៅជាតម្លៃពេលវេលា។

source: DECSEX(double)
km: DECSEX (ទ្វេ)

source: Value
km: តម្លៃ

source: DECSEX(1.6668) returns 1:40
km: DECSEX (1.6668) ត្រឡប់ 1:40

source: DECSEX(7.8) returns 7:47
km: DECSEX (7.8) ត្រឡប់ 7:47

source: The INT2BOOL() function returns a boolean value for a given integer number. This method is intended for using an integer in methods which require a boolean. It only accepts 0 or 1. If any other value is given, false is returned.
km: អនុគមន៍ INT2BOOL() ត្រឡប់តម្លៃប៊ូលីនសម្រាប់លេខគត់ដែលបានផ្តល់។ វិធីសាស្រ្តនេះត្រូវបានបម្រុងទុកសម្រាប់ការប្រើប្រាស់លេខគត់នៅក្នុងវិធីសាស្ត្រដែលត្រូវការប៊ូលីន។ វាទទួលយកតែ ០ រឺ ១ ទេ។ ប្រសិនបើមានតំលៃណាមួយត្រូវបានផ្តល់អោយក្លែងក្លាយត្រូវបានប្រគល់ជូនវិញ។

source: INT2BOOL(value)
km: INT2BOOL (តម្លៃ)

source: Integer value to convert
km: តម្លៃចំនួនគត់ដើម្បីបម្លែង

source: INT2BOOL(1) returns true
km: INT2BOOL (1) ត្រឡប់ជាការពិត

source: INT2BOOL(0) returns false
km: INT2BOOL (0) ត្រឡប់មិនពិត

source: OR(INT2BOOL(1); false) returns true
km: OR (INT2BOOL (1); មិនពិត) ត្រឡប់ជាការពិត

source: The NUM2STRING() function returns a string value for a given number. Note that &sheets; can auto-convert numbers to strings if needed, so this function should rarely be needed.
km: អនុគមន៍ NUM2STRING() ត្រឡប់តម្លៃខ្សែអក្សរសម្រាប់លេខដែលបានផ្តល់។ ចំណាំថាសន្លឹក; អាចបំលែងលេខដោយស្វ័យប្រវត្តិទៅជាខ្សែប្រសិនបើចាំបាច់ដូច្នេះមុខងារនេះកម្រនឹងត្រូវការណាស់។

source: NUM2STRING(value)
km: NUM2STRING (តម្លៃ)

source: Number to convert into string
km: ចំនួនត្រូវបម្លែងជាខ្សែអក្សរ

source: A floating point value (like 1.3, 0.343, 253 )
km: តម្លៃចំណុចអណ្តែត (ដូចជា ១.៣, ០៣៤៣, ២៥៣)

source: NUM2STRING(10) returns "10"
km: NUM2STRING (១០) ត្រឡប់ "10"

source: NUM2STRING(2.05) returns "2.05"
km: NUM2STRING (2.05) ត្រឡប់ "2.05"

source: =find("101";NUM2STRING(A1)) (A1 = 2.010102) returns True
km: = រក ("101"; NUM2STRING (A1)) (A1 = 2.010102) ត្រឡប់ពិត

source: The POLA() function returns the angle (in radians) corresponding to the position of a point in a cartesian landmark.
km: មុខងារ POLA() ត្រឡប់មុំ (គិតជារ៉ាដ្យង់) ដែលត្រូវនឹងទីតាំងនៃចំណុចមួយនៅក្នុងសញ្ញាសំគាល់រទេះ។

source: POLA(X;Y)
km: POLA (X; អ៊ី)

source: Value in X
km: តម្លៃនៅក្នុង X

source: Value in Y
km: តម្លៃ Y

source: POLA(12;12) returns 0.78539816
km: POLA (១២; ១២) ត្រឡប់ ០.៧៨៥៣៩៨១៦

source: POLA(12;0) returns 0
km: POLA (១២; ០) ត្រឡប់ ០

source: POLA(0;12) returns 1.5707
km: POLA (០; ១២) ត្រឡប់ ១.៥៧០៧

source: The POLR() function returns the radius corresponding to the position of a point in a cartesian landmark.
km: មុខងារ POLR() ត្រឡប់កាំដែលត្រូវគ្នាទៅនឹងទីតាំងនៃចំណុចមួយនៅក្នុងសញ្ញាសំគាល់រទេះ។

source: POLR(12;12) returns 16.9705
km: POLR (១២; ១២) ត្រឡប់ ១៦.៩៧០៥

source: POLR(12;0) returns 12
km: POLR (១២; ០) ត្រឡប់ ១២

source: The ROMAN() function returns the number in Roman format. Only positive whole numbers can be converted. The optional Format argument specifies the level of conciseness, and defaults to 0.
km: មុខងារ ROMAN() ត្រឡប់លេខជាទ្រង់ទ្រាយរ៉ូម៉ាំង។ មានតែលេខវិជ្ជមានទាំងមូលប៉ុណ្ណោះដែលអាចបំលែងបាន។ អាគុយម៉ង់ទ្រង់ទ្រាយស្រេចចិត្តបញ្ជាក់ពីកម្រិតនៃភាពស្របគ្នានិងលំនាំដើមទៅ ០ ។

source: ROMAN(Number)
km: ROMAN (ចំនួន)

source: Number
km: ចំនួន

source: Format
km: ទ្រង់ទ្រាយ

source: ROMAN(99) returns "XCIX"
km: ROMAN (៩៩) ត្រឡប់ "XCIX"

source: ROMAN(-55) returns "Err"
km: ROMAN (-៥៥) ត្រឡប់ "Err"

source: The SEXDEC() function returns a decimal value. You can also supply a time value.
km: អនុគមន៍ SEXDEC() ត្រឡប់តម្លៃគោលដប់។ អ្នកក៏អាចផ្គត់ផ្គង់ពេលវេលាផងដែរ។

source: SEXDEC(time value) or SEXDEC(hours;minutes;seconds)
km: SEXDEC (តម្លៃពេលវេលា) ឬ SEXDEC (ម៉ោងនាទីនាទីវិនាទី)

source: Hours
km: ម៉ោង

source: Minutes
km: នាទី

source: Seconds
km: វិនាទី

source: SEXDEC(1;5;7) returns 1.0852778
km: SEXDEC (១; ៥; ៧) ត្រឡប់ ១.០៨៥២៧៧៨

source: DECSEX("8:05") returns 8.08333333
km: DECSEX ("8: 05") ត្រឡប់ 8.08333333

source: The STRING() function returns a string value for a given number. It is the same as the NUM2STRING function.
km: មុខងារ STRING() ត្រឡប់តម្លៃខ្សែអក្សរសម្រាប់លេខដែលបានផ្តល់។ វាដូចគ្នានឹងមុខងារ NUM2STRING ដែរ។

source: Database
km: មូលដ្ឋានទិន្នន័យ

source: Calculates the average in a column of a database specified by a set of conditions for values that are numbers
km: គណនាជាមធ្យមនៅក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបានបញ្ជាក់ដោយសំណុំលក្ខខណ្ឌសម្រាប់តម្លៃដែលជាលេខ

source: DAVERAGE(Database; "Header"; Conditions)
km: DAVERAGE (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Range marking the database
km: ជួរសម្គាល់មូលដ្ឋានទិន្នន័យ

source: A range of strings
km: ជួរនៃខ្សែអក្សរ

source: String marking the column in the database
km: ខ្សែអក្សរសម្គាល់ជួរឈរក្នុងមូលដ្ឋានទិន្នន័យ

source: Range marking the conditions
km: ជួរសម្គាល់លក្ខខណ្ឌ

source: Counts the cells containing numeric values in a column of a database specified by a set of conditions.
km: រាប់ក្រឡាដែលមានតម្លៃលេខនៅក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបានបញ្ជាក់ដោយសំណុំលក្ខខណ្ឌ។

source: DCOUNT(Database; "Header"; Conditions)
km: DCOUNT (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Counts the cells containing numeric or alphanumeric values in a column of a database specified by a set of conditions.
km: រាប់ក្រឡាដែលមានតម្លៃលេខឬអក្សរក្រមលេខក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបានបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។

source: DCOUNTA(Database; "Header"; Conditions)
km: DCOUNTA (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Returns a single value from a column of a database specified by a set of conditions. This function returns an error if no value or more than one value exist.
km: ត្រឡប់តម្លៃតែមួយពីជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបានបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។ មុខងារនេះត្រឡប់កំហុសប្រសិនបើគ្មានតម្លៃឬច្រើនជាងមួយមាន។

source: DGET(Database; "Header"; Conditions)
km: DGET (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Returns the largest value in a column of a database specified by a set of conditions.
km: ត្រឡប់តម្លៃធំបំផុតក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។

source: DMAX(Database; "Header"; Conditions)
km: DMAX (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Returns the smallest values in a column of a database specified by a set of conditions.
km: ត្រឡប់តម្លៃតូចបំផុតនៅក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបានបញ្ជាក់ដោយសំណុំលក្ខខណ្ឌ។

source: DMIN(Database; "Header"; Conditions)
km: DMIN (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Returns the product of all numeric values in a column of a database specified by a set of conditions.
km: ត្រឡប់ផលគុណនៃតម្លៃលេខទាំងអស់នៅក្នុងជួរឈរនៃឃ្លាំងទិន្នន័យដែលបានបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។

source: DPRODUCT(Database; "Header"; Conditions)
km: DPRODUCT (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Returns the estimate of the standard deviation of a population based on a sample using all numeric values in a column of a database specified by a set of conditions.
km: ត្រឡប់ការប៉ាន់ប្រមាណនៃគម្លាតគំរូនៃចំនួនប្រជាជនផ្អែកលើគំរូដោយប្រើតម្លៃលេខទាំងអស់នៅក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។

source: DSTDEV(Database; "Header"; Conditions)
km: DSTDEV (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Returns the standard deviation of a population based on the entire population using all numeric values in a column of a database specified by a set of conditions.
km: ត្រឡប់គម្លាតគំរូនៃចំនួនប្រជាជនផ្អែកលើចំនួនប្រជាជនទាំងមូលដោយប្រើតម្លៃលេខទាំងអស់ក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។

source: DSTDEVP(Database; "Header"; Conditions)
km: DSTDEVP (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Sums up the numbers in a column of a database specified by a set of conditions.
km: បូកសរុបលេខនៅក្នុងជួរឈរនៃឃ្លាំងទិន្នន័យដែលបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។

source: DSUM(Database; "Header"; Conditions)
km: DSUM (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Returns the estimate of the variance of a population based on a sample using all numeric values in a column of a database specified by a set of conditions.
km: ត្រឡប់ការប៉ាន់ប្រមាណនៃវ៉ារ្យង់នៃចំនួនប្រជាជនផ្អែកលើគំរូដោយប្រើតម្លៃជាលេខទាំងអស់នៅក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។

source: DVAR(Database; "Header"; Conditions)
km: DVAR (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Returns the variance of a population based on the entire population using all numeric values in a column of a database specified by a set of conditions.
km: ត្រឡប់វ៉ារ្យង់នៃចំនួនប្រជាជនផ្អែកលើចំនួនប្រជាជនទាំងមូលដោយប្រើតម្លៃលេខទាំងអស់ក្នុងជួរឈរនៃមូលដ្ឋានទិន្នន័យដែលបញ្ជាក់ដោយលក្ខខណ្ឌមួយ។

source: DVARP(Database; "Header"; Conditions)
km: DVARP (មូលដ្ឋានទិន្នន័យ; "Header"; លក្ខខណ្ឌ)

source: Fetches summary data from a pivot table.
km: ប្រមូលទិន្នន័យសង្ខេបពីតារាងអ្នកជំនួយការទិន្នន័យ។

source: GETPIVOTDATA(Database; "Sales")
km: GETPIVOTDATA (មូលដ្ឋានទិន្នន័យ; "Sales")

source: Range containing the pivot table
km: ជួរដែលមានតារាងអ្នកជំនួយការទិន្នន័យ

source: Name of the field of which you want the summary data
km: ឈ្មោះនៃវាលដែលអ្នកចង់បានទិន្នន័យសង្ខេប

source: Date &amp; Time
km: កាលបរិច្ឆេទ &amp; ពេលវេលា

source: The CURRENTDATE() function returns the current date. It is equivalent to the TODAY function.
km: អនុគមន៍ CURRENTDATE() ត្រឡប់កាលបរិច្ឆេទបច្ចុប្បន្ន។ វាស្មើនឹងមុខងារ TODAY ។

source: Date
km: កាលបរិច្ឆេទ

source: CURRENTDATE() returns "Saturday 13 April 2002"
km: CURRENTDATE() ត្រឡប់ " ថ្ងៃសៅរ៍ទី ១៣ ខែមេសាឆ្នាំ ២០០២"

source: The CURRENTDATETIME() function returns the current date and time.
km: អនុគមន៍ CURRENTDATETIME() ត្រឡប់កាលបរិច្ឆេទនិងពេលវេលាបច្ចុប្បន្ន។

source: CURRENTDATETIME() returns "Saturday 13 April 2002 19:12:01"
km: CURRENTDATETIME() ត្រឡប់ " ថ្ងៃសៅរ៍ទី ១៣ ខែមេសាឆ្នាំ ២០០២ ម៉ោង ១៩: ១២: ០១"

source: The CURRENTTIME() function returns the current time formatted with local parameters.
km: អនុគមន៍ CURRENTTIME() ត្រឡប់ពេលវេលាបច្ចុប្បន្នដែលបានធ្វើទ្រង់ទ្រាយជាមួយប៉ារ៉ាម៉ែត្រមូលដ្ឋាន។

source: CURRENTTIME() returns "19:12:01"
km: CURRENTTIME() ត្រឡប់ "19: 12: 01"

source: The DATE() function returns the date formatted with local parameters.
km: អនុគមន៍ DATE() ត្រឡប់កាលបរិច្ឆេទដែលបានធ្វើទ្រង់ទ្រាយជាមួយប៉ារ៉ាម៉ែត្រមូលដ្ឋាន។

source: DATE(year;month;date)
km: DATE (ឆ្នាំ; ខែ; កាលបរិច្ឆេទ)

source: Year
km: ឆ្នាំ

source: Month
km: ខែ

source: <seg>Day</seg>
km: <seg> ថ្ងៃ </seg>

source: DATE(2000;5;5) returns Friday 05 May 2000
km: DATE (២០០០; ៥; ៥) ត្រឡប់ថ្ងៃសុក្រទី ០៥ ខែឧសភាឆ្នាំ ២០០០

source: DATE2UNIX() function converts a date and time value to unix time.
km: មុខងារ DATE2UNIX() បំលែងតម្លៃកាលបរិច្ឆេទនិងពេលវេលាទៅជាពេលវេលាយូនីក។

source: A unix time is the number of seconds after midnight January 1st, 1970.
km: ពេលវេលាដែលមិនរាប់បញ្ចូលគឺជាចំនួនវិនាទីបន្ទាប់ពីពាក់កណ្តាលអធ្រាត្រថ្ងៃទី ១ ខែមករាឆ្នាំ ១៩៧០ ។

source: DATE2UNIX(date)
km: DATE2UNIX (កាលបរិច្ឆេទ)

source: DATE2UNIX("01/01/2000") returns 946,684,800
km: DATE2UNIX ("01 / 01 / 2000") ត្រឡប់ 946,684,800

source: The DATEDIF() function returns the difference between two dates.
km: មុខងារ DATEDIF() ត្រឡប់ភាពខុសគ្នារវាងកាលបរិច្ឆេទពីរ។

source: Interval must be one of the following: "m": month; "d": days; "y": complete years; "ym": month excluding years; "yd": days excluding years; "md": days excluding months and years
km: ចន្លោះពេលត្រូវតែជាចំណុចមួយក្នុងចំណោមចំណុចខាងក្រោម៖ "m": ខែ; "d": ថ្ងៃ; "y": ឆ្នាំពេញលេញ; "ym": ខែមិនរាប់ឆ្នាំ; "yd": ថ្ងៃមិនរាប់ឆ្នាំ; "md": ថ្ងៃមិនរាប់ខែនិងឆ្នាំ

source: DATEDIF(first date; second date; interval)
km: DATEDIF (កាលបរិច្ឆេទដំបូងកាលបរិច្ឆេទទីពីរចន្លោះពេល)

source: First date
km: កាលបរិច្ឆេទដំបូង

source: Second date
km: កាលបរិច្ឆេទទីពីរ

source: interval
km: ចន្លោះពេល

source: DATEDIF(A1;A2;"d") A1 is "1st of January 1995" and A2 is "15th of June 1999" returns number of days 1626
km: DATEDIF (A1; A2; "d") A1 គឺ "1st នៃខែមករាឆ្នាំ ១៩៩៥" និង A2 គឺ "១៥ មិថុនា ១៩៩៩" ត្រឡប់ចំនួនថ្ងៃ ១៦២៦

source: DATEDIF(A1;A2;"m") A1 is "1st of January 1995" and A2 is "15th of June 1999" returns number of months 53
km: DATEDIF (A1; A2; "m") A1 គឺ "1st នៃខែមករាឆ្នាំ ១៩៩៥" និង A2 គឺ "១៥ មិថុនា ១៩៩៩" ត្រឡប់ចំនួនខែ ៥៣

source: The DATEVALUE function returns a number representing the day, i.e the number of days elapsed since December 31, 1899.
km: មុខងារ DATEVALUE ត្រឡប់លេខដែលតំណាងឱ្យថ្ងៃពោលគឺចំនួនថ្ងៃបានកន្លងផុតទៅចាប់តាំងពីថ្ងៃទី ៣១ ខែធ្នូឆ្នាំ ១៨៩៩ ។

source: DATEVALUE(date)
km: DATEVALUE (កាលបរិច្ឆេទ)

source: DATEVALUE("2/22/2002") returns 37309
km: DATEVALUE ("2 / 22 / 2002") ត្រឡប់ 37309

source: The DAY functions returns the day of a date. If no parameter is specified the current day gets returned.
km: អនុគមន៍ DAY ត្រឡប់ថ្ងៃនៃកាលបរិច្ឆេទ។ ប្រសិនបើគ្មានប៉ារ៉ាម៉ែត្រត្រូវបានបញ្ជាក់ទេថ្ងៃបច្ចុប្បន្នត្រូវបានត្រឡប់មកវិញ។

source: DAY(date)
km: DAY (កាលបរិច្ឆេទ)

source: DAY("2/22/2002") returns 22
km: DAY ("2 / 22 / 2002") ត្រឡប់ 22

source: DAY(2323.1285) returns 11
km: DAY (2323.1285) ត្រឡប់ 11

source: The DAYNAME() function returns the name of the day of the week (1..7). In some countries the first day of the week is Monday, while in others the first day of the week is Sunday.
km: អនុគមន៍ DAYNAME() ត្រឡប់ឈ្មោះថ្ងៃនៃសប្តាហ៍ (1..7) ។ នៅប្រទេសខ្លះថ្ងៃដំបូងនៃសប្តាហ៍គឺថ្ងៃច័ន្ទរីឯប្រទេសផ្សេងទៀតថ្ងៃដំបូងនៃសប្តាហ៍គឺថ្ងៃអាទិត្យ។

source: DAYNAME(weekday)
km: DAYNAME (ថ្ងៃធ្វើការ)

source: Number of day in week (1..7)
km: ចំនួនថ្ងៃក្នុងមួយសប្តាហ៍ (១..៧)

source: DAYNAME(1) returns Monday (if the week starts on Monday)
km: DAYNAME (1) ត្រឡប់ថ្ងៃច័ន្ទ (ប្រសិនបើសប្តាហ៍ចាប់ផ្តើមនៅថ្ងៃច័ន្ទ)

source: The DAYOFYEAR() function returns the number of the day in the year (1...365).
km: អនុគមន៍ DAYOFYEAR() ត្រឡប់ចំនួនថ្ងៃក្នុងមួយឆ្នាំ (១ ... ៣៦៥) ។

source: DAYOFYEAR(year;month;date)
km: DAYOFYEAR (ឆ្នាំ; ខែ; កាលបរិច្ឆេទ)

source: DAYOFYEAR(2000;12;1) returns 336
km: DAYOFYEAR (២០០០; ១២; ១) ត្រឡប់ ៣៣៦

source: DAYOFYEAR(2000;2;29) returns 60
km: DAYOFYEAR (២០០០; ២; ២៩) ត្រឡប់ ៦០

source: The DAYS() function returns the difference between two dates in days.
km: អនុគមន៍ DAYS() ត្រឡប់ភាពខុសគ្នារវាងកាលបរិច្ឆេទពីរក្នុងថ្ងៃ។

source: DAYS(date2; date1)
km: DAYS (កាលបរិច្ឆេទ ២; កាលបរិច្ឆេទ ១)

source: First (earlier) date value
km: តម្លៃកាលបរិច្ឆេទដំបូង (មុន)

source: Second date value
km: តម្លៃកាលបរិច្ឆេទទីពីរ

source: DAYS("2002-02-22"; "2002-02-26") returns 4
km: DAYS ("2002-02-22"; "2002-02-26") ត្រឡប់ 4

source: The DAYS360() function returns the number of days from date1 to date2 using a 360-day calendar in which all months are assumed to have 30 days. If method is false (default) the US method will be used, the European otherwise.
km: អនុគមន៍ DAYS360() ត្រឡប់ចំនួនថ្ងៃចាប់ពីថ្ងៃទី ១ ដល់កាលបរិច្ឆេទទី ២ ដោយប្រើប្រតិទិន ៣៦០ ថ្ងៃដែលរាល់ខែត្រូវបានសន្មតថាមាន ៣០ ថ្ងៃ។ ប្រសិនបើវិធីសាស្រ្តមិនពិត (លំនាំដើម) វិធីសាស្ត្រអាមេរិកនឹងត្រូវបានប្រើបើមិនដូច្នេះទេអ៊ឺរ៉ុប។

source: DAYS360(date1; date2; method)
km: DAYS360 (កាលបរិច្ឆេទ ១; កាលបរិច្ឆេទ ២; វិធីសាស្ត្រ)

source: Date1
km: កាលបរិច្ឆេទ ១

source: Date2
km: កាលបរិច្ឆេទទី ២

source: Method
km: វិធីសាស្រ្ត

source: DAYS360("2/22/2002"; "4/21/2002"; FALSE) returns 59
km: DAYS360 ("2 / 22 / 2002"; "4 / 21 / 2002"; FALSE) ត្រឡប់ 59
