Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/sheets_functions.po
Languages: km

source: EFFECT(0.08;12) equals 0.083
km: EFFECT (០.០៨; ១២) ស្មើ ០.០៨៣

source: The EFFECTIVE() function calculates the effective yield for a nominal interest rate (annual rate or APR). It is the same as the EFFECT function.
km: អនុគមន៍ EFFECTIVE() គណនាលទ្ធផលដែលមានប្រសិទ្ធិភាពសម្រាប់អត្រាការប្រាក់បន្ទាប់បន្សំ (អត្រាប្រចាំឆ្នាំឬអេអេអេ) ។ វាដូចគ្នានឹងមុខងារ EFFECT ។

source: EFFECTIVE(nominal;periods)
km: EFFECTIVE (បន្ទាប់បន្សំ; រយៈពេល)

source: The EURO() function converts one Euro to a given national currency in the European monetary union. Currency is one of the following: ATS (Austria), BEF (Belgium), DEM (Germany), ESP (Spain), EUR (Euro), FIM (Finland), FRF (France), GRD (Greece), IEP (Ireland), ITL (Italy), LUF (Luxembourg), NLG (Netherlands), or PTE (Portugal).
km: មុខងារ EURO() បំលែងអឺរ៉ូមួយទៅជារូបិយប័ណ្ណជាតិដែលបានផ្តល់ឱ្យនៅក្នុងសហភាពរូបិយវត្ថុអ៊ឺរ៉ុប។ រូបិយប័ណ្ណគឺជារូបិយប័ណ្ណមួយក្នុងចំណោមរូបិយប័ណ្ណដូចខាងក្រោម: អេធីអេស (អូទ្រីស) អេហ្វអេហ្វ (បែលហ្ស៊ិក) ឌីអេម (អាឡឺម៉ង់) អេអេសអេស (អេស្ប៉ាញ) អឺរ៉ូ (អឺរ៉ូ) អេហ្វអេស (ហ្វាំងឡង់) ហ្វ្រែហ្វអេហ្វ (បារាំង) ហ្គ្រេឌី (ក្រិក) អេហ្វអេស។ ) អាយ។ អិល។ អេ។ (អ៊ីតាលី) លុអេហ្វ (លុចសំបួ) នីអិលអេល (ហូឡង់) ឬភីធីធី (ព័រទុយហ្កាល់) ។

source: EURO(currency)
km: EURO (រូបិយប័ណ្ណ)

source: Currency
km: រូបិយប័ណ្ណ

source: EURO("DEM") equals 1.95583
km: EURO ("DEM") ស្មើនឹង 1.95583

source: The EUROCONVERT() function converts a number from one national currency to another currency in the European monetary union by using EURO an intermediary. Currency is one of the following: ATS (Austria), BEF (Belgium), DEM (Germany), ESP (Spain), EUR (Euro), FIM (Finland), FRF (France), GRD (Greece), IEP (Ireland), ITL (Italy), LUF (Luxembourg), NLG (Netherlands), or PTE (Portugal).
km: មុខងារ EUROCONVERT() បំលែងលេខពីរូបិយប័ណ្ណជាតិមួយទៅជារូបិយប័ណ្ណមួយផ្សេងទៀតនៅក្នុងសហភាពរូបិយវត្ថុអ៊ឺរ៉ុបដោយប្រើអឺរ៉ូអន្តរការី។ រូបិយប័ណ្ណគឺជារូបិយប័ណ្ណមួយក្នុងចំណោមរូបិយប័ណ្ណដូចខាងក្រោម: អេធីអេស (អូទ្រីស) អេហ្វអេហ្វ (បែលហ្ស៊ិក) ឌីអេម (អាឡឺម៉ង់) អេអេសអេស (អេស្ប៉ាញ) អឺរ៉ូ (អឺរ៉ូ) អេហ្វអេស (ហ្វាំងឡង់) ហ្វ្រែហ្វអេហ្វ (បារាំង) ហ្គ្រេឌី (ក្រិក) អេហ្វអេស។ ) អាយ។ អិល។ អេ។ (អ៊ីតាលី) លុអេហ្វ (លុចសំបួ) នីអិលអេល (ហូឡង់) ឬភីធីធី (ព័រទុយហ្កាល់) ។

source: EUROCONVERT(number; source currency; target currency)
km: EUROCONVERT (ចំនួន; រូបិយប័ណ្ណប្រភព; រូបិយប័ណ្ណគោលដៅ)

source: Source currency
km: រូបិយប័ណ្ណប្រភព

source: Target currency
km: រូបិយប័ណ្ណគោលដៅ

source: EUROCONVERT(1; "EUR"; "DEM") equals 1.95583
km: EUROCONVERT (1; "EUR"; "DEM") ស្មើនឹង 1.95583

source: The FV() function returns the future value of an investment, given the yield and the time elapsed. If you have $1000 in a bank account earning 8% interest, after two years you will have FV(1000;0.08;2) or $1166.40.
km: មុខងារ FV() ត្រឡប់តម្លៃអនាគតនៃការវិនិយោគដែលផ្តល់ទិន្នផលនិងពេលវេលា។ ប្រសិនបើអ្នកមាន $1000 នៅក្នុងគណនីធនាគារដែលទទួលបានការប្រាក់ 8 % បន្ទាប់ពីពីរឆ្នាំអ្នកនឹងមាន FV (1000; 0.08; 2) ឬ $1166.40 ។

source: FV(present value;yield;periods)
km: FV (តម្លៃបច្ចុប្បន្ន; ទិន្នផល; កំឡុងពេល)

source: Present value
km: តម្លៃ​បច្ចុប្បន្ន

source: FV(1000;0.08;2) equals 1166.40
km: FV (១០០០; ០០៨; ២) ស្មើនឹង ១១៦៦.៤០

source: The FV_ANNUITY() function returns the future value of a stream of payments given the amount of the payment, the interest rate and the number of periods. For example: If you receive $500 per year for 20 years, and invest it at 8%, the total after 20 years will be FV_annuity(500;0.08;20) or $22,880.98. This function assumes that payments are made at the end of each period.
km: មុខងារ FVANNUITY() ត្រឡប់តម្លៃនាពេលអនាគតនៃចរន្តទូទាត់ដែលបានផ្តល់ឱ្យចំនួនទឹកប្រាក់នៃការទូទាត់អត្រាការប្រាក់និងចំនួនអំឡុងពេល។ ឧទាហរណ៍ៈប្រសិនបើអ្នកទទួលបាន $500 ក្នុងមួយឆ្នាំរយៈពេល ២០ ឆ្នាំហើយវិនិយោគវានៅ ៨ % ចំនួនសរុបបន្ទាប់ពី ២០ ឆ្នាំនឹងមាន FVannuity (៥០០; ០,០៨; ២០) ឬ $22,៨៨០.៩៨ ។ មុខងារនេះសន្មតថាការទូទាត់ត្រូវបានធ្វើឡើងនៅចុងបញ្ចប់នៃរយៈពេលនីមួយៗ។

source: FV_ANNUITY(amount;interest;periods)
km: FVANNUITY (ចំនួនទឹកប្រាក់; អត្រាការប្រាក់រយៈពេល)

source: Payment per period
km: ការទូទាត់ក្នុងមួយរយៈពេល

source: FV_ANNUITY(1000;0.05;5) equals 5525.63
km: FVANNUITY (១០០០; ០,០៥; ៥) ស្មើនឹង ៥៥២៥.៦៣

source: The INTRATE function returns the interest rate for a fully invested security. Basis is the type of day counting you want to use: 0: US 30/360 (default), 1: real days, 2: real days/360, 3: real days/365 or 4: European 30/365.
km: មុខងារ INTRATE ត្រឡប់អត្រាការប្រាក់សម្រាប់មូលប័ត្រដែលបានវិនិយោគពេញលេញ។ មូលដ្ឋានគឺជាប្រភេទនៃការរាប់ថ្ងៃដែលអ្នកចង់ប្រើ៖ ០: ៣០ អាមេរិក ៣០/៣៦០ (លំនាំដើម) ១: ថ្ងៃពិតប្រាកដ ២ ៈថ្ងៃពិត / ៣៦០, ៣: ថ្ងៃពិត / ៣៦៥ ឬ ៤ ៈអឺរ៉ុប ៣០/៣៦៥ ។

source: INTRATE(settlement; maturity; investment; redemption; basis)
km: INTRATE (ទូទាត់; កំណត់សង; វិនិយោគ; រំលោះ; មូលដ្ឋាន)

source: Investment
km: ការវិនិយោគ

source: INTRATE("2/28/2001"; "8/31/2001"; 1000000; 2000000; 1) returns 1.98
km: INTRATE ("2 / 28 / 2001"; "8 / 31 / 2001"; 1000000; 2000000; 1) ត្រឡប់ 1,98

source: IPMT calculates the amount of a payment of an annuity going towards interest.
km: IPMT គណនាចំនួនទឹកប្រាក់នៃការទូទាត់ប្រចាំឆ្នាំដែលឆ្ពោះទៅរកការប្រាក់។

source: Rate is the periodic interest rate.
km: អត្រាគឺជាអត្រាការប្រាក់តាមកាលកំណត់។

source: Period is the amortizement period. 1 for the first and NPER for the last period.
km: រយៈពេលគឺជារយៈពេលរំលោះ។ 1 សម្រាប់លើកដំបូងនិង NPER សម្រាប់រយៈពេលចុងក្រោយ។

source: NPER is the total number of periods during which annuity is paid.
km: NPER គឺជាចំនួនរយៈពេលសរុបក្នុងកំឡុងពេលដែលធនលាភត្រូវបានបង់។

source: PV is the present value in the sequence of payments.
km: PV គឺជាតម្លៃបច្ចុប្បន្ននៅក្នុងលំដាប់នៃការទូទាត់។

source: FV (optional) is the desired (future) value. default: 0.
km: FV (ស្រេចចិត្ត) គឺជាតម្លៃដែលចង់បាន (អនាគត) ។ លំនាំដើម៖ ០ ។

source: Type (optional) defines the due date. 1 for payment at the beginning of a period and 0 (default) for payment at the end of a period.
km: ប្រភេទ (ជាជម្រើស) កំណត់កាលបរិច្ឆេទដល់កំណត់។ 1 សម្រាប់ការទូទាត់នៅដើមរយៈពេលនិង ០ (លំនាំដើម) សម្រាប់ការទូទាត់នៅចុងបញ្ចប់នៃរយៈពេល។

source: The example shows the interest to pay in the last year of a three year loan. The interest rate is 10 percent.
km: ឧទាហរណ៍បង្ហាញពីការប្រាក់ដែលត្រូវបង់ក្នុងឆ្នាំចុងក្រោយនៃប្រាក់កម្ចីរយៈពេលបីឆ្នាំ។ អត្រាការប្រាក់គឺ ១០ ភាគរយ។

source: IPMT(Rate; Period; NPer; PV; FV; Type)
km: IPMT (អត្រា; រយៈពេល; NPer; PV; FV; ប្រភេទ)

source: Number of periods
km: ចំនួនរយៈពេល

source: Present values
km: តម្លៃបច្ចុប្បន្ន

source: Future value (optional)
km: តម្លៃអនាគត (ជាជម្រើស)

source: Type (optional)
km: ប្រភេទ (ជាជម្រើស)

source: IPMT(0.1;3;3;8000) equals -292.45
km: IPMT (០,១; ៣; ៣; ៨០០០) ស្មើនឹង -២៩២.៤៥

source: The IRR function calculates the internal rate of return for a series of cash flows.
km: មុខងារ IRR គណនាអត្រាផ្ទៃក្នុងនៃការត្រឡប់មកវិញសម្រាប់ស៊េរីលំហូរសាច់ប្រាក់។

source: IRR( Values[; Guess = 0.1 ] )
km: IRR (តម្លៃ [; ទាយ = 0.1])

source: Values
km: គុណតម្លៃ

source: Guess
km: ស្មាន

source: Calculates the interest paid on a given period of an investment.
km: គណនាការប្រាក់ដែលបានបង់ក្នុងរយៈពេលដែលបានផ្តល់ឱ្យនៃការវិនិយោគ។

source: Period is the amortizement period. 1 for the first and NPer for the last period.
km: រយៈពេលគឺជារយៈពេលរំលោះ។ 1 សម្រាប់ទីមួយនិង NPer សម្រាប់រយៈពេលចុងក្រោយ។

source: NPer is the total number of periods during which annuity is paid.
km: NPer គឺជាចំនួនកំឡុងពេលសរុបក្នុងកំឡុងពេលដែលប្រាក់ប្រចាំឆ្នាំត្រូវបានបង់។

source: ISPMT(Rate; Period; NPer; PV)
km: ISPMT (អត្រា; រយៈពេល; NPer; PV)

source: Present values (PV)
km: តម្លៃបច្ចុប្បន្ន (PV)

source: ISPMT(0.1; 1; 3; 8000000) equals -533333
km: ISPMT (០.១; ១; ៣; ៨០០០០០០) ស្មើ -៥៣៣៣៣៣

source: The LEVEL_COUPON() function calculates the value of a level-coupon bond. For example: if the interest rate is 10%, a $1000 bond with semi-annual coupons at a rate of 13% that matures in 4 years is worth LEVEL_COUPON(1000;.13;2;4;.1) or $1096.95.
km: អនុគមន៍ LEVELCOUPON() គណនាតម្លៃនៃចំណងប័ណ្ណកម្រិត។ ឧទាហរណ៍ៈប្រសិនបើអត្រាការប្រាក់គឺ ១០ % ចំណង $1000 ជាមួយប័ណ្ណពាក់កណ្តាលប្រចាំឆ្នាំក្នុងអត្រា ១៣ % ដែលមានរយៈពេល ៤ ឆ្នាំគឺមានតម្លៃ LEVELCOUPON (១០០០; ១៣; ២; ៤; .១) ឬ $96 ។

source: LEVEL_COUPON(face value;coupon rate;coupons per year;years;market rate)
km: LEVE_LCOUPON (តម្លៃមុខ, អត្រាគូប៉ុង, ប័ណ្ណក្នុងមួយឆ្នាំ; ឆ្នាំ; អត្រាទីផ្សារ)

source: Face value
km: តម្លៃមុខ

source: Coupon rate
km: អត្រាគូប៉ុង

source: Coupons per year
km: គូប៉ុងក្នុងមួយឆ្នាំ

source: Market interest rate
km: អត្រាការប្រាក់ទីផ្សារ

source: LEVEL_COUPON(1000;.13;2;4;.1) equals 1096.95
km: LEVELCOUPON (1000; .13, 2; 4; .1) ស្មើនឹង 1096.95

source: The MDURATION() function will calculate the modified Macauley duration of a fixed interest security in years.
km: មុខងារ MDURATION() នឹងគណនារយៈពេលម៉ាកាវដែលបានកែប្រែនៃមូលប័ត្រការប្រាក់ថេរក្នុងរយៈពេលប៉ុន្មានឆ្នាំ។

source: MDURATION( Settlement; Maturity; Coupon; Yield; Frequency; [ Basis=0 ])
km: MDURATION (ទូទាត់; ថ្ងៃដល់កំណត់បង់; គូប៉ុង; ចំណូល; ប្រេកង់; [មូលដ្ឋាន = 0])

source: MDURATION("2004-02-01"; "2004-05-31"; 0.08; 0.09; 2; 0) returns 0.316321106
km: MDURATION ("2004-02-01"; "2004-05-31"; 0.08; 0.09; 2; 0) ត្រឡប់ 0.316321106

source: The MIRR() function will calculate the modified internal rate of return (IRR) of a series of periodic investments.
km: មុខងារ MIRR() នឹងគណនាអត្រាផ្ទៃក្នុងដែលបានកែប្រែនៃការត្រឡប់មកវិញ (IRR) នៃស៊េរីនៃការវិនិយោគតាមកាលកំណត់។

source: MIRR(values; investment; reinvestment)
km: MIRR (តម្លៃវិនិយោគការវិនិយោគឡើងវិញ)

source: Reinvestment
km: ការតាក់តែងឡើងវិញ

source: MIRR({100;200;-50;300;-200}, 5%, 6%) equals 34.2823387842%
km: MIRR ({១០០; ២០០; -៥០; ៣០០; -២០០}, ៥ %, ៦ %) ស្មើនឹង ៣៤,២៨២៣៣៨៧៨៤២ %

source: The NOMINAL() function calculates the nominal (stated) interest rate for an effective (annualized) interest rate compounded at given intervals. For example: to earn 8% on an account compounded monthly, you need a return of NOMINAL(.08;12) or 7.72%.
km: មុខងារ NOMINAL() គណនាអត្រាការប្រាក់នាមករណ៍សម្រាប់អត្រាការប្រាក់ដែលមានប្រសិទ្ធិភាព (ប្រចាំឆ្នាំ) ផ្សំគ្នានៅចន្លោះពេលដែលបានផ្តល់។ ឧទាហរណ៍ៈដើម្បីទទួលបាន ៨ % លើគណនីរួមបញ្ចូលគ្នាជារៀងរាល់ខែអ្នកត្រូវការត្រលប់មកវិញនូវ NOMINAL (.០៨; ១២) ឬ ៧.៧២ % ។

source: NOMINAL(effective;periods)
km: NOMINAL (មានប្រសិទ្ធភាពអំឡុងពេល)

source: Effective interest rate
km: អត្រាការប្រាក់មានប្រសិទ្ធិភាព

source: NOMINAL(0.08;12) equals 0.0772
km: NOMINAL (០.០៨; ១២) ស្មើ ០.០៧៧២

source: Returns the number of periods of an investment.
km: ត្រឡប់ចំនួនអំឡុងពេលនៃការវិនិយោគមួយ។

source: NPER(rate;payment;pv;fv;type)
km: NPER (អត្រា; ការទូទាត់; ភី; ប្រភេទ; ប្រភេទ)

source: Payment
km: ការទូទាត់

source: Future value (FV - optional)
km: តម្លៃអនាគត (FV - ស្រេចចិត្ត)

source: NPER(0.1; -100; 1000) equals 11
km: NPER (0.1; -100; 1000) ស្មើនឹង 11

source: NPER(0.06; 0; -10000; 20000 ;0) returns 11.906
km: NPER (០.០៦; ០; -១០០០០; ២០០០០; ០) ត្រឡប់ ១១,៩០៦

source: The net present value (NPV) for a series of periodic cash flows.
km: តម្លៃបច្ចុប្បន្នសុទ្ធ (NPV) សម្រាប់ស៊េរីលំហូរសាច់ប្រាក់តាមកាលកំណត់។

source: Computes the net present value for a series of periodic cash flows with the discount rate Rate. Values should be positive if they are received as income, and negative if the amounts are expenditure.
km: គណនាតម្លៃបច្ចុប្បន្នសុទ្ធសម្រាប់ស៊េរីនៃលំហូរសាច់ប្រាក់តាមកាលកំណត់ជាមួយនឹងអត្រាបញ្ចុះតម្លៃ។ តម្លៃគួរតែមានលក្ខណៈវិជ្ជមានប្រសិនបើពួកគេត្រូវបានទទួលជាប្រាក់ចំណូលនិងអវិជ្ជមានប្រសិនបើចំនួនទឹកប្រាក់នេះត្រូវបានចំណាយ។

source: NPV(Rate; Values)
km: NPV (អត្រា; តម្លៃ)

source: Values (array)
km: គុណតម្លៃ (អារេ)

source: NPV(100%;4;5;7) = 4.125
km: NPV (១០០ %; ៤; ៥; ៧) = ៤.១២៥

source: The ODDLPRICE function calculates the value of the security per 100 currency units of face value. The security has an irregular last interest date.
km: មុខងារ ODDLPRICE គណនាតម្លៃនៃមូលប័ត្រក្នុង ១០០ ឯកតារូបិយប័ណ្ណនៃតម្លៃមុខ។ មូលប័ត្រមានកាលបរិច្ឆេទការប្រាក់ចុងក្រោយមិនទៀងទាត់។

source: ODDLPRICE( Settlement; Maturity; Last; Rate; AnnualYield; Redemption; Frequency [; Basis = 0 ] )
km: ODDLPRICE (ទូទាត់; ថ្ងៃដល់កំណត់បង់; ចុងក្រោយ; អត្រា; ចំណូលប្រចាំឆ្នាំ; រំលោះ; ប្រេកង់ [; មូលដ្ឋាន = ០])

source: Last
km: ចុងក្រោយ

source: AnnualYield
km: ប្រចាំឆ្នាំ

source: ODDLPRICE(DATE(1990;6;1);DATE(1995;12;31);DATE(1990;1;1);3%;5%;100;2) returns 90.991042345
km: ODDLPRICE (DATE (១៩៩០; ៦; ១); កាលបរិច្ឆេទ (១៩៩៥; ១២; ៣១); កាលបរិច្ឆេទ (១៩៩០; ១; ១); ៣ %; ៥ %; ១០០; ២) ត្រឡប់ ៩០.៩៩១០៤២៣៤៥

source: The ODDLYIELD function calculates the yield of the security which has an irregular last interest date.
km: ODDLYIELD គណនាលទ្ធផលនៃមូលប័ត្រដែលមានកាលបរិច្ឆេទការប្រាក់ចុងក្រោយមិនទៀងទាត់។

source: ODDLYIELD( Settlement; Maturity; Last; Rate; Price; Redemption; Frequency [; Basis = 0 ] )
km: ODDLYIELD (ទូទាត់; ថ្ងៃដល់កំណត់បង់; ចុងក្រោយ; អត្រា; តម្លៃ; រំលោះ; ប្រេកង់ [; មូលដ្ឋាន = ០])

source: Price
km: តម្លៃ

source: ODDLYIELD(DATE(1990;6;1);DATE(1995;12;31);DATE(1990;1;1);3%;91;100;2) returns 4.997775351
km: ODDLYIELD (DATE (១៩៩០; ៦; ១); កាលបរិច្ឆេទ (១៩៩៥; ១២; ៣១), កាលបរិច្ឆេទ (១៩៩០; ១; ១), ៣ %; ៩១, ១០០; ២) ត្រឡប់ ៤.៩៩៧៧៧៥៣៥១

source: PMT returns the amount of payment for a loan based on a constant interest rate and constant payments (each payment is equal amount).
km: PMT ប្រគល់ចំនួនទឹកប្រាក់នៃប្រាក់កម្ចីដោយផ្អែកលើអត្រាការប្រាក់ថេរនិងការទូទាត់ថេរ (ការទូទាត់នីមួយៗមានចំនួនស្មើគ្នា) ។

source: PMT(rate; nper ; pv [; fv = 0 [; type = 0 ]] )
km: PMT (អត្រា; ណុប; ភី; [; fv = 0 [; ប្រភេទ = ០]])

source: Number of periods (NPer)
km: ចំនួនអំឡុងពេល (NPer)

source: PMT(0.1; 4; 10000) equals -3154.71
km: PMT (០.១; ៤; ១០០០០) ស្មើ -៣១៥៤.៧១

source: PPMT calculates the amount of a payment of an annuity going towards principal.
km: PPMT គណនាចំនួនទឹកប្រាក់នៃការទូទាត់ប្រចាំឆ្នាំដែលឆ្ពោះទៅរកប្រាក់ដើម។

source: PPMT(Rate; Period; NPer; PV [; FV = 9 [; Type = 0 ]] )
km: PPMT (អត្រា; រយៈពេល; NPer; PV [; FV = ៩ [; ប្រភេទ = ០]])

source: PPMT(0.0875;1;36;5000;8000;1) equals -18.48
km: PPMT (០.០៨៧៥; ១; ៣៦; ៥០០០; ៨០០០; ១) ស្មើ -១៨,៤៨

source: PRICEMAT Calculate the price per 100 currency units of face value of the security that pays interest on the maturity date.
km: PRICEMAT គណនាតម្លៃក្នុង 100 ឯកតារូបិយប័ណ្ណនៃតម្លៃមុខនៃមូលប័ត្រដែលបង់ការប្រាក់តាមកាលកំណត់។

source: Basis Calculation method
km: វិធីសាស្ត្រគណនាមូលដ្ឋាន

source: 0 US method, 12 months, each month with 30 days
km: ០ វិធីអាមេរិក ១២ ខែរៀងរាល់ខែមាន ៣០ ថ្ងៃ

source: 1 Actual number of days in year, actual number of days in months
km: 1 ចំនួនថ្ងៃជាក់ស្តែងក្នុងឆ្នាំចំនួនថ្ងៃពិតប្រាកដក្នុងខែ

source: 2 360 days in a year, actual number of days in months
km: ២ ៣៦០ ថ្ងៃក្នុងមួយឆ្នាំចំនួនថ្ងៃពិតប្រាកដគិតជាខែ

source: 4 365 days in a year, actual number of days in months
km: ៤ ៣៦៥ ថ្ងៃក្នុងមួយឆ្នាំចំនួនថ្ងៃពិតប្រាកដគិតជាខែ

source: 5 European method, 12 months, each month has 30 days
km: ៥ វិធីអឺរ៉ុប ១២ ខែខែនីមួយៗមាន ៣០ ថ្ងៃ

source: PRICEMAT(settlement; maturity; issue; rate; yield [; basis = 0 ] )
km: PRICEMAT (ទូទាត់; ថ្ងៃដល់កំណត់បង់; បញ្ហា; អត្រា; ទិន្នផល [; មូលដ្ឋាន = 0])

source: Issue
km: កិច្ចការ

source: Discount rate
km: អត្រា​បញ្ចុះតម្លៃ

source: PRICEMAT(DATE(1990;6;1);DATE(1995;12;31);DATE(1990;1;1);6%;5%) returns 103.819218241
km: PRICEMAT (DATE (១៩៩០; ៦; ១); កាលបរិច្ឆេទ (១៩៩៥; ១២; ៣១); កាលបរិច្ឆេទ (១៩៩០; ១; ១); ៦ %; ៥ %) ត្រឡប់ ១០៣,៨១៩២១៨២៤១

source: The PV() function returns the present value of an investment -- the value today of a sum of money in the future, given the rate of interest or inflation. For example if you need $1166.40 for your new computer and you want to buy it in two years while earning 8% interest, you need to start with PV(1166.4;0.08;2) or $1000.
km: មុខងារ PV() ត្រឡប់តម្លៃបច្ចុប្បន្ននៃការវិនិយោគ - តម្លៃថ្ងៃនេះនៃផលបូកនៃប្រាក់នាពេលអនាគតដែលផ្តល់ឱ្យអត្រាការប្រាក់ឬអតិផរណា។ ឧទាហរណ៍ប្រសិនបើអ្នកត្រូវការ $1166.40 សម្រាប់កុំព្យួទ័រថ្មីរបស់អ្នកហើយអ្នកចង់ទិញវាក្នុងរយៈពេលពីរឆ្នាំខណៈពេលដែលរកបាន ៨ ចំណាប់អារម្មណ៍ % អ្នកត្រូវចាប់ផ្តើមជាមួយក្រុមហ៊ុន PV (១១៦៦.៤; ០,០៨; ២) ឬ $1000 ។

source: PV(future value;rate;periods)
km: PV (តម្លៃអនាគតអត្រាអត្រាអំឡុងពេល)

source: Future value
km: តម្លៃអនាគត

source: PV(1166.4;0.08;2) equals 1000
km: PV (1166.4; 0,08; 2) ស្មើនឹង 1000

source: The PV_ANNUITY() function returns the present value of an annuity or stream of payments. For example: a "million dollar" lottery ticket that pays $50,000 a year for 20 years, with an interest rate of 5%, is actually worth PV_ANNUITY(50000;0.05;20) or $623,111. This function assumes that payments are made at the end of each period.
km: អនុគមន៍ PVANNUITY() ត្រឡប់តម្លៃបច្ចុប្បន្ននៃប្រចាំឆ្នាំឬលំហូរនៃការទូទាត់។ ឧទាហរណ៏៖ ឆ្នោតឡូតូដែលមានទឹកប្រាក់ "million dollar" ដែលបង់ $50,000 ក្នុងមួយឆ្នាំរយៈពេល ២០ ឆ្នាំដោយមានអត្រាការប្រាក់ ៥ % ពិតជាមានតម្លៃ PVANNUITY (៥០០០០; ០,០៥; ២០) ឬ $623,១១១ ។ មុខងារនេះសន្មតថាការទូទាត់ត្រូវបានធ្វើឡើងនៅចុងបញ្ចប់នៃរយៈពេលនីមួយៗ។

source: PV_ANNUITY(amount;interest;periods)
km: PVANNUITY (ចំនួនទឹកប្រាក់; អត្រាការប្រាក់)

source: PV_ANNUITY(1000;0.05;5) equals 4329.48
km: PVANNUITY (១០០០; ០,០៥; ៥) ស្មើនឹង ៤៣២៩.៤៨

source: The RATE() function computes the constant interest rate per period of an investment.
km: មុខងារ RATE() គណនាអត្រាការប្រាក់ថេរក្នុងកំឡុងពេលនៃការវិនិយោគ។

source: RATE(nper;pmt;pv;fv;type;guess)
km: RATE (nper; pmt; pv; fv; ប្រភេទ; ទាយ)

source: Payment period
km: រយៈពេលទូទាត់

source: Regular payments
km: ការទូទាត់ទៀងទាត់

source: <seg>Type</seg>
km: <seg> ប្រភេទ </seg>

source: RATE(4*12;-200;8000) equals 0.007701472
km: RATE (៤ * ១២; -២០០; ៨០០០) ស្មើនឹង ០.០០៧៧០១៤៧២

source: The RECEIVED function returns the amount received at the maturity date for a invested security. Basis is the type of day counting you want to use: 0: US 30/360 (default), 1: real days, 2: real days/360, 3: real days/365 or 4: European 30/365. The settlement date must be before maturity date.
km: មុខងារ RECEIVED ត្រឡប់ចំនួនទឹកប្រាក់ដែលទទួលបាននៅកាលបរិច្ឆេទដល់កាលកំណត់សម្រាប់មូលប័ត្រដែលបានវិនិយោគ។ មូលដ្ឋានគឺជាប្រភេទនៃការរាប់ថ្ងៃដែលអ្នកចង់ប្រើ៖ ០: ៣០ អាមេរិក ៣០/៣៦០ (លំនាំដើម) ១: ថ្ងៃពិតប្រាកដ ២ ៈថ្ងៃពិត / ៣៦០, ៣: ថ្ងៃពិត / ៣៦៥ ឬ ៤ ៈអឺរ៉ុប ៣០/៣៦៥ ។ កាលបរិច្ឆេទទូទាត់ត្រូវតែមុនកាលបរិច្ឆេទកាលកំណត់។

source: RECEIVED(settlement; maturity; investment; discount; basis)
km: បានទទួល (ការទូទាត់; កំណត់សង; វិនិយោគ; បញ្ចុះ; មូលដ្ឋាន)

source: RECEIVED("2/28/2001"; "8/31/2001"; 1000; 0.05; 0) returns 1,025.787
km: ទទួលយក ("2 / 28 / 2001"; "8 / 31 / 2001"; 1000; 0.05; 0) ត្រឡប់ 1,025.787

source: The RRI function calculates the interest rate resulting from the profit (return) of an investment.
km: មុខងារ RRI គណនាអត្រាការប្រាក់ដែលទទួលបានពីប្រាក់ចំណេញ (ត្រឡប់មកវិញ) នៃការវិនិយោគ។

source: RRI(1;100;200) returns 1
km: RRI (1; 100; 200) ត្រឡប់ 1

source: The SLN() function will determine the straight line depreciation of an asset for a single period. Cost is the amount you paid for the asset. Salvage is the value of the asset at the end of the period. Life is the number of periods over which the asset is depreciated. SLN divides the cost evenly over the life of an asset.
km: មុខងារ SLN() នឹងកំណត់ការរំលោះបន្ទាត់ត្រង់នៃទ្រព្យមួយសម្រាប់រយៈពេលតែមួយ។ ថ្លៃដើមគឺជាចំនួនទឹកប្រាក់ដែលអ្នកបានចំណាយសម្រាប់ទ្រព្យសម្បត្តិ។ ប្រាក់សង្គ្រោះគឺជាតម្លៃនៃទ្រព្យនៅចុងបញ្ចប់នៃរយៈពេល។ អាយុកាលគឺជាចំនួនកំឡុងពេលដែលទ្រព្យនោះត្រូវបានរំលោះ។ អេសអិលអិនបែងចែកការចំណាយលើអាយុកាលទ្រព្យ។

source: SLN(cost; salvage value; life)
km: SLN (ថ្លៃដើម; តម្លៃសង្គ្រោះ; អាយុកាល)

source: SLN(10000;700;10) equals 930
km: SLN (១០០០០; ៧០០; ១០) ស្មើនឹង ៩៣០

source: The SYD() function will calculate the sum-of-years digits depreciation for an asset based on its cost, salvage value, anticipated life, and a particular period. This method accelerates the rate of the depreciation, so that more depreciation expense occurs in earlier periods than in later ones. The depreciable cost is the actual cost minus the salvage value. The useful life is the number of periods (typically years) over which the asset is depreciated.
km: មុខងារ SYD() នឹងគណនាការរំលោះខ្ទង់ប្រចាំឆ្នាំនៃទ្រព្យសម្រាប់ទ្រព្យដែលផ្អែកលើថ្លៃដើមតម្លៃសង្គ្រោះអាយុរំពឹងទុកនិងរយៈពេលជាក់លាក់ណាមួយ។ វិធីសាស្រ្តនេះបង្កើនអត្រានៃការរំលោះដូច្នេះការចំណាយរំលោះកាន់តែច្រើនកើតឡើងក្នុងរយៈពេលមុនជាងពេលក្រោយ។ ការចំណាយដែលមិនអាចដកបានគឺជាថ្លៃដើមពិតប្រាកដដកតម្លៃសង្គ្រោះ។ អាយុកាលដែលមានប្រយោជន៍គឺជាចំនួនកំឡុងពេល (ឆ្នាំធម្មតា) ដែលទ្រព្យនោះត្រូវបានរំលោះ។

source: SYD(cost; salvage value; life; period)
km: SYD (ថ្លៃដើម; តម្លៃសង្គ្រោះ; អាយុកាល; រយៈពេល)

source: SYD(5000; 200; 5; 2) equals 1280
km: SYD (៥០០០; ២០០; ៥; ២) ស្មើនឹង ១២៨០

source: The TBILLEQ functions returns the bond equivalent for a treasury bill. The maturity date must be after the settlement date but within 365 days.
km: មុខងារ TBILLEQ ត្រឡប់ចំណងស្មើនឹងវិក័យប័ត្ររតនាគារ។ ថ្ងៃដល់កំណត់បង់ត្រូវតែបន្ទាប់ពីកាលបរិច្ឆេទទូទាត់ប៉ុន្តែក្នុងរយៈពេល ៣៦៥ ថ្ងៃ។

source: TBILLEQ(settlement; maturity; discount)
km: TBILLEQ (ទូទាត់; ថ្ងៃដល់កំណត់បង់; ការបញ្ចុះតម្លៃ)

source: TBILLEQ("2/28/2001"; "8/31/2001"; 0.1) returns 0.1068
km: TBILLEQ ("2 / 28 / 2001"; "8 / 31 / 2001"; 0.1) ត្រឡប់ 0.1068

source: The TBILLPRICE functions returns the price per $100 value for a treasury bill. The maturity date must be after the settlement date but within 365 days. The discount rate must be positive.
km: មុខងារ TBILLPRICE ត្រឡប់តម្លៃក្នុងមួយ $100 តម្លៃសម្រាប់វិក្កយបត្ររតនាគារ។ ថ្ងៃដល់កំណត់បង់ត្រូវតែបន្ទាប់ពីកាលបរិច្ឆេទទូទាត់ប៉ុន្តែក្នុងរយៈពេល ៣៦៥ ថ្ងៃ។ អត្រាបញ្ចុះតម្លៃត្រូវតែមានលក្ខណៈវិជ្ជមាន។

source: TBILLPRICE(settlement; maturity; discount)
km: TBILLPRICE (ទូទាត់; ថ្ងៃដល់កំណត់បង់; ការបញ្ចុះតម្លៃ)

source: TBILLPRICE("2/28/2001"; "8/31/2001"; 0.05) returns 97.4444
km: TBILLPRICE ("2 / 28 / 2001"; "8 / 31 / 2001"; 0.05) ត្រឡប់ 97.4444

source: The TBILLYIELD functions returns the yield for a treasury bill. The maturity date must be after the settlement date but within 365 days. The price must be positive.
km: មុខងារ TBILLYIELD ត្រឡប់ទិន្នផលសម្រាប់វិក័យប័ត្ររតនាគារ។ ថ្ងៃដល់កំណត់បង់ត្រូវតែបន្ទាប់ពីកាលបរិច្ឆេទទូទាត់ប៉ុន្តែក្នុងរយៈពេល ៣៦៥ ថ្ងៃ។ តម្លៃត្រូវតែវិជ្ជមាន។

source: TBILLYIELD(settlement; maturity; price)
km: TBILLYIELD (ទូទាត់; ថ្ងៃដល់កំណត់បង់; ថ្លៃ)

source: TBILLYIELD("2/28/2001"; "8/31/2001"; 600) returns -1.63
km: TBILLYIELD ("2 / 28 / 2001"; "8 / 31 / 2001"; 600) ត្រឡប់ -1.63

source: VDB calculates the depreciation allowance of an asset with an initial value, an expected useful life, and a final value of salvage for a period specified, using the variable-rate declining balance method.
km: VDB គណនាប្រាក់ឧបត្ថម្ភរំលោះនៃទ្រព្យដែលមានតម្លៃដំបូងអាយុកាលមានប្រយោជន៍ដែលរំពឹងទុកនិងតម្លៃចុងក្រោយនៃការសង្គ្រោះសម្រាប់រយៈពេលដែលបានបញ្ជាក់ដោយប្រើវិធីសាស្ត្រតុល្យភាពការថយចុះអត្រាអថេរ។

source: VDB(cost; salvage; life; start-period; end-period; [; depreciation-factor = 2 [; switch = false ]] )
km: VDB (ថ្លៃដើម; ការសង្គ្រោះ; អាយុកាល; ពេលវេលាចាប់ផ្តើម; រយៈពេលបញ្ចប់; [; រំលោះ - កត្តា = ២ [; ប្តូរ = មិនពិត]])

source: VDB(10000;600;10;0;0.875;1.5) returns 1312.5
km: VDB (១០០០០; ៦០០; ១០; ០; ០,៨៧៥; ១,៥) ត្រឡប់ ១៣១២.៥

source: The XIRR function calculates the internal rate of return for a non-periodic series of cash flows.
km: មុខងារ XIRR គណនាអត្រាផ្ទៃក្នុងនៃការត្រឡប់មកវិញសម្រាប់ស៊េរីលំហូរមិនសាច់ប្រាក់តាមកាលកំណត់។

source: XIRR( Values; Dates[; Guess = 0.1 ] )
km: XIRR (តម្លៃ; កាលបរិច្ឆេទ [; ទាយ = ០១])

source: Dates
km: កាលបរិច្ឆេទ

source: XIRR(B1:B4;C1:C4) Suppose B1:B4 contains -20000, 4000, 12000, 8000 while C1:C4 contains "=DATE(2000;1;1)", "=DATE(2000;6;1)", "=DATE(2000;12;30)", "=DATE(2001;3;1)" returns 0.2115964
km: XIRR (B1: B4; C1: C4) ឧបមាថា B1: B4 មាន -20000, 4000, 12000, 8000 ខណៈពេលដែល C1: C4 មាន " = DATE (2000; 1; 1) ", " = DATE (2000; 6; 1) ", " = DATE (២០០០; ១២; ៣០) ", " = DATE (២០០១; ៣; ១) " ត្រឡប់ ០,២១១៥៩៦៤

source: The XNPV function calculates the net present value of a series of cash flows.
km: មុខងារ XNPV គណនាតម្លៃបច្ចុប្បន្នសុទ្ធនៃស៊េរីលំហូរសាច់ប្រាក់។

source: XNPV( Rate; Values; Dates )
km: XNPV (អត្រា; តម្លៃ; កាលបរិច្ឆេទ)
