Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/stage_guides.po
Languages: km

source: Detailed Guides
km: មគ្គុទេសក៍លម្អិត

source: This chapter describes how to perform some common tasks in &stage;.
km: ជំពូកនេះពិពណ៌នាអំពីរបៀបអនុវត្តការងារសាមញ្ញមួយចំនួននៅក្នុងឆាក។

source: Create a &HTML; Slideshow
km: បង្កើតជា HTML; ការបញ្ចាំងស្លាយ

source: Turn an existing presentation into standard &HTML; pages with accompanying navigation aids.
km: បង្វែរបទបង្ហាញដែលមានស្រាប់ទៅជា HTML ស្តង់ដារ។ ទំព័រដែលមានជំនួយការរុករក។

source: First, either make a new presentation, or open an existing one. Then, click on <menuchoice><guimenu>File</guimenu><guimenuitem>Export as HTML...</guimenuitem></menuchoice>
km: ទីមួយធ្វើបទបង្ហាញថ្មីឬបើកបទបង្ហាញដែលមានស្រាប់។ បន្ទាប់មកចុចលើ <menuchoice><guimenu> ឯកសារ </guimenu><guimenuitem> នាំចេញជា HTML ... </guimenuitem></menuchoice>

source: You will then get a dialog box asking for a few details:
km: បន្ទាប់មកអ្នកនឹងទទួលបានប្រអប់មួយដែលសួររកព័ត៌មានលំអិតមួយចំនួន៖

source: <screeninfo>Fill in the details for your &HTML; slideshow</screeninfo>
km: <screeninfo> បំពេញព័ត៌មានលម្អិតសម្រាប់ HTML របស់អ្នក។ ការបញ្ចាំងស្លាយ </screeninfo>

source: <phrase>Fill in the details for your &HTML; slideshow</phrase>
km: <phrase> បំពេញព័ត៌មានលម្អិតសម្រាប់ HTML របស់អ្នក។ ការបញ្ចាំងស្លាយ </phrase>

source: Fill in <guilabel>Title</guilabel> and <guilabel>Author</guilabel> fields. Select the slides which should be exported. If you want to change a name used on the &HTML; page for each slide double click on the name and edit it inline.
km: បំពេញ​ក្នុង <guilabel> ចំណងជើង </guilabel> និង <guilabel> អ្នកនិពន្ធ </guilabel> វាល។ ជ្រើសស្លាយដែលគួរត្រូវបាននាំចេញ។ ប្រសិនបើអ្នកចង់ផ្លាស់ប្តូរឈ្មោះដែលបានប្រើនៅលើ HTML ។ ទំព័រសម្រាប់ស្លាយនីមួយៗចុចទ្វេដងលើឈ្មោះនិងកែសម្រួលវាក្នុងជួរ។

source: In the <guilabel>Output preview</guilabel> area the downsized slides are displayed and you can check the correct slide order and browse the presentation with the <guiicon>&lt;</guiicon> and <guiicon>&gt;</guiicon> buttons.
km: ក្នុង <guilabel> ការមើលលទ្ធផលជាមុន </guilabel> ផ្ទៃស្លាយដែលត្រូវបានបង្ហាញត្រូវបានបង្ហាញហើយអ្នកអាចពិនិត្យមើលលំដាប់ស្លាយដែលត្រឹមត្រូវនិងរកមើលបទបង្ហាញជាមួយ <guiicon> វា; </guiicon> និង <guiicon> gt; </guiicon> ប៊ូតុង។

source: Now you can select a stylesheet with the configuration of the &HTML; options.
km: ឥឡូវអ្នកអាចជ្រើសសន្លឹករចនាប័ទ្មដែលមានការកំណត់រចនាសម្ព័ន្ធ HTML ។ ជំរើស។

source: To actually produce your &HTML; presentation, press the <guibutton>Export</guibutton> button and select a folder.
km: ផលិត HTML របស់អ្នក បទបង្ហាញចុចប៊ូតុង <guibutton> នាំចេញ </guibutton> និងជ្រើសថតមួយ។

source: What we now have are the newly-produced <filename>html/</filename> and <filename>pics/</filename> folders, created where we earlier set the path:
km: អ្វីដែលយើងមាននៅពេលនេះគឺផលិតផលដែលទើបនឹងផលិត <filename> html / </filename> និង <filename> រូបភាព / </filename> ថតឯកសារដែលបានបង្កើតកន្លែងដែលយើងបានកំណត់ផ្លូវ៖

source: <screeninfo>The newly created &HTML; slideshow folders</screeninfo>
km: <screeninfo> HTML ដែលបានបង្កើតថ្មី; ថតស្លាយ </screeninfo>

source: <phrase>The newly created &HTML; slideshow folders</phrase>
km: <phrase> HTML ដែលបានបង្កើតថ្មី; ថតស្លាយ </phrase>

source: There is also an <filename>index.html</filename> file to launch your web slideshow.
km: ក៏មានផងដែរ <filename> index.html </filename> ឯកសារដើម្បីចាប់ផ្តើមការបញ្ចាំងស្លាយបណ្ដាញរបស់អ្នក។

source: You can see how it works by using your file manager or web browser to open the <filename>index.html</filename> file. Click where prompted, and the first slide of your presentation is displayed. It will now behave as a &stage; slideshow.
km: អ្នកអាចមើលឃើញពីរបៀបដែលវាដំណើរការដោយប្រើកម្មវិធីគ្រប់គ្រងឯកសាររបស់អ្នកឬកម្មវិធីរុករកគេហទំព័រដើម្បីបើកឯកសារ <filename> index.html </filename> ឯកសារ ចុចកន្លែងដែលត្រូវបានជម្រុញហើយស្លាយដំបូងនៃបទបង្ហាញរបស់អ្នកត្រូវបានបង្ហាញ។ ឥឡូវនេះវានឹងមានឥរិយាបទជាដំណាក់កាលមួយ។ ការបញ្ចាំងស្លាយ។

source: Each click on the arrow icons take you to the next or previous slide. To get back to the start of the slideshow click on the slide icon.
km: ការចុចលើរូបតំណាងព្រួញនាំអ្នកទៅស្លាយបន្ទាប់ឬបន្ទាប់។ ដើម្បីត្រលប់ទៅការចាប់ផ្តើមនៃការបញ្ចាំងស្លាយសូមចុចលើរូបតំណាងស្លាយ។

source: To share your presentation with the world, transfer the newly-produced files to a network-accessible location (&ie; webspace), remembering to keep the folder structure intact.
km: ដើម្បីចែករំលែកបទបង្ហាញរបស់អ្នកទៅកាន់ពិភពលោកសូមផ្ទេរឯកសារដែលបានបង្កើតថ្មីទៅទីតាំងដែលអាចចូលដំណើរការបានតាមបណ្តាញ (ឧទាហរណ៍ webspace) ដោយចងចាំរក្សារចនាសម្ព័ន្ធថតនៅដដែល។

source: Creating &stage; Templates
km: ការបង្កើតដំណាក់កាល; ពុម្ព

source: It is very easy to create a new template for &stage;.
km: វាងាយស្រួលណាស់ក្នុងការបង្កើតគំរូថ្មីសម្រាប់ឆាក។

source: If you have made a presentation in a style that you would like to use again, you can save it as a template.
km: ប្រសិនបើអ្នកបានធ្វើបទបង្ហាញតាមរបៀបមួយដែលអ្នកចង់ប្រើម្តងទៀតអ្នកអាចរក្សាទុកវាជាគំរូ។

source: This tutorial will show how we can make a new template and save it.
km: ការបង្រៀននេះនឹងបង្ហាញពីរបៀបដែលយើងអាចបង្កើតគំរូថ្មីហើយរក្សាទុកវា។

source: Open &stage; and create a new document.
km: ដំណាក់កាលបើកចំហ; និងបង្កើតឯកសារថ្មី។

source: To add a little sparkle to the blank slide, we can change the slide background - do this by selecting the <guilabel>Document background</guilabel> tool in the Tools docker.
km: ដើម្បីបន្ថែមពន្លឺភ្លើងបន្តិចបន្តួចទៅស្លាយទទេយើងអាចផ្លាស់ប្តូរផ្ទៃខាងក្រោយស្លាយ - ធ្វើដូចនេះដោយជ្រើសរើសប៊ូតុង <guilabel> សាវតាឯកសារ </guilabel> ឧបករណ៍នៅក្នុងឧបករណ៍ចត។

source: We want the background to look attractive, so you may choose to use an image as a background by clicking the <guibutton>Set image</guibutton> button: feel free to experiment, but keep it beautiful!
km: យើងចង់ឱ្យផ្ទៃខាងក្រោយមើលទៅគួរឱ្យទាក់ទាញដូច្នេះអ្នកអាចជ្រើសរើសប្រើរូបភាពជាផ្ទៃខាងក្រោយដោយចុចលើប៊ូតុង <guibutton> កំណត់រូបភាព </guibutton> ប៊ូតុង: មានអារម្មណ៍ថាមានសេរីភាពក្នុងការពិសោធន៍ប៉ុន្តែរក្សាវាឱ្យស្រស់ស្អាត!

source: <screeninfo>Choosing a slide background</screeninfo>
km: <screeninfo> ការជ្រើសរើសផ្ទៃខាងក្រោយស្លាយ </screeninfo>

source: <phrase>Choosing a slide background</phrase>
km: <phrase> ការជ្រើសរើសផ្ទៃខាងក្រោយស្លាយ </phrase>

source: The page should now have the background you desire. Create a text box, and type a heading for your slide:
km: ទំព័រគួរតែមានផ្ទៃខាងក្រោយដែលអ្នកចង់បាន។ បង្កើតប្រអប់អត្ថបទហើយវាយចំណងជើងសម្រាប់ស្លាយរបស់អ្នក៖

source: <screeninfo>Adding a Heading to the new template</screeninfo>
km: <screeninfo> ការបន្ថែមក្បាលទៅទំព័រគំរូថ្មី </screeninfo>

source: <phrase>Adding a Heading to the new template</phrase>
km: <phrase> ការបន្ថែមក្បាលទៅទំព័រគំរូថ្មី </phrase>

source: When you are happy with your template, go to <menuchoice><guimenu>File</guimenu> <guimenuitem>Save As</guimenuitem></menuchoice> and select <guilabel>Opendocument Presentation Template</guilabel> filetype in the file dialog.
km: នៅពេលអ្នកសប្បាយចិត្តនឹងគំរូរបស់អ្នកសូមចូលទៅ <menuchoice><guimenu> ឯកសារ </guimenu><guimenuitem> រក្សាទុក​ជា </guimenuitem></menuchoice> ហើយជ្រើសរើស <guilabel> គំរូបទបង្ហាញនៃអូឌីយ៉ូ </guilabel> ប្រភេទឯកសារក្នុងប្រអប់ឯកសារ។
