Repository: koompi/kde-khmer-translation
Catalog: documentation_*_stable_kf5-based/docmessages/calligra/stage_tutorial.po
Languages: km

source: A Step-By-Step Tutorial
km: ការណែនាំជាជំហាន ៗ

source: In this chapter, &stage; is introduced using a simple tutorial. We shall walk through the most basic steps that are involved in creating a presentation, and adding some basic effects.
km: នៅក្នុងជំពូកនេះ, ដំណាក់កាល; ត្រូវបានណែនាំដោយប្រើការបង្រៀនសាមញ្ញ។ យើងត្រូវដើរតាមជំហានមូលដ្ឋានភាគច្រើនដែលពាក់ព័ន្ធនឹងការបង្កើតបទបង្ហាញនិងបន្ថែមបែបផែនមូលដ្ឋានមួយចំនួន។

source: Start a new document
km: ចាប់ផ្តើមឯកសារថ្មី

source: When you start &stage;, the usual &calligra; startup dialog appears.
km: នៅពេលអ្នកចាប់ផ្តើមដំណាក់កាល; អក្សរផ្ចង់ធម្មតា; ប្រអប់ចាប់ផ្តើមលេចឡើង។

source: The <guilabel>&calligra;</guilabel> startup dialog
km: នេះ <guilabel> calligra; </guilabel> ប្រអប់ចាប់ផ្តើម

source: The &calligra; startup dialog
km: អក្សរផ្ចង់ ប្រអប់ចាប់ផ្តើម

source: Select <guilabel>Screen</guilabel> on the left then select the template labeled <guilabel>Empty</guilabel> (highlighted in blue in the screenshot above) by clicking on it. You can check <guilabel>Always use this template</guilabel> to make it the default template.
km: ជ្រើសរើស <guilabel> អេក្រង់ </guilabel> នៅខាងឆ្វេងបន្ទាប់មកជ្រើសរើសគំរូដែលមានស្លាក <guilabel> ទទេ </guilabel> (បានរំលេចពណ៌ខៀវក្នុងរូបថតអេក្រង់ខាងលើ) ដោយចុចលើវា។ អ្នកអាចពិនិត្យ <guilabel> ប្រើគំរូនេះជានិច្ច </guilabel> ដើម្បីធ្វើឱ្យវាក្លាយជាគំរូលំនាំដើម។

source: Now click <guibutton>Use This Template</guibutton>. This brings up the slide editor window, where you can view and edit the slides (and objects contained in them) in your document.
km: ឥឡូវចុច <guibutton> ប្រើទំព័រគំរូនេះ </guibutton> ។ វាបង្ហាញផ្ទាំងកម្មវិធីនិពន្ធស្លាយដែលអ្នកអាចមើលនិងកែសម្រួលស្លាយ (និងវត្ថុដែលមាននៅក្នុងពួកវា) នៅក្នុងឯកសាររបស់អ្នក។

source: At the moment, we just have one empty slide, so select the upper left slide with the single text box from the <guilabel>Slide Layouts</guilabel> docker.
km: នៅពេលនេះយើងទើបតែមានស្លាយទទេមួយដូច្នេះសូមជ្រើសរើសស្លាយខាងឆ្វេងខាងលើដែលមានប្រអប់អត្ថបទតែមួយពី <guilabel> ប្លង់ស្លាយ </guilabel> ចត។

source: Double-click the text box. The cursor changes to a vertical bar to show that you can now type some text.
km: ចុចទ្វេដងលើប្រអប់អត្ថបទ។ ទស្សន៍ទ្រនិចផ្លាស់ប្តូរទៅរបារបញ្ឈរដើម្បីបង្ហាញថាឥឡូវអ្នកអាចវាយអត្ថបទខ្លះ។

source: <screeninfo>The text insertion cursor</screeninfo>
km: <screeninfo> ទស្សន៍ទ្រនិចបញ្ចូលអត្ថបទ </screeninfo>

source: <phrase>The text insertion cursor</phrase>
km: <phrase> ទស្សន៍ទ្រនិចបញ្ចូលអត្ថបទ </phrase>

source: Go ahead, type some text!
km: ទៅមុខវាយអត្ថបទខ្លះ!

source: <screeninfo>Adding text</screeninfo>
km: <screeninfo> ការបន្ថែមអត្ថបទ </screeninfo>

source: <phrase>Adding text</phrase>
km: <phrase> ការបន្ថែមអត្ថបទ </phrase>

source: Click away from the text to de-select the text box when you are done typing.
km: ចុចឆ្ងាយពីអត្ថបទដើម្បីដកប្រអប់អត្ថបទពេលអ្នកវាយបញ្ចូលរួច។

source: Add a new page
km: បន្ថែមទំព័រថ្មី

source: Let's now add a new slide to our document. To do so, click the <guimenu>Slide</guimenu> menu, and then click on <guimenuitem>Insert Slide</guimenuitem>.
km: ឥឡូវសូមបន្ថែមស្លាយថ្មីទៅឯកសាររបស់យើង។ ដើម្បីធ្វើដូចនេះចុចលើប៊ូតុង <guimenu> រុញ </guimenu> ម៉ឺនុយ, ហើយបន្ទាប់មកចុចលើ <guimenuitem> បញ្ចូលស្លាយ </guimenuitem>

source: Now we can decide what the new slide should look like. This time, select one column layout (highlighted in blue.)
km: ឥឡូវនេះយើងអាចសម្រេចចិត្តថាតើស្លាយថ្មីគួរមានលក្ខណៈដូចម្តេច។ លើកនេះសូមជ្រើសរើសប្លង់ជួរឈរមួយ (រំលេចជាពណ៌ខៀវ។ )

source: <screeninfo>Choosing a layout for the new page</screeninfo>
km: <screeninfo> ការជ្រើសរើសប្លង់សម្រាប់ទំព័រថ្មី </screeninfo>

source: <phrase>Choosing a layout for the new page</phrase>
km: <phrase> ការជ្រើសរើសប្លង់សម្រាប់ទំព័រថ្មី </phrase>

source: The new slide layout now appears in the editing window. To change between pages of your presentation, you can select slides in the pane to the left (highlighted in blue for this screenshot).
km: ប្លង់ស្លាយថ្មីលេចឡើងក្នុងផ្ទាំងកម្មវិធីកែសម្រួល។ ដើម្បីផ្លាស់ប្តូររវាងទំព័រនៃបទបង្ហាញរបស់អ្នកអ្នកអាចជ្រើសរើសផ្ទាំងស្លាយនៅខាងឆ្វេងទៅខាងឆ្វេង (បន្លិចពណ៌ខៀវសម្រាប់រូបថតអេក្រង់នេះ) ។

source: The newly inserted slide has two text boxes. There is one for a title, and another to contain a bulleted list of items.
km: ស្លាយដែលបានបញ្ចូលថ្មីមានប្រអប់អត្ថបទពីរ។ មានមួយសម្រាប់ចំណងជើងហើយមួយទៀតមានបញ្ជីធាតុដែលមានចំណុច។

source: <screeninfo>The new slide</screeninfo>
km: <screeninfo> ស្លាយថ្មី </screeninfo>

source: <phrase>The new slide</phrase>
km: <phrase> ស្លាយថ្មី </phrase>

source: Double-click and type a title. Then double-click on the second text box with the bullet. Type some text and end the paragraph by pressing the <keycap>Enter</keycap> or <keycap>Return</keycap> key. As you type new paragraphs, bullets automatically appear in front of them.
km: ចុចទ្វេដងហើយវាយចំណងជើង។ បន្ទាប់មកចុចទ្វេដងលើប្រអប់អត្ថបទទីពីរដោយប្រើចំណុច។ វាយបញ្ចូលអត្ថបទខ្លះហើយបញ្ចប់កថាខណ្ឌដោយចុចប៊ូតុង <keycap> បញ្ចូល </keycap> ឬ <keycap> ត្រឡប់ </keycap> កូនសោ។ នៅពេលអ្នកវាយបញ្ចូលកថាខណ្ឌថ្មីចំណុចនឹងលេចឡើងដោយស្វ័យប្រវត្តិនៅពីមុខពួកគេ។

source: <screeninfo>Adding text to the second slide</screeninfo>
km: <screeninfo> ការបន្ថែមអត្ថបទទៅស្លាយទីពីរ </screeninfo>

source: <phrase>Adding text to the second slide</phrase>
km: <phrase> ការបន្ថែមអត្ថបទទៅស្លាយទីពីរ </phrase>

source: You can de-select the text box by clicking away from it.
km: អ្នកអាចដកប្រអប់អត្ថបទដោយចុចឆ្ងាយពីវា។

source: Insert a picture
km: បញ្ចូលរូបភាព

source: Let's go back to the first slide now. Use the list of slides on the left of your screen.
km: សូមត្រលប់ទៅស្លាយដំបូងឥឡូវនេះ។ ប្រើបញ្ជីស្លាយនៅខាងឆ្វេងអេក្រង់របស់អ្នក។

source: In this section, we'll liven our presentation up a bit by adding a nice logo to the title page. To do so, the first step is to enable the <guilabel>Add Shape</guilabel> docker using <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Dockers</guimenuitem></menuchoice> from the menu.
km: នៅក្នុងផ្នែកនេះយើងនឹងធ្វើបទបង្ហាញរបស់យើងបន្តិចដោយបន្ថែមឡូហ្គូដ៏ស្រស់ស្អាតទៅទំព័រចំណងជើង។ ដើម្បីធ្វើដូចនេះជំហានដំបូងគឺត្រូវបើកឯកសារ <guilabel> បន្ថែមរាង </guilabel> ចតដោយប្រើ <menuchoice><guimenu> ការកំណត់ </guimenu><guimenuitem> អ្នកចត </guimenuitem></menuchoice> ពីម៉ឺនុយ។

source: Now select Image in the <guilabel>Add Shape</guilabel> docker and click with the &LMB; where you want to place the loge in it's original size or draw a rectangle with the left mouse (click the &LMB; and keep the button pressed) to specify the position and size for the logo.
km: ឥឡូវជ្រើសរូបភាពនៅក្នុងឯកសារ <guilabel> បន្ថែមរាង </guilabel> ចតហើយចុចលើប៊ូតុងអិល។ កន្លែងដែលអ្នកចង់ដាក់ឡូហ្គូក្នុងទំហំដើមរបស់វាឬគូរចតុកោណកែងដោយប្រើកណ្ដុរខាងឆ្វេង (ចុចប៊ូតុងអិលចុចនិងសង្កត់ប៊ូតុង) ដើម្បីបញ្ជាក់ទីតាំងនិងទំហំសម្រាប់រូបសញ្ញា។

source: A file selection dialog appears. To learn about this or other standard &kde; dialog boxes in detail, please consult the &kde; documentation. You can browse by clicking on <guiicon>folder</guiicon> icons or by using the <guiicon>browser</guiicon> style buttons on the toolbar. Clicking the <guiicon>up arrow</guiicon> takes you up one folder level.
km: ប្រអប់ជ្រើសរើសឯកសារនឹងលេចចេញមក។ ដើម្បីស្វែងយល់អំពីបញ្ហានេះឬស្តង់ដារ KDE ផ្សេងទៀត។ ប្រអប់លម្អិតសូមពិគ្រោះជាមួយ។ ឯកសារ។ អ្នកអាចរកមើលដោយចុចលើ <guiicon> ថតឯកសារ </guiicon> រូបតំណាងឬដោយប្រើ <guiicon> កម្មវិធីរុករក </guiicon> ប៊ូតុងរចនាប័ទ្មនៅលើរបារឧបករណ៍។ ចុចប៊ូតុង <guiicon> ព្រួញ​ឡើង​លើ </guiicon> នាំអ្នកបង្កើនកម្រិតថតមួយ។

source: Select a file and click <guibutton>OK</guibutton>.
km: ជ្រើសរើសឯកសារហើយចុច <guibutton> យល់ព្រម </guibutton>

source: Now the image is inserted in the slide and there are selection handles (little squares) visible around the border of the graphic.
km: ឥឡូវរូបភាពត្រូវបានបញ្ចូលទៅក្នុងស្លាយហើយមានចំណុចទាញជម្រើស (ការ៉េតិចតួច) ដែលអាចមើលឃើញនៅជុំវិញព្រំដែននៃក្រាហ្វិក។

source: <screeninfo>The newly added image</screeninfo>
km: <screeninfo> រូបភាពបន្ថែមថ្មី </screeninfo>

source: <phrase>The newly added image</phrase>
km: <phrase> រូបភាពបន្ថែមថ្មី </phrase>

source: Place the mouse cursor anywhere in the middle of the logo, and drag it to the middle of the title page. Then use the selection handles to resize it correctly.
km: ដាក់ទស្សន៍ទ្រនិចម៉ៅគ្រប់ទីកន្លែងនៅកណ្តាលឡូហ្គោហើយអូសវាទៅពាក់កណ្តាលទំព័រចំណងជើង។ បន្ទាប់មកប្រើចំណុចទាញជម្រើសដើម្បីផ្លាស់ប្តូរទំហំវាឱ្យបានត្រឹមត្រូវ។

source: That's it. Now you have a picture on the title page!
km: នោះ​ហើយ​ជា​វា។ ឥឡូវអ្នកមានរូបភាពនៅលើទំព័រចំណងជើង!

source: Insert a &calligra; object
km: បញ្ចូលអក្សរផ្ចង់មួយ។ វត្ថុ

source: Let's insert another &calligra; object under the picture, for example a chart.
km: តោះបញ្ចូលអក្សរផ្ចង់មួយទៀត។ វត្ថុនៅក្រោមរូបភាពឧទាហរណ៍តារាង។

source: Every &calligra; supported object can be embedded in a &stage; slide. Let's choose a chart from the <guilabel>Add Shape</guilabel> docker.
km: រាល់ calligra; វត្ថុដែលគាំទ្រអាចត្រូវបានបង្កប់នៅក្នុងដំណាក់កាលមួយ។ រុញ តោះជ្រើសរើសគំនូសតាងពីខ <guilabel> បន្ថែមរាង </guilabel> ចត។

source: Select <guilabel>Chart</guilabel> and then outline with your mouse the area you want to put your chart in on the &stage; slide.
km: ជ្រើសរើស <guilabel> គំនូសតាង </guilabel> ហើយបន្ទាប់មកគូសបញ្ជាក់ដោយប្រើម៉ៅលើផ្ទៃដែលអ្នកចង់ដាក់តារាងរបស់អ្នកនៅលើឆាក។ រុញ

source: <screeninfo>Select the area where to put the chart</screeninfo>
km: <screeninfo> ជ្រើសរើសតំបន់ដែលត្រូវដាក់គំនូសតាង </screeninfo>

source: <phrase>Select the area where to put the chart</phrase>
km: <phrase> ជ្រើសរើសតំបន់ដែលត្រូវដាក់គំនូសតាង </phrase>

source: Once you release the mouse button, a template chart is added on the slide. Whenever you work in the chart, its <guilabel>Tool Options</guilabel> appear in the docker.
km: នៅពេលដែលអ្នកលែងប៊ូតុងម៉ៅគំនូសតាងគំរូត្រូវបានបន្ថែមនៅលើស្លាយ។ រាល់ពេលដែលអ្នកធ្វើការក្នុងតារាងវា <guilabel> ជម្រើសឧបករណ៍ </guilabel> បង្ហាញនៅក្នុងផែ

source: <screeninfo>&kchart; Tool Options</screeninfo>
km: <screeninfo> kchart; ជម្រើសឧបករណ៍ </screeninfo>

source: <phrase>&kchart; Tool Options</phrase>
km: <phrase> kchart; ជម្រើសឧបករណ៍ </phrase>

source: To move, resize or even delete the embedded chart switch to the <guibutton>Basic shape manipulation</guibutton> tool and click anywhere within the chart area. It should now appear with a green border and with a small yellow square at each corner and in the middle of each edge.
km: ដើម្បីផ្លាស់ទីប្តូរទំហំឬលុបប៊ូតុងប្តូរគំនូសតាងដែលបានបង្កប់ចូលទៅក្នុងឯកសារ <guibutton> ឧបាយកលរាងមូលដ្ឋាន </guibutton> ហើយចុចកន្លែងណាមួយនៅក្នុងតំបន់តារាង។ ឥលូវនេះវាគួរតែលេចឡើងជាមួយព្រំប្រទល់ពណ៌បៃតងនិងជាមួយការ៉េពណ៌លឿងតូចមួយនៅជ្រុងនីមួយៗនិងនៅកណ្តាលគែមនីមួយៗ។

source: If you move the cursor over any of the squares it should change to a double headed arrow. You can resize the chart by dragging one of these squares with the <mousebutton>left</mousebutton> mouse button pressed. To delete the chart <mousebutton>right</mousebutton> click on one of the squares and select <guimenuitem>Delete</guimenuitem>.
km: ប្រសិនបើអ្នកផ្លាស់ទីទស្សន៍ទ្រនិចលើជ្រុងណាមួយវាគួរតែប្តូរទៅព្រួញក្បាលពីរ។ អ្នកអាចផ្លាស់ប្តូរទំហំតារាងដោយអូសមួយនៃការេទាំងនេះជាមួយ <mousebutton> ឆ្វេង </mousebutton> ចុចប៊ូតុងម៉ៅ។ ដើម្បីលុបគំនូសតាង <mousebutton> ត្រឹមត្រូវ </mousebutton> ចុចលើទីលានមួយហើយជ្រើសរើស <guimenuitem> លុប </guimenuitem>

source: To move the chart move the cursor into the chart. The cursor should then change to a cross, press the <mousebutton>left</mousebutton> mouse button and you will be able to drag the chart to where you want it to be.
km: ដើម្បីផ្លាស់ទីគំនូសតាងផ្លាស់ទីទស្សន៍ទ្រនិចទៅក្នុងគំនូសតាង។ ទស្សន៍ទ្រនិចគួរតែផ្លាស់ប្តូរទៅជាឈើឆ្កាងចុចប៊ូតុង <mousebutton> ឆ្វេង </mousebutton> ប៊ូតុងម៉ៅហើយអ្នកនឹងអាចអូសតារាងទៅកន្លែងដែលអ្នកចង់បាន។

source: To restore the chart to its normal appearance simply click anywhere outside of the chart area.
km: ដើម្បីស្តារគំនូសតាងឡើងវិញទៅជារូបរាងធម្មតារបស់វាគ្រាន់តែចុចកន្លែងណាផ្សេងទៀតក្រៅពីតំបន់តារាង។

source: To change the format of the chart itself <mousebutton>left</mousebutton> click twice within the chart area. The chart <guilabel>Tools Options</guilabel> should appear in the docker. You can then use these tools to edit the chart properties like chart type, labels, axis and data.
km: ដើម្បីផ្លាស់ប្តូរទ្រង់ទ្រាយតារាងដោយខ្លួនឯង <mousebutton> ឆ្វេង </mousebutton> ចុចពីរដងក្នុងផ្ទៃគំនូសតាង។ តារាង <guilabel> ជម្រើសឧបករណ៍ </guilabel> គួរតែបង្ហាញនៅក្នុងផែ។ បន្ទាប់មកអ្នកអាចប្រើឧបករណ៍ទាំងនេះដើម្បីកែសម្រួលលក្ខណសម្បត្តិគំនូសតាងដូចជាប្រភេទគំនូសតាងស្លាកអ័ក្សនិងទិន្នន័យ។

source: Click anywhere with the &LMB; outside the chart to go back to &stage; slide.
km: ចុចកន្លែងណាមួយជាមួយអិលអូអិល។ នៅខាងក្រៅគំនូសតាងដើម្បីត្រលប់ទៅដំណាក់កាល; រុញ

source: A single click on the chart will allow you to drag it to change its location and also to drag the borders to make it bigger as with any other &stage; object. Double click on the chart to get into &kchart; mode and modify any of the chart property.
km: ការចុចតែមួយដងលើគំនូសតាងនឹងអនុញ្ញាតឱ្យអ្នកអូសវាផ្លាស់ប្តូរទីតាំងរបស់វាហើយក៏អាចទាញព្រំដែនដើម្បីធ្វើឱ្យវាធំជាងដូចដំណាក់កាលផ្សេងទៀតដែរ។ វត្ថុ ចុចទ្វេដងលើតារាងដើម្បីចូលទៅក្នុង kchart; របៀបនិងកែប្រែលក្ខណសម្បត្តិគំនូសតាងណាមួយ។

source: Change the color of the title text
km: ផ្លាស់ប្តូរពណ៌នៃអត្ថបទចំណងជើង

source: Let's finish by changing the color of the title text from black to blue. To do so, select the title text by double-clicking the text box and select the text.
km: តោះបញ្ចប់ដោយប្តូរពណ៌ចំណងជើងអត្ថបទពីខ្មៅទៅខៀវ។ ដើម្បីធ្វើដូច្នេះសូមជ្រើសរើសអត្ថបទចំណងជើងដោយចុចទ្វេដងលើប្រអប់អត្ថបទហើយជ្រើសរើសអត្ថបទ។

source: Open the color selector by clicking on the <inlinemediaobject><imageobject> <imagedata fileref="22x22-actions-format-text-color.png" format="PNG"/></imageobject> </inlinemediaobject> icon in the Text editing Tools Options (this icon has a Text Color... tooltip).
km: បើកឧបករណ៍ជ្រើសរើសពណ៌ដោយចុចលើប៊ូតុង <inlinemediaobject><imageobject><imagedata fileref="22x22-actions-format-text-color.png" format="PNG"/></imageobject></inlinemediaobject> រូបតំណាងនៅក្នុងជម្រើសឧបករណ៍កែអត្ថបទ (រូបតំណាងនេះមានព័ត៌មានជំនួយពណ៌ ... ព័ត៌មានជំនួយ) ។

source: <screeninfo>The color selector</screeninfo>
km: <screeninfo> ឧបករណ៍ជ្រើសរើសពណ៌ </screeninfo>

source: <phrase>The color selector</phrase>
km: <phrase> ឧបករណ៍ជ្រើសរើសពណ៌ </phrase>

source: Change the color to blue.
km: ផ្លាស់ប្តូរពណ៌ទៅជាពណ៌ខៀវ។

source: Changing the color of the selected text to blue changes its appearance. The exact color that highlighted text turns depends on your system color scheme.
km: ការផ្លាស់ប្តូរពណ៌នៃអត្ថបទដែលបានជ្រើសរើសទៅជាពណ៌ខៀវផ្លាស់ប្តូររូបរាងរបស់វា។ ពណ៌ពិតប្រាកដដែលបន្លិចការប្រែអត្ថបទអាស្រ័យលើពណ៌ចម្រុះប្រព័ន្ធរបស់អ្នក។

source: Text color selection is also available on the <guilabel>Decorations</guilabel> tab of the <guilabel>Select Font</guilabel> dialog. Open this dialog with <guimenuitem>Font</guimenuitem> in the <guimenu>Format</guimenu> menu or context menu.
km: ជម្រើសពណ៌អត្ថបទក៏មាននៅលើគេហទំព័រដែរ <guilabel> ការតុបតែង </guilabel> ផ្ទាំងនៃ <guilabel> ជ្រើសរើសពុម្ពអក្សរ </guilabel> ប្រអប់។ បើកប្រអប់នេះជាមួយ <guimenuitem> ពុម្ពអក្សរ </guimenuitem> ក្នុង <guimenu> ទ្រង់ទ្រាយ </guimenu> ឬម៉ឺនុយបរិបទ។

source: Now click away from the text to de-select it.
km: ឥឡូវចុចឆ្ងាយពីអត្ថបទដើម្បីដកវាចេញ។

source: <screeninfo>The finished title</screeninfo>
km: <screeninfo> ចំណងជើងបញ្ចប់ </screeninfo>

source: <phrase>The finished title</phrase>
km: <phrase> ចំណងជើងបញ្ចប់ </phrase>

source: Now that there are two slides, why not try a slide show! To start the slide show, press the <guiicon>Start Presentation</guiicon> button in the toolbar. The first slide should appear on your screen.
km: ឥឡូវមានស្លាយពីរហេតុអ្វីមិនសាកល្បងបញ្ចាំងស្លាយ! ដើម្បីចាប់ផ្តើមបញ្ចាំងស្លាយចុចប៊ូតុង <guiicon> ចាប់ផ្តើមបទបង្ហាញ </guiicon> ប៊ូតុងនៅក្នុងរបារឧបករណ៍។ ស្លាយដំបូងគួរតែលេចឡើងនៅលើអេក្រង់របស់អ្នក។

source: To advance from the first slide to the next, just click anywhere on the screen, or use the <keycap>Page Down</keycap> key.
km: ដើម្បីរំកិលពីស្លាយទីមួយទៅបន្ទាប់គ្រាន់តែចុចកន្លែងណាមួយនៅលើអេក្រង់ឬប្រើប៊ូតុង <keycap> ទំព័រក្រោម </keycap> កូនសោ។

source: To exit the slide show, press the &Esc; key.
km: ដើម្បីចេញពីការបញ្ចាំងស្លាយសូមចុចលើ Esc; កូនសោ។
