Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/bluedevil/bluedevil.po
Languages: km

# NAME OF TRANSLATORS
source: Your names
km: ឈ្មោះរបស់អ្នក

# EMAIL OF TRANSLATORS
source: Your emails
km: អ៊ីមែលរបស់អ្នក

source: Bluetooth
km: ប៊្លូធូស

# DeviceName Network (Service)
source: %1 Network (%2)
km: %1 បណ្តាញ (%2)

source: Bluetooth Daemon
km: ដេមិនប៊្លូធូស

source: (c) 2010, UFO Coders
km: (c) ឆ្នាំ ២០១០ អ្នកសរសេរកូដ UFO

source: Maintainer
km: អ្នកថែរក្សា

source: Previous Maintainer
km: អ្នកថែរក្សាមុន

source: %1 is requesting access to this computer
km: %1 កំពុងស្នើសុំចូលប្រើកុំព្យូទ័រនេះ

# Button to trust a bluetooth remote device and authorize it to connect
source: Trust && Authorize
km: ផ្តល់សិទ្ធិទុកចិត្ត

# Button to authorize a bluetooth remote device to connect
source: Authorize Only
km: អនុញ្ញាតតែប៉ុណ្ណោះ

# Deny access to a remote bluetooth device
source: Deny
km: បដិសេធ

source: %1 is asking if the PIN is correct: %2
km: %1 កំពុងសួរថាតើលេខសម្ងាត់ត្រឹមត្រូវទេ៖ %2

# Notification button to know if the pin is correct or not
source: PIN correct
km: លេខសម្ងាត់ត្រឹមត្រូវ

# Notification button to say that the PIN is wrong
source: PIN incorrect
km: លេខសម្ងាត់មិនត្រឹមត្រូវ

source: PIN needed to pair with %1
km: កូដ PIN ចាំបាច់ដើម្បីផ្គូផ្គងជាមួយ %1

source: Introduce PIN
km: ការអំពីណែនាំ PIN

# Shown in the caption of a dialog where the user introduce the PIN
source: Introduce PIN
km: ណែនាំលេខសម្ងាត់

source: In order to pair this computer with %1, you have to enter a PIN. Please do it below.
km: ដើម្បីភ្ជាប់កុំព្យូទ័រនេះជាមួយ %1 អ្នកត្រូវបញ្ចូលកូដ PIN ។ សូមធ្វើវានៅខាងក្រោម។

source: PIN:
km: កូដ PIN៖

source: %1 is sending you the file %2
km: %1 កំពុងផ្ញើឯកសារមកអ្នក %2

source: Accept
km: ព្រមទទួល

# Deny the incoming file transfer
source: Cancel
km: បដិសេធ

source: Receiving file over Bluetooth
km: ទទួលឯកសារតាមរយៈប៊្លូធូស

# File transfer origin
source: From
km: ពី

# File transfer destination
source: To
km: ទៅ

source: Saving file failed
km: ការរក្សាទុកឯកសារបានបរាជ័យ

source: Bluetooth transfer failed
km: ការផ្ទេរប៊្លូធូសបានបរាជ័យ

source: Send File
km: ផ្ញើឯកសារ

source: Browse Files
km: រកមើលឯកសារ

source: No Bluetooth adapters have been found.
km: រកមិនឃើញអាដាប់ទ័រប៊្លូធូសទេ។

source: Retrieving services...
km: កំពុងទទួលយកសេវាកម្ម ...

source: This address is unavailable.
km: អាសយដ្ឋាននេះមិនមានទេ។

source: Received Files
km: ឯកសារទទួល

source: Scanning for new devices...
km: កំពុងស្កេនរកឧបករណ៍ថ្មី ...

source: Obexd service is not running.
km: សេវាកម្ម Obexd មិនដំណើរការទេ។

source: Retrieving information from remote device...
km: កំពុងទៅយកព័ត៌មានពីឧបករណ៍ពីចម្ងាយ ...

source: Connecting to the device
km: ភ្ជាប់ទៅនឹងឧបករណ៍

source: Phone memory
km: មេម៉ូរីទូរស័ព្ទ

source: External memory
km: ការចងចាំខាងក្រៅ

source: Bluetooth is disabled.
km: ប៊្លូធូសត្រូវបានបិទ។

# Action to enable Bluetooth adapter
source: Enable
km: បើកដំណើរការ

source: Your Bluetooth adapter is powered off.
km: អាដាប់ទ័រប៊្លូធូសរបស់អ្នកត្រូវបានបិទ។

# Action to turn on Bluetooth adapter
source: Turn On
km: បើក

source: Bluetooth Send File Wizard
km: អ្នកជំនួយការផ្ញើឯកសារប៊្លូធូស

source: Specify receiving device by MAC address.
km: បញ្ជាក់ឧបករណ៍ទទួលដោយអាសយដ្ឋាន MAC ។

source: Specify receiving device by UBI path.
km: បញ្ជាក់ឧបករណ៍ទទួលដោយផ្លូវ UBI ។

source: Files to be sent.
km: ឯកសារដែលត្រូវផ្ញើ។

# Connecting to a Bluetooth device
source: Connecting to %1...
km: កំពុងភ្ជាប់ទៅ %1...

# This string is shown when the wizard fail
source: The connection to the device has failed
km: ការភ្ជាប់ទៅឧបករណ៍បានបរាជ័យ

source: The connection to %1 has failed
km: ការភ្ជាប់ទៅ %1 បានបរាជ័យ

source: Open file...
km: បើក​ឯកសារ...

source: Select one or more files:
km: ជ្រើសរើសឯកសារមួយរឺច្រើន៖

source: Selected files: <b>%1</b>
km: ឯកសារដែលបានជ្រើសរើស៖ <b> %1 </b>

source: Select a device from the list:
km: ជ្រើសឧបករណ៍ពីបញ្ជី៖

# Send files to a Bluetooth device
source: Send to %1
km: ផ្ញើទៅ %1

source: Sending file over Bluetooth
km: ផ្ញើឯកសារតាមប៊្លូធូស

source: Send Files
km: ផ្ញើឯកសារ

source: Cancel
km: បោះបង់

source: Save received files to:
km: រក្សាទុកឯកសារដែលបានទទួលទៅ៖

source: Whether allow to modify shared files
km: ថាតើអនុញ្ញាតឱ្យកែប្រែឯកសារដែលបានចែករំលែក

# Action to go to the next page on the wizard
source: Next
km: បន្ទាប់

# Action to finish the wizard
source: Finish
km: បញ្ចប់

source: Bluetooth Device Wizard
km: អ្នកជំនួយការឧបករណ៍ប៊្លូធូស

source: Select a device
km: ជ្រើសរើសឧបករណ៍មួយ

# Action to fix a problem
source: Fix it
km: ជួសជុល​វា​, ឬ​ដោះ​ស្រាយ​វា

source: Your Bluetooth adapter is not pairable.
km: អាដាប់ទ័រប៊្លូធូសរបស់អ្នកមិនអាចវាស់បានទេ។

# Action to make Bluetooth adapter pairable
source: Make Pairable
km: ធ្វើឱ្យ Pairable

source: Scanning...
km: កំពុងស្កេន ...

source: Manual PIN:
km: កូដ PIN ដោយដៃ៖

# Button offered when the wizard fail. This button will restart the wizard
source: Restart the wizard
km: ចាប់ផ្តើមអ្នកជំនួយការឡើងវិញ

# Button that closes the wizard
source: Close
km: បិទ

# This string is shown when the wizard fail
source: The setup of the device has failed
km: ការរៀបចំឧបករណ៍បានបរាជ័យ

source: The setup of %1 has failed
km: ការរៀបចំ %1 បានបរាជ័យ

source: Connecting to %1...
km: កំពុងភ្ជាប់ទៅ %1 ...

source: Please introduce the PIN in your keyboard when it appears and press Enter
km: សូមណែនាំលេខកូដ PIN នៅក្នុងក្តារចុចរបស់អ្នកនៅពេលវាបង្ហាញហើយចុច Enter

source: Please introduce the PIN in your device when it appears
km: សូមណែនាំលេខសម្ងាត់នៅក្នុងឧបករណ៍របស់អ្នកនៅពេលវាលេចចេញមក

source: Matches
km: ការប្រកួត

source: Does not match
km: មិនត្រូវគ្នា

source: Please, confirm that the PIN displayed on %1 matches the wizard one.
km: សូមបញ្ជាក់ថាលេខសម្ងាត់ដែលបង្ហាញនៅលើ %1 ត្រូវនឹងអ្នកជំនួយការ។

source: Setup Finished
km: ការរៀបចំរួចរាល់

source: The device has been set up and can now be used.
km: ឧបករណ៍នេះត្រូវបានតំឡើងហើយឥឡូវអាចប្រើបាន។

# Placeholder is device name
source: The device '%1' has been set up and can now be used.
km: ឧបករណ៍ '%1' ត្រូវបានបង្កើតឡើងហើយឥឡូវអាចប្រើបាន។
