Repository: koompi/kde-khmer-translation
Catalog: applications_stable_kf5-based/messages/bluedevil/bluedevil._desktop_.po
Languages: km

# Name
source: Bluetooth
km: ប៊្លូធូស

# Comment
source: Bluetooth status and control
km: ស្ថានភាពប៊្លូធូសនិងការគ្រប់គ្រង

# Comment
source: Bluetooth system
km: ប្រព័ន្ធប៊្លូធូស

# Name
source: Authorization Requested
km: ការស្នើសុំការអនុញ្ញាត

# Comment
source: A device wants to connect
km: ឧបករណ៍ចង់ភ្ជាប់

# Name
source: Confirm PIN
km: បញ្ជាក់លេខសម្ងាត់

# Comment
source: Confirm a device request using matching PINs
km: បញ្ជាក់ការស្នើសុំឧបករណ៍ដោយប្រើលេខកូដសម្ងាត់ដែលត្រូវគ្នា

# Name
source: Request PIN
km: ស្នើសុំលេខសម្ងាត់

# Comment
source: A PIN is needed
km: ត្រូវការលេខសម្ងាត់

# Name
source: Incoming File
km: ឯកសារចូល

# Comment
source: Incoming file transfer
km: ផ្ទេរឯកសារចូល

# Name
source: Connection Failed
km: ការ​ត​ភ្ជាប់​បាន​បរាជ័យ

# Comment
source: Connection to device failed
km: ការភ្ជាប់ទៅឧបករណ៍បានបរាជ័យ

# Name
source: Device Setup Finished
km: ការដំឡើងឧបករណ៍បានបញ្ចប់

# Comment
source: Setting up a Bluetooth device finished successfully
km: ការដំឡើងឧបករណ៍ប៊្លូធូសបានបញ្ចប់ដោយជោគជ័យ

# Comment
source: Manage bluetooth devices
km: គ្រប់គ្រងឧបករណ៍ប៊្លូធូស

# Name
source: BlueDevil Send File
km: BlueDevil ផ្ញើឯកសារ

# GenericName
source: BlueDevil Send File
km: BlueDevil ផ្ញើឯកសារ

# Comment
source: BlueDevil Send File
km: ប៊្លូឌីវីលផ្ញើឯកសារ

# Name
source: BlueDevil Wizard
km: ជំនួយការ BlueDevil

# GenericName
source: BlueDevil Wizard
km: ជំនួយការ BlueDevil

# Comment
source: BlueDevil Wizard
km: ជំនួយការ BlueDevil
